[
  {
    "_id": "640c2dd963a319ea671e3668",
    "name": "Basil Leaves",
    "desc": "Basil, also called great basil, is a culinary herb of the family Lamiaceae (mints).\r\n",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564216/c8mwndz8kbgb29wjn4eg.png"
  },
  {
    "_id": "640c2dd963a319ea671e3665",
    "name": "Baking Powder",
    "desc": "Baking powder is a dry chemical leavening agent, a mixture of a carbonate or bicarbonate and a weak acid. The base and acid are prevented from reacting prematurely by the inclusion of a buffer such as cornstarch. Baking powder is used to increase the volume and lighten the texture of baked goods. It works by releasing carbon dioxide gas into a batter or dough through an acid-base reaction, causing bubbles in the wet mixture to expand and thus leavening the mixture. The first single-acting baking powder was developed by Birmingham based food manufacturer Alfred Bird in England in 1843. The first double-acting baking powder was developed by Eben Norton Horsford in America in the 1860s.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564216/c6pfcmnzzmra22yqgyjq.png"
  },
  {
    "_id": "640c2dd963a319ea671e3678",
    "name": "Bread",
    "desc": "A staple food made from flour, water, and yeast or other leavening agents, which is typically baked in an oven and used for sandwiches, toast, and other dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/eunxtuoyla4xddjr6rvg.png"
  },
  {
    "_id": "640c2dd963a319ea671e36bf",
    "name": "Diced Tomatoes",
    "desc": "Tomatoes that have been chopped into small, evenly sized pieces. They are often canned and used in soups, stews, sauces, and other dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/rc91vkjatttdt8pkpm9h.png"
  },
  {
    "_id": "640c2dd963a319ea671e36e5",
    "name": "Garlic Powder",
    "desc": "A finely ground powder made from dehydrated garlic cloves often used as a seasoning in cooking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/b6myebqn7gcryqi5dm1v.png"
  },
  {
    "_id": "640c2dd963a319ea671e36cf",
    "name": "Farfalle",
    "desc": "A type of pasta shaped like a bow tie or butterfly.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564797/jgwujfs7lp8bvymction.png"
  },
  {
    "_id": "640c2dd963a319ea671e3804",
    "name": "Smoked Haddock",
    "desc": "Haddock that has been smoked over wood chips, giving it a distinctive smoky flavor",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/f0srrlkrcofoweeum9q7.png"
  },
  {
    "_id": "640c2dd963a319ea671e370a",
    "name": "Kosher Salt",
    "desc": "A type of coarse salt that is used in koshering meat and has a larger grain size than regular table salt. Kosher salt is often preferred by chefs because it is easier to control the amount used and has a milder flavor than other salts.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/tmsgimjaadvlm3hnfadc.png"
  },
  {
    "_id": "640c2dd963a319ea671e3873",
    "name": "Ground Pork",
    "desc": "Ground meat, called mince or minced meat outside of North America (i.e. in U.K. and Commonwealth countries), and keema or qeema (Hindustani: क़ीमा (Devanagari), قیمہ (Nastaleeq), (pronounced [ˈqiːmaː])) in the Indian subcontinent, is meat finely chopped by a meat grinder or a chopping knife. A common type of ground meat is ground beef, but many other types of meats are prepared in a similar fashion, including pork, lamb, and poultry. In the Indian subcontinent, both mutton and goat meat are also minced to produce keema.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e36aa",
    "name": "Coconut Cream",
    "desc": "A thick, rich cream made from coconut meat, commonly used in Thai and other Southeast Asian cuisine to add flavor and texture to dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/vrglangws4hsdwk0zaey.png"
  },
  {
    "_id": "640c2dd963a319ea671e3831",
    "name": "Desiccated Coconut",
    "desc": "Dried, shredded coconut used in baking and as a topping for desserts and curries.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/wbhzqpwhd3n90tjxnjo5.png"
  },
  {
    "_id": "640c2dd963a319ea671e36dc",
    "name": "French Lentils",
    "desc": "Small, greenish-brown lentils that have a slightly nutty flavor and a firm texture. They hold their shape well when cooked and are often used in salads and stews.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/mw4ykabvnb6etfmsgmyn.png"
  },
  {
    "_id": "640c2dd963a319ea671e3720",
    "name": "Minced Garlic",
    "desc": "Garlic cloves that have been finely chopped or crushed, commonly used as a flavoring in various cuisines.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/xsgq26pjyvdbkssjgkc8.png"
  },
  {
    "_id": "640c2dd963a319ea671e386f",
    "name": "Sweet Potatoes",
    "desc": "The sweet potato or sweetpotato is a dicotyledonous plant that belongs to the bindweed or morning glory family, Convolvulaceae. Its large, starchy, sweet-tasting, tuberous roots are a root vegetable. The young leaves and shoots are sometimes eaten as greens.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e3682",
    "name": "Cannellini Beans",
    "desc": "A type of white bean that is commonly used in Italian cuisine, with a creamy texture and a mild, nutty flavor that is often used in soups, salads, and pasta dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/dtbcevd5t08bbx3d1b8e.png"
  },
  {
    "_id": "640c2dd963a319ea671e36b1",
    "name": "Coriander Seeds",
    "desc": "The dried seeds of the coriander plant, commonly used as a spice in cooking. They have a slightly sweet, citrusy flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/jlagqtuvld0vszisqjd5.png"
  },
  {
    "_id": "640c2dd963a319ea671e3769",
    "name": "Smoked Paprika",
    "desc": "Smoked paprika is a type of paprika that has been smoked over wood to give it a smoky flavor. It is commonly used in Spanish and Mexican cuisine, and can be used to add flavor to meats, stews, and soups.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564916/hgmtkb13qwg6xv0e7ady.png"
  },
  {
    "_id": "640c2dd963a319ea671e3752",
    "name": "Refried Beans",
    "desc": "Cooked and mashed beans, typically pinto beans, that are fried in oil or lard along with various seasonings and often used as a filling in burritos, tacos, and other Mexican dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/aajl2htasmw6qqth2ror.png"
  },
  {
    "_id": "640c2dd963a319ea671e37e4",
    "name": "Peaches",
    "desc": "Peaches are a juicy fruit with fuzzy skin and a sweet flavor. They are commonly eaten fresh or used in desserts, jams, and other culinary applications.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/qhppralhambqco2mzmeo.png"
  },
  {
    "_id": "640c2dd963a319ea671e382c",
    "name": "Pears",
    "desc": "A sweet and juicy fruit with a soft, grainy texture and thin skin.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/njafxdc9oaowdrjrgnf8.png"
  },
  {
    "_id": "640c2dd963a319ea671e3827",
    "name": "Prosciutto",
    "desc": "A thinly sliced, dry-cured ham from Italy, often used as a topping for pizzas and pastas or served on charcuterie boards",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/bwpcajwbvahyh8usox37.png"
  },
  {
    "_id": "640c2dd963a319ea671e37d6",
    "name": "Blueberries",
    "desc": "Small, sweet, and juicy blue fruits often used in baking or as a topping for breakfast foods such as pancakes, waffles, and yogurt bowls.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564977/j91tw5bdxdnm9f7grjdw.png"
  },
  {
    "_id": "640c2dd963a319ea671e3890",
    "name": "Jam",
    "desc": "Fruit preserves are preparations of fruits, vegetables and sugar, often stored in glass jam jars and Mason jars.\r\n\r\nMany varieties of fruit preserves are made globally, including sweet fruit preserves, such as those made from strawberry or apricot, and savory preserves, such as those made from tomatoes or squash. The ingredients used and how they are prepared determine the type of preserves; jams, jellies, and marmalades are all examples of different styles of fruit preserves that vary based upon the fruit used. In English, the word, in plural form, \"preserves\" is used to describe all types of jams and jellies.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565178/wdjvroaas5vno4eueave.png"
  },
  {
    "_id": "640c2dd963a319ea671e37aa",
    "name": "Squid",
    "desc": "A type of cephalopod with a soft, cylindrical body and long tentacles, often used in seafood dishes such as calamari or grilled squid.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/wpelp0dvflv2bvsu2yhu.png"
  },
  {
    "_id": "640c2dd963a319ea671e36df",
    "name": "Freshly Chopped Parsley",
    "desc": "A bright green herb with curly or flat leaves that is often used as a garnish, but can also be used to add flavor and nutrition to dishes. It has a mild, slightly bitter taste that complements a wide range of flavors.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564797/nrtf8mvkasarxeix5rus.png"
  },
  {
    "_id": "640c2dd963a319ea671e3783",
    "name": "Turmeric Powder",
    "desc": "A ground spice made from the root of the turmeric plant, commonly used as a seasoning and coloring agent in Indian and Southeast Asian cuisines.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/ejah1c0uh5ekw22mesr8.png"
  },
  {
    "_id": "640c2dd963a319ea671e36d4",
    "name": "Fish Sauce",
    "desc": "A pungent, salty sauce made from fermented fish commonly used in Southeast Asian cuisine as a seasoning and condiment.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564797/p31p3s3ngziqddukd2os.png"
  },
  {
    "_id": "640c2dd963a319ea671e3745",
    "name": "Potato Starch",
    "desc": "A fine, white powder that is extracted from potatoes and is used as a thickening agent in cooking and baking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/fawxnbwcxuf9vj2evv3s.png"
  },
  {
    "_id": "640c2dd963a319ea671e3762",
    "name": "Self-raising Flour",
    "desc": "Self-raising flour is a type of flour that has a leavening agent, usually baking powder, already added to it. This allows baked goods to rise without the need for yeast or other leavening agents.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564916/dumsharepegy0ambfrek.png"
  },
  {
    "_id": "640c2dd963a319ea671e377b",
    "name": "Thai Red Curry Paste",
    "desc": "A spicy blend of herbs and spices, including red chilies, lemongrass, and ginger, used as a base for Thai red curry.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/oexcyjjtelilqru7b5ij.png"
  },
  {
    "_id": "640c2dd963a319ea671e37fe",
    "name": "Oysters",
    "desc": "Edible bivalve mollusks with a tough, irregularly shaped shell, typically eaten raw or cooked and often served as a delicacy.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/rhj1xexgcpxsppsuuiy7.png"
  },
  {
    "_id": "640c2dd963a319ea671e385a",
    "name": "White Wine Vinegar",
    "desc": "Wine vinegar is made from red or white wine, and is the most commonly used vinegar in Southern and Central Europe, Cyprus and Israel. As with wine, there is a considerable range in quality. Better-quality wine vinegars are matured in wood for up to two years, and exhibit a complex, mellow flavor. Wine vinegar tends to have a lower acidity than white or cider vinegars. More expensive wine vinegars are made from individual varieties of wine, such as champagne, sherry, or pinot gris.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565046/taieggigafj66sbrpap2.png"
  },
  {
    "_id": "640c2dd963a319ea671e3860",
    "name": "Allspice",
    "desc": "A spice made from the dried berries of the Pimenta dioica plant, with a flavor profile that is a combination of cinnamon, nutmeg, and cloves, commonly used in Caribbean and Latin American cuisine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/t8u4ogpqcghpzuiddoxl.png"
  },
  {
    "_id": "640c2dd963a319ea671e3671",
    "name": "Biryani Masala",
    "desc": "Biryani, also known as biriyani, biriani, birani or briyani, is a mixed rice dish with its origins among the Muslims of the Indian subcontinent. It can be compared to mixing a curry, later combining it with semi-cooked rice separately. This dish is especially popular throughout the Indian subcontinent, as well as among the diaspora from the region. It is also prepared in other regions such as Iraqi Kurdistan. It is made with Indian spices, rice, meat (chicken, goat, beef, lamb, prawn, or fish), vegetables or eggs.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564217/fnx2cxxuuca5qwslkcts.png"
  },
  {
    "_id": "640c2dd963a319ea671e36bd",
    "name": "Dark Soy Sauce",
    "desc": "A type of soy sauce that is aged for a longer period of time than light soy sauce, giving it a darker color, thicker consistency, and more intense flavor. It is often used in marinades, stir-fries, and braised dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564742/tzfaicrr9acagjxtg9tp.png"
  },
  {
    "_id": "640c2dd963a319ea671e3877",
    "name": "Beef Stock Concentrate",
    "desc": "Stock, sometimes called bone broth, is a savory cooking liquid that forms the basis of many dishes, particularly soups, stews and sauces. Making stock involves simmering animal bones or meat, seafood, or vegetables in water or wine, often for an extended period of time. Mirepoix or other aromatics may be added for more flavor.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e387d",
    "name": "Pita Bread",
    "desc": "Pita or pitta, is a family of yeast-leavened round flatbreads baked from wheat flour, common in the Mediterranean, Middle East, and neighboring areas.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/fhop2igipil2omv8vade.png"
  },
  {
    "_id": "640c2dd963a319ea671e3688",
    "name": "Cayenne Pepper",
    "desc": "A type of chili pepper that is often used to add heat and spice to dishes, with a bright red color and a pungent, fiery flavor that can range from mild to very hot.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/xfbyzeybhnw2w4xke6nu.png"
  },
  {
    "_id": "640c2dd963a319ea671e36db",
    "name": "Free-range Eggs, Beaten",
    "desc": "Chicken eggs from free-range chickens that have been whisked together until the whites and yolks are fully mixed.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564797/vgrkykfsutx3tgdpcfsp.png"
  },
  {
    "_id": "640c2dd963a319ea671e36fd",
    "name": "Honey",
    "desc": "Honey is a natural sweetener that is made by bees from the nectar of flowers. It is commonly used in cooking and baking to add sweetness and flavor to dishes, as well as a natural remedy for coughs and sore throats.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/lqtybzr3qlhxwl81g546.png"
  },
  {
    "_id": "640c2dd963a319ea671e365d",
    "name": "Beef",
    "desc": "Beef is the culinary name for meat from cattle, particularly skeletal muscle. Humans have been eating beef since prehistoric times. Beef is a source of high-quality protein and nutrients.\r\n\r\nMost beef skeletal muscle meat can be used as is by merely cutting into certain parts, such as roasts, short ribs or steak (filet mignon, sirloin steak, rump steak, rib steak, rib eye steak, hanger steak, etc.), while other cuts are processed (corned beef or beef jerky). Trimmings, on the other hand, are usually mixed with meat from older, leaner (therefore tougher) cattle, are ground, minced or used in sausages. The blood is used in some varieties called blood sausage. Other parts that are eaten include other muscles and offal, such as the oxtail, liver, tongue, tripe from the reticulum or rumen, glands (particularly the pancreas and thymus, referred to as sweetbread), the heart, the brain (although forbidden where there is a danger of bovine spongiform encephalopathy, BSE, commonly referred to as mad cow disease), the kidneys, and the tender testicles of the bull (known in the United States as calf fries, prairie oysters, or Rocky Mountain oysters). Some intestines are cooked and eaten as is, but are more often cleaned and used as natural sausage casings. The bones are used for making beef stock.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564124/zzxbvvvye3pnooygfdgg.png"
  },
  {
    "_id": "640c2dd963a319ea671e367b",
    "name": "Brown Lentils",
    "desc": "A type of lentil that has a mild, earthy flavor and a soft texture when cooked, often used in soups, stews, and curries.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564673/urqbhwtbxv5zvgytfp3y.png"
  },
  {
    "_id": "640c2dd963a319ea671e36f6",
    "name": "Ground Almonds",
    "desc": "Ground almonds are finely powdered almonds that can be used as a gluten-free alternative to wheat flour in baking or as a topping for dishes like oatmeal or yogurt.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/utvplhpheg7fn1mev30k.png"
  },
  {
    "_id": "640c2dd963a319ea671e36e6",
    "name": "Garlic Sauce",
    "desc": "A sauce made from garlic, often combined with other ingredients such as lemon juice, olive oil, and herbs, commonly used as a dip or condiment.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564797/h7petagg0u53hjr0wdcq.png"
  },
  {
    "_id": "640c2dd963a319ea671e3806",
    "name": "Raisins",
    "desc": "Dried grapes that are small, sweet and chewy, often used in baking and as a snack.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/ys5ivmmzza6qdakne1hl.png"
  },
  {
    "_id": "640c2dd963a319ea671e3840",
    "name": "Scotch Bonnet",
    "desc": "Scotch bonnet, also known as bonney peppers, or Caribbean red peppers, is a variety of chili pepper named for its resemblance to a tam o' shanter hat. Also called ata rodo by Yoruba speakers of Nigeria, it is found mainly in the Caribbean islands; it is also found in Guyana (where it is called the ball-of-fire pepper), the Maldives Islands (where it is called githeyo mirus), Panama (where it is called aji chombo) and West Africa. Most Scotch bonnets have a heat rating of 100,000–350,000 Scoville units. For comparison, most jalapeño peppers have a heat rating of 2,500 to 8,000 on the Scoville scale. However, completely sweet varieties of Scotch bonnet are grown on some of the Caribbean islands, called cachucha peppers.\r\n\r\nThese peppers are used to flavour many different dishes and cuisines worldwide and are often used in hot sauces and condiments. The Scotch bonnet has a sweeter flavour and stouter shape, distinct from its habanero relative with which it is often confused, and gives jerk dishes (pork/chicken) and other Caribbean dishes their unique flavour. Scotch bonnets are mostly used in West African, Antiguan, Kittitian/Nevisian, Anguilan, Dominican, St. Lucian, St Vincentian, Grenadian, Trinidadian, Jamaican, Barbadian, Guyanese, Surinamese, Haitian and Cayman cuisines and pepper sauces, though they often show up in other Caribbean recipes. It is also used in Costa Rica and Panama for Caribbean-styled recipes such as rice and beans, Rondón, saus, beef patties, and Ceviche.\r\n\r\nFresh, ripe Scotch bonnets can change from green to yellow to scarlet red, however many other breeds of this pepper can ripen to orange, yellow, peach, or even a chocolate brown.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e37eb",
    "name": "Truffle Oil",
    "desc": "Truffle oil is a flavored oil made by infusing oil with truffle essence. It is commonly used to add a rich, earthy flavor to dishes such as pasta, risotto, and mashed potatoes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564976/v48ydxm8zn1mr4rxml9w.png"
  },
  {
    "_id": "640c2dd963a319ea671e379b",
    "name": "Pretzels",
    "desc": "A type of baked snack food made from dough that is shaped into a distinctive knot or twisted shape, then boiled in water and baked. Often served as a snack with dips or as a side dish with beer.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/aieto6rwcsmeg24lkcec.png"
  },
  {
    "_id": "640c2dd963a319ea671e3687",
    "name": "Caster Sugar",
    "desc": "A type of fine sugar that is commonly used in baking and cooking, with a fine texture that dissolves easily, and is often used in recipes that require quick mixing or dissolving, such as meringues, whipped cream, and cakes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564673/fbkmvnc8830ng9d8j6ld.png"
  },
  {
    "_id": "640c2dd963a319ea671e371b",
    "name": "Marjoram",
    "desc": "Marjoram is a herb that is commonly used as a seasoning for meat, fish, and vegetable dishes. It has a slightly sweet and floral flavor, and is often used in Mediterranean and Middle Eastern cuisines.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564856/dkhemump33aukbk8wktc.png"
  },
  {
    "_id": "640c2dd963a319ea671e37f5",
    "name": "Cabbage",
    "desc": "A leafy green or purple vegetable that is often used in salads, coleslaw, and stir-fry dishes, and is also commonly fermented into sauerkraut.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/jm8ucv9yfwvdy8bxtfjt.png"
  },
  {
    "_id": "640c2dd963a319ea671e3833",
    "name": "Minced Pork",
    "desc": "Ground pork used in a variety of dishes, such as meatballs, burgers, and stir-fries.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e371f",
    "name": "Milk",
    "desc": "A white liquid produced by mammals as food for their young, commonly used as a drink or ingredient in cooking and baking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/ly0kwisb5ripennlkqma.png"
  },
  {
    "_id": "640c2dd963a319ea671e37d7",
    "name": "Walnuts",
    "desc": "Hard-shelled nuts that are rich in healthy fats and protein, often used in baking, snacking, or as a garnish for salads.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/xxkmqvivfd49dwbisfs9.png"
  },
  {
    "_id": "640c2dd963a319ea671e3865",
    "name": "Anchovy Fillet",
    "desc": "Anchovies are tiny, silvery fish that come from the Mediterranean and southern European coasts. They're sold salt-cured, usually oil-packed, and filleted. Commonly they come either flat or rolled in cans or jars, or ground and mixed with oil or butter to make a paste that is sold in tubes. On their own, anchovies are very salty but mixed into sauces, dressings, or pastas they add a wonderful depth of flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/ouwp4xl5sz0cfdaxexbj.png"
  },
  {
    "_id": "640c2dd963a319ea671e372b",
    "name": "Oil",
    "desc": "A cooking ingredient that is derived from various sources, such as plants, nuts, seeds, and animals, and is often used for frying, sautéing, and as a salad dressing.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/edxbnl03xkxnw8nwvb1b.png"
  },
  {
    "_id": "640c2dd963a319ea671e377d",
    "name": "Tomato Ketchup",
    "desc": "A thick, sweet and tangy sauce made from tomatoes, vinegar, and sugar, commonly used as a condiment for burgers, hot dogs, and french fries.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564910/q8iiqiz6g6kfpo21i27f.png"
  },
  {
    "_id": "640c2dd963a319ea671e3707",
    "name": "Kale",
    "desc": "A leafy green vegetable that is a member of the cabbage family. Kale is known for its nutrient density and can be eaten raw or cooked in a variety of dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/jp2gq680sw2stfnxyghw.png"
  },
  {
    "_id": "640c2dd963a319ea671e3754",
    "name": "Rice Noodles",
    "desc": "Thin, translucent noodles made from rice flour and water and commonly used in Southeast Asian cuisine, such as in pho or pad thai.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564912/oygvxr9j8vukz8da0wvo.png"
  },
  {
    "_id": "640c2dd963a319ea671e376e",
    "name": "Spaghetti",
    "desc": "A type of pasta that is long, thin, and cylindrical in shape. It is commonly used in Italian cuisine and is often served with tomato sauce, meatballs, or other sauces and toppings.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564909/ltnxeqjr2grcio9r81hd.png"
  },
  {
    "_id": "640c2dd963a319ea671e37af",
    "name": "Tomato",
    "desc": "A juicy, edible fruit that is often used as a vegetable in cooking. Tomatoes are a good source of vitamin C, potassium, and lycopene, a powerful antioxidant.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/mfx1ee9qus3hmbtyrx69.png"
  },
  {
    "_id": "640c2dd963a319ea671e36f3",
    "name": "Green Olives",
    "desc": "Olives that are harvested before they are fully ripe and have a firm texture and slightly bitter flavor commonly used in salads, sandwiches, and as a snack.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/wsc9q0gthn85ppthqizm.png"
  },
  {
    "_id": "640c2dd963a319ea671e3817",
    "name": "White Flour",
    "desc": "Refined flour made from wheat grains with bran and germ removed",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/psljqbbmdag95ylujfvg.png"
  },
  {
    "_id": "640c2dd963a319ea671e37b3",
    "name": "Pappardelle Pasta",
    "desc": "A broad, flat pasta noodle that originated in Tuscany, Italy. Pappardelle is often served with rich, meaty sauces.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/j9aqyywee5rcjkcsbyya.png"
  },
  {
    "_id": "640c2dd963a319ea671e369c",
    "name": "Chilli Powder",
    "desc": "A spice blend made from ground dried chili peppers and other spices, commonly used in Mexican, Indian, and Thai cuisine to add heat and flavor to dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/iwujusnj5m6vctffscq7.png"
  },
  {
    "_id": "640c2dd963a319ea671e380b",
    "name": "Blackberries",
    "desc": "Sweet and juicy berries with a dark color and slightly tart taste, often used in jams, pies, and smoothies.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/ts3tylo48v0vnjetbple.png"
  },
  {
    "_id": "640c2dd963a319ea671e385e",
    "name": "Ancho Chillies",
    "desc": "A type of dried chili pepper that is commonly used in Mexican cuisine, with a mild to medium heat level and a fruity, smoky flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/gkvwhtzuvherud2rbg5w.png"
  },
  {
    "_id": "640c2dd963a319ea671e37bb",
    "name": "Rapeseed Oil",
    "desc": "Oil extracted from the seeds of the rapeseed plant, commonly used for cooking and frying.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564910/ghlhsjeeq9u087mgrgsp.png"
  },
  {
    "_id": "640c2dd963a319ea671e380d",
    "name": "Braeburn Apples",
    "desc": "A type of apple with a crisp texture and a balanced sweet and tart flavor, often used in cooking and eating raw.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/pypikv0dvz5iqpdvy49u.png"
  },
  {
    "_id": "640c2dd963a319ea671e380e",
    "name": "Red Food Colouring",
    "desc": "A type of food coloring used to add a bright red color to foods and drinks.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/oikhfyhrzdl4wgd9n19s.png"
  },
  {
    "_id": "640c2dd963a319ea671e3857",
    "name": "Rum",
    "desc": "Rum is a distilled alcoholic drink made from sugarcane byproducts, such as molasses, or directly from sugarcane juice, by a process of fermentation and distillation. The distillate, a clear liquid, is then usually aged in oak barrels.\r\n\r\nThe majority of the world's rum production occurs in the Caribbean and Latin America. Rum is also produced in Australia, Portugal, Austria, Canada, Fiji, India, Japan, Mauritius, Nepal, New Zealand, the Philippines, Reunion Island, South Africa, Spain, Sweden, Taiwan, Thailand, the United Kingdom and the United States.\r\n\r\nRums are produced in various grades. Light rums are commonly used in cocktails, whereas \"golden\" and \"dark\" rums were typically consumed straight or neat, on the rocks, or used for cooking, but are now commonly consumed with mixers. Premium rums are also available, made to be consumed either straight or iced.\r\n\r\nRum plays a part in the culture of most islands of the West Indies as well as in The Maritimes and Newfoundland. This drink has famous associations with the Royal Navy (where it was mixed with water or beer to make grog) and piracy (where it was consumed as bumbo). Rum has also served as a popular medium of economic exchange, used to help fund enterprises such as slavery (see Triangular trade), organized crime, and military insurgencies (e.g., the American Revolution and Australia's Rum Rebellion).",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565032/kwhfwn0emampe0otdogi.png"
  },
  {
    "_id": "640c2dd963a319ea671e3788",
    "name": "Vegan Butter",
    "desc": "A non-dairy alternative to butter made from plant-based oils, such as coconut, palm, or soybean oil, that is commonly used in vegan and dairy-free cooking and baking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564912/ci06xzpogga7qmj14mpg.png"
  },
  {
    "_id": "640c2dd963a319ea671e37d8",
    "name": "Pecan Nuts",
    "desc": "Sweet, buttery nuts with a slightly softer texture than walnuts, often used in baking or as a topping for pies, salads, or ice cream.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/qdxw4unr2bjq4d7izvup.png"
  },
  {
    "_id": "640c2dd963a319ea671e387a",
    "name": "Mayonnaise",
    "desc": "Mayonnaise, informally mayo is a thick cold condiment or dressing commonly used in sandwiches and composed salads or on French fries. It is also a base in sauces such as Tartar sauce.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/prurlqnmtsnk6vcbhrmn.png"
  },
  {
    "_id": "640c2dd963a319ea671e37b4",
    "name": "Paccheri Pasta",
    "desc": "A large, tube-shaped pasta noodle that originated in Southern Italy. Paccheri is often stuffed and baked, or served with tomato-based sauces.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564916/labvxwc7mmokkwbgyhwa.png"
  },
  {
    "_id": "640c2dd963a319ea671e36a2",
    "name": "Chorizo",
    "desc": "A spicy sausage that is commonly used in Spanish, Mexican, and Portuguese cuisine, made with pork, garlic, and smoked paprika.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/che1ta2kgkfzz8mcqvzg.png"
  },
  {
    "_id": "640c2dd963a319ea671e36c2",
    "name": "Doner Meat",
    "desc": "A type of meat that is typically made from lamb, chicken, or beef that has been seasoned and cooked on a vertical rotisserie. It is commonly used in Middle Eastern and Mediterranean cuisine, and is often served in sandwiches or wraps.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/f4w7b2ye1zk9asudxf7z.png"
  },
  {
    "_id": "640c2dd963a319ea671e36da",
    "name": "Free-range Egg, Beaten",
    "desc": "A chicken egg from free-range chickens that has been whisked together until the whites and yolks are fully mixed.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564797/tnwss9iqaklaysqakrpf.png"
  },
  {
    "_id": "640c2dd963a319ea671e3793",
    "name": "White Vinegar",
    "desc": "A clear, colorless vinegar made from fermented grains or malt, used for cooking, cleaning, and pickling.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/vcoythjoxozq1npcxlnh.png"
  },
  {
    "_id": "640c2dd963a319ea671e37c0",
    "name": "Butternut Squash",
    "desc": "Winter squash with a sweet, nutty flavor, commonly used in soups, stews, and roasted dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564977/nwqd1a6uo09p935ytybx.png"
  },
  {
    "_id": "640c2dd963a319ea671e3674",
    "name": "Borlotti Beans",
    "desc": "A type of bean, also known as cranberry beans, with a creamy texture and a nutty flavor that is often used in Italian cuisine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564217/pxshq8flkmtoi27kmunq.png"
  },
  {
    "_id": "640c2dd963a319ea671e36ab",
    "name": "Coconut Milk",
    "desc": "A milky liquid made from coconut meat, commonly used in Indian, Thai, and other Southeast Asian cuisine to add flavor and creaminess to dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564742/v9maicvu7qhxdgecbmqe.png"
  },
  {
    "_id": "640c2dd963a319ea671e3763",
    "name": "Semi-skimmed Milk",
    "desc": "Semi-skimmed milk is a type of milk that has had some, but not all, of the cream removed. It typically has a lower fat content than whole milk, but is not as low in fat as skimmed milk.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/rzl1wep2ocmfgyikjgjv.png"
  },
  {
    "_id": "640c2dd963a319ea671e373e",
    "name": "Penne Rigate",
    "desc": "A type of pasta with a tube-like shape and ridges on the outside, commonly used in Italian cuisine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/p4dv8a4glogvfqcnjcwi.png"
  },
  {
    "_id": "640c2dd963a319ea671e375d",
    "name": "Salsa",
    "desc": "Tomato-based sauce or dip with various ingredients such as onion, chili peppers, and herbs, commonly used in Mexican cuisine as a condiment or for dipping tortilla chips.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564916/qhr4adon63lticoroasa.png"
  },
  {
    "_id": "640c2dd963a319ea671e37a3",
    "name": "Clotted Cream",
    "desc": "A thick, rich cream made by heating unpasteurized cow's milk until a layer of cream forms on the surface and is then skimmed off.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/f4zo0trkkw0djg8z07dz.png"
  },
  {
    "_id": "640c2dd963a319ea671e367f",
    "name": "Cacao",
    "desc": "The dried and fermented seed of the cocoa tree, which is processed into cocoa powder and chocolate products, and used in baking, confectionery, and other food products.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564673/r0ngswckewyzjljvdejl.png"
  },
  {
    "_id": "640c2dd963a319ea671e3770",
    "name": "Spring Onions",
    "desc": "Also known as scallions or green onions, these are young onions that have a mild flavor and are commonly used as a garnish or ingredient in salads, soups, stir-fries, and other dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564910/fcidqwl8vwgpwrovyuai.png"
  },
  {
    "_id": "640c2dd963a319ea671e3856",
    "name": "Light Rum",
    "desc": "Rum is a distilled alcoholic drink made from sugarcane byproducts, such as molasses, or directly from sugarcane juice, by a process of fermentation and distillation. The distillate, a clear liquid, is then usually aged in oak barrels.\r\n\r\nThe majority of the world's rum production occurs in the Caribbean and Latin America. Rum is also produced in Australia, Portugal, Austria, Canada, Fiji, India, Japan, Mauritius, Nepal, New Zealand, the Philippines, Reunion Island, South Africa, Spain, Sweden, Taiwan, Thailand, the United Kingdom and the United States.\r\n\r\nRums are produced in various grades. Light rums are commonly used in cocktails, whereas \"golden\" and \"dark\" rums were typically consumed straight or neat, on the rocks, or used for cooking, but are now commonly consumed with mixers. Premium rums are also available, made to be consumed either straight or iced.\r\n\r\nRum plays a part in the culture of most islands of the West Indies as well as in The Maritimes and Newfoundland. This drink has famous associations with the Royal Navy (where it was mixed with water or beer to make grog) and piracy (where it was consumed as bumbo). Rum has also served as a popular medium of economic exchange, used to help fund enterprises such as slavery (see Triangular trade), organized crime, and military insurgencies (e.g., the American Revolution and Australia's Rum Rebellion).",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565048/vrhwlxytv5oygmndkgzx.png"
  },
  {
    "_id": "640c2dd963a319ea671e3747",
    "name": "Prawns",
    "desc": "A type of seafood that has a sweet and delicate flavor. They are often used in dishes such as curries, stir-fries, and salads.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/xwy1vs6kim0ofmimbnsh.png"
  },
  {
    "_id": "640c2dd963a319ea671e377f",
    "name": "Tomatoes",
    "desc": "A juicy and flavorful fruit that comes in a variety of colors and sizes, commonly used in many cuisines around the world, particularly in Mediterranean and Latin American cuisines.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/ffdbunsbgbsqysaezexw.png"
  },
  {
    "_id": "640c2dd963a319ea671e37bf",
    "name": "Apricot",
    "desc": "Fruit with a soft, velvety skin and a sweet, juicy flesh, commonly eaten fresh or dried.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/z469gas4kjzbctmhlqw7.png"
  },
  {
    "_id": "640c2dd963a319ea671e37ac",
    "name": "Pilchards",
    "desc": "A type of small, oily fish similar to sardines, often canned in oil or tomato sauce and served as a snack or added to pasta dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564916/rbepfrdv5z97d4qfvj8y.png"
  },
  {
    "_id": "640c2dd963a319ea671e37f9",
    "name": "Baguette",
    "desc": "A long, thin loaf of French bread that has a crisp crust and a soft, chewy interior, and is often used for sandwiches and as an accompaniment to meals.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/yjadswvwxaf7rnv18yn6.png"
  },
  {
    "_id": "640c2dd963a319ea671e380f",
    "name": "Pink Food Colouring",
    "desc": "A type of food coloring used to add a pale pink color to foods and drinks.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564977/emxgbj2e355bzebz9lzf.png"
  },
  {
    "_id": "640c2dd963a319ea671e36e9",
    "name": "Ginger Cordial",
    "desc": "A sweet and spicy syrup made from ginger often used as a mixer in cocktails or diluted with water to make a non-alcoholic drink.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564797/qc4ywyfrrtmkqx1zshtp.png"
  },
  {
    "_id": "640c2dd963a319ea671e3761",
    "name": "Sea Salt",
    "desc": "Sea salt is a type of salt that is obtained by evaporating seawater. It is coarser and less refined than table salt, and contains trace amounts of minerals that give it a distinct flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564910/quxnhje7v1oexwhjbeor.png"
  },
  {
    "_id": "640c2dd963a319ea671e3894",
    "name": "Cider",
    "desc": "Cider (/ˈsaɪdər/ SY-dər) is an alcoholic beverage made from the fermented juice of apples. Cider is widely available in the United Kingdom (particularly in the West Country) and the Republic of Ireland. The UK has the world's highest per capita consumption, as well as its largest cider-producing companies. Ciders from the South West of England are generally stronger. Cider is also popular in many Commonwealth countries, such as India, Canada, Australia, and New Zealand. As well as the UK and its former colonies, cider is popular in Portugal (mainly in Minho and Madeira), France (particularly Normandy and Brittany), northern Italy (Piedmont and Friuli), and northern Spain (especially the Principality of Asturias and the Basque Country). Central Europe also has its own types of cider with Rhineland-Palatinate and Hesse producing a particularly tart version known as Apfelwein. In the U.S., varieties of fermented cider are often called hard cider to distinguish alcoholic cider from non-alcoholic apple cider or \"sweet cider\", also made from apples. In Canada, cider cannot be called cider if there are no apples. Furthermore, according to the Food and Drug Regulations in Canada, cider cannot contain less than 2.5% or over 13% absolute alcohol by volume.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565178/hvz8smz1bept57mnduph.png"
  },
  {
    "_id": "640c2dd963a319ea671e3829",
    "name": "Brie",
    "desc": "A soft, creamy cheese with a mild flavor and edible rind, often used in sandwiches and as a topping for crackers and breads",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564980/llhahlhqmzywaxhgos6e.png"
  },
  {
    "_id": "640c2dd963a319ea671e370b",
    "name": "Lamb",
    "desc": "A type of red meat that comes from young sheep. Lamb has a rich flavor and can be cooked in a variety of ways, including grilling, roasting, and stewing.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/xsyd9ssyigzoa9kna96h.png"
  },
  {
    "_id": "640c2dd963a319ea671e378c",
    "name": "Vinaigrette Dressing",
    "desc": "A sauce made with oil, vinegar, and seasonings, used as a dressing for salads or as a marinade for meats and vegetables.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564910/lyy4aki6xaifgzahpxig.png"
  },
  {
    "_id": "640c2dd963a319ea671e3838",
    "name": "Canola Oil",
    "desc": "A type of vegetable oil made from the rapeseed plant, commonly used for cooking due to its mild flavor and high smoke point.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565048/rc2whs0z51um0hisvk1h.png"
  },
  {
    "_id": "640c2dd963a319ea671e36c4",
    "name": "Dried Oregano",
    "desc": "A dried herb that is commonly used in Mediterranean and Mexican cuisine. It has a pungent, slightly bitter flavor that pairs well with tomato-based sauces, meats, and vegetables.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/wdgwr1lwcyh2tfxsltns.png"
  },
  {
    "_id": "640c2dd963a319ea671e372a",
    "name": "Nutmeg",
    "desc": "A spice that is made from the seed of the nutmeg tree, and is often used in cooking and baking for its warm, sweet, and spicy flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564856/vmfojwsclufqosygks6i.png"
  },
  {
    "_id": "640c2dd963a319ea671e3733",
    "name": "Paprika",
    "desc": "A spice made from ground dried peppers, commonly used in Hungarian, Spanish, and Indian cooking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564856/uct0beorkq4pbydv4i8b.png"
  },
  {
    "_id": "640c2dd963a319ea671e3736",
    "name": "Parmesan Cheese",
    "desc": "See Parmesan.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564856/ei2pe8fjos9khba4zap8.png"
  },
  {
    "_id": "640c2dd963a319ea671e36c3",
    "name": "Double Cream",
    "desc": "A type of cream that has a high fat content, typically around 48%. It is often used in desserts and sauces, as well as whipped for use as a topping.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/uq2rdez4471azswsbzyu.png"
  },
  {
    "_id": "640c2dd963a319ea671e36fe",
    "name": "Horseradish",
    "desc": "Horseradish is a pungent root vegetable that is often grated and used as a condiment or flavoring agent. It is commonly used in sauces, dressings, and as a garnish for dishes like roast beef or smoked fish.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564853/dgpx6ju40e5wkkklpvrz.png"
  },
  {
    "_id": "640c2dd963a319ea671e3822",
    "name": "Bouquet Garni",
    "desc": "A bundle of herbs, typically including bay leaves, thyme, and parsley, used to flavor soups, stews, and other dishes",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/qhmygbicv2xgt56gxopa.png"
  },
  {
    "_id": "640c2dd963a319ea671e3846",
    "name": "Water Chestnut",
    "desc": "Eleocharis dulcis, the Chinese water chestnut or water chestnut, is a grass-like sedge native to Asia (China, Japan, India, Philippines, etc.), Australia, tropical Africa, and various islands of the Pacific and Indian Oceans. It is grown in many countries for its edible corms.\r\n\r\nThe water chestnut is not a nut at all, but an aquatic vegetable that grows in marshes, under water, in the mud. It has stem-like, tubular green leaves that grow to about 1.5 m. The water caltrop, which also is referred to by the same name, is unrelated and often confused with the water chestnut.\r\n\r\nThe small, rounded corms have a crisp, white flesh and may be eaten raw, slightly boiled, or grilled, and often are pickled or tinned. They are a popular ingredient in Chinese dishes. In China, they are most often eaten raw, sometimes sweetened. They also may be ground into a flour form used for making water chestnut cake, which is common as part of dim sum cuisine. They are unusual among vegetables for remaining crisp even after being cooked or canned, because their cell walls are cross-linked and strengthened by certain phenolic compounds, such as oligomers of ferulic acid. This property is shared by other vegetables that remain crisp in this manner, including the tiger nut and lotus root. The corms contain the antibiotic agent puchiin, which is stable to high temperature. Apart from the edible corms, the leaves can be used for cattlefeed, mulch or compost.\r\n\r\nThe corms are rich in carbohydrates (about 90% by dry weight), especially starch (about 60% by dry weight), and are also a good source of dietary fiber, riboflavin, vitamin B6, potassium, copper, and manganese.\r\n\r\nIf eaten uncooked, the surface of the plants may transmit fasciolopsiasis.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565033/tk5yn73vwk3uzqwp5nf8.png"
  },
  {
    "_id": "640c2dd963a319ea671e37ee",
    "name": "Lentils",
    "desc": "Lentils are a type of legume that are commonly used in soups, stews, salads, and other culinary applications. They have a mild, nutty flavor and are high in protein, fiber, and other nutrients.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/otpum4iuf1wvedbu68x3.png"
  },
  {
    "_id": "640c2dd963a319ea671e36ee",
    "name": "Granulated Sugar",
    "desc": "A common sweetener made from sugar cane or sugar beet that has been refined and granulated.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564797/gywjatzz1ourjbtpjjtw.png"
  },
  {
    "_id": "640c2dd963a319ea671e36ef",
    "name": "Grape Tomatoes",
    "desc": "A small, bite-sized tomato variety with a sweet and slightly tangy flavor commonly used in salads and as a snack.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/drpubtdkaemrgoypwbbc.png"
  },
  {
    "_id": "640c2dd963a319ea671e3703",
    "name": "Italian Seasoning",
    "desc": "A blend of dried herbs and spices commonly used in Italian cuisine, including basil, oregano, rosemary, thyme, and garlic.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/rdhwevs3bhfpztwqsru1.png"
  },
  {
    "_id": "640c2dd963a319ea671e37a0",
    "name": "Caramel Sauce",
    "desc": "A sweet, sticky sauce made by heating sugar until it melts and caramelizes, often used as a topping for desserts.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/c9bwfjdgohwsppghhbiy.png"
  },
  {
    "_id": "640c2dd963a319ea671e37e3",
    "name": "Peanut Brittle",
    "desc": "Peanut brittle is a type of confection made with sugar, corn syrup, peanuts, and butter. It is cooked to a hard, brittle consistency and can be broken into pieces for snacking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/gutjpngxukaq80txupi4.png"
  },
  {
    "_id": "640c2dd963a319ea671e377e",
    "name": "Tomato Puree",
    "desc": "A thick, concentrated paste made from cooked and strained tomatoes, used as a base for sauces, soups, and stews.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/h4rdnf9unpjvlsiexzvx.png"
  },
  {
    "_id": "640c2dd963a319ea671e3673",
    "name": "Black Treacle",
    "desc": "Molasses (American English) or black treacle (British English) is a viscous product resulting from refining sugarcane or sugar beets into sugar. Molasses varies by amount of sugar, method of extraction, and age of plant. Sugarcane molasses is primarily used for sweetening and flavoring foods in the United States, Canada, and elsewhere. Molasses is a defining component of fine commercial brown sugar.\r\n\r\nSweet sorghum syrup may be colloquially called \"sorghum molasses\" in the southern United States.[2][3] Similar products include honey, maple syrup, corn syrup, and invert syrup. Most of these alternative syrups have milder flavors.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564217/c9wd2a3r2twkolwimz85.png"
  },
  {
    "_id": "640c2dd963a319ea671e3717",
    "name": "Little Gem Lettuce",
    "desc": "Little Gem lettuce is a small variety of lettuce that is similar in appearance to romaine lettuce, but smaller and more compact. It has a slightly sweet, nutty flavor and a crisp texture, and is commonly used in salads and sandwiches.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/g0aeflphsswvefabxysv.png"
  },
  {
    "_id": "640c2dd963a319ea671e3786",
    "name": "Vanilla Extract",
    "desc": "A concentrated liquid extract made from vanilla beans and alcohol, commonly used to add vanilla flavor to baked goods and desserts.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/vihnbbutrqkn3nvie2kq.png"
  },
  {
    "_id": "640c2dd963a319ea671e3787",
    "name": "Veal",
    "desc": "Meat from young calves, typically under 3 months of age, that is tender and mild in flavor. It is commonly used in dishes such as schnitzel, veal marsala, and veal piccata.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/jakpuou7l0hqniy7yhvo.png"
  },
  {
    "_id": "640c2dd963a319ea671e3842",
    "name": "Broad Beans",
    "desc": "Vicia faba, also known as the broad bean, fava bean, faba bean, field bean, bell bean, or tic bean, is a species of flowering plant in the pea and bean family Fabaceae. It is native to North Africa[dubious – discuss] southwest and south Asia, and extensively cultivated elsewhere.[citation needed] A variety Vicia faba var. equina Pers. – horse bean has been previously recognized.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565032/qqny3d4lwbwweijkqnau.png"
  },
  {
    "_id": "640c2dd963a319ea671e3847",
    "name": "Tofu",
    "desc": "Tofu, also known as bean curd, is a food cultivated by coagulating soy milk and then pressing the resulting curds into soft white blocks. It is a component in East Asian and Southeast Asian cuisines. Tofu can be soft, firm, or extra firm. Tofu has a subtle flavor and can be used in savory and sweet dishes. It is often seasoned or marinated to suit the dish.\r\n\r\nTofu has a low calorie count and relatively large amounts of protein. It is high in iron, and it can have a high calcium or magnesium content, depending on the coagulants used in manufacturing (e.g. calcium chloride, calcium sulfate, magnesium sulfate).",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e3897",
    "name": "Ciabatta",
    "desc": "Ciabatta is an Italian white bread made from wheat flour, water, salt, yeast and olive oil, created in 1982 by a baker in Adria, province of Rovigo, Veneto, Italy, in response to the popularity of French baguettes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565178/ci6wx9acobjr6anvvq7u.png"
  },
  {
    "_id": "640c2dd963a319ea671e372c",
    "name": "Olive Oil",
    "desc": "A type of oil made from pressing whole olives, commonly used in cooking and as a salad dressing.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/hzcfvlja7hmbp84z7f3q.png"
  },
  {
    "_id": "640c2dd963a319ea671e37be",
    "name": "Lamb Shoulder",
    "desc": "Meat from the shoulder of a young sheep, commonly used for slow cooking and stews.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564977/xm4rsayaoffutfmoo8ki.png"
  },
  {
    "_id": "640c2dd963a319ea671e37dc",
    "name": "Dark Chocolate Chips",
    "desc": "Small, bite-sized pieces of dark chocolate often used in baking cookies, brownies, or muffins, or as a topping for ice cream or yogurt bowls.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/shi3seyejmiwyg5mkkqs.png"
  },
  {
    "_id": "640c2dd963a319ea671e3825",
    "name": "Apples",
    "desc": "A round fruit with a crisp, juicy flesh, often used in baking and cooking for its sweet flavor and firm texture",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/gqfo3dzbf4k8tasgl63d.png"
  },
  {
    "_id": "640c2dd963a319ea671e382f",
    "name": "Tiger Prawns",
    "desc": "A large species of prawn known for their distinctive stripes and sweet flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565048/q61mdqu84wzyoopmxtt7.png"
  },
  {
    "_id": "640c2dd963a319ea671e3755",
    "name": "Rice Stick Noodles",
    "desc": "Thick, flat noodles made from rice flour and water and commonly used in Southeast Asian cuisine, such as in pad see ew or char kway teow.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/swkm4fqix5wppxunjgwd.png"
  },
  {
    "_id": "640c2dd963a319ea671e373c",
    "name": "Peas",
    "desc": "A type of legume with small, round, edible seeds, commonly used in soups, stews, and casseroles.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/fysi27rdu0tvx1o6ijbi.png"
  },
  {
    "_id": "640c2dd963a319ea671e37a9",
    "name": "Baby Squid",
    "desc": "Young, small-sized squid that are tender and flavorful, often grilled or sautéed and served as a seafood appetizer.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564913/w5bi6kslywi8qtos5pqy.png"
  },
  {
    "_id": "640c2dd963a319ea671e388b",
    "name": "Kielbasa",
    "desc": "Kielbasa is any type of meat sausage from Poland, and a staple of Polish cuisine. In American English the word typically refers to a coarse, U-shaped smoked sausage of any kind of meat, which closely resembles the Wiejska sausage in British English.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565048/a0gkkcv2cxsganyc1un1.png"
  },
  {
    "_id": "640c2dd963a319ea671e365b",
    "name": "Chicken",
    "desc": "The chicken is a type of domesticated fowl, a subspecies of the red junglefowl (Gallus gallus). It is one of the most common and widespread domestic animals, with a total population of more than 19 billion as of 2011. There are more chickens in the world than any other bird or domesticated fowl. Humans keep chickens primarily as a source of food (consuming both their meat and eggs) and, less commonly, as pets. Originally raised for cockfighting or for special ceremonies, chickens were not kept for food until the Hellenistic period (4th–2nd centuries BC).\r\n\r\nGenetic studies have pointed to multiple maternal origins in South Asia, Southeast Asia, and East Asia, but with the clade found in the Americas, Europe, the Middle East and Africa originating in the Indian subcontinent. From ancient India, the domesticated chicken spread to Lydia in western Asia Minor, and to Greece by the 5th century BC. Fowl had been known in Egypt since the mid-15th century BC, with the \"bird that gives birth every day\" having come to Egypt from the land between Syria and Shinar, Babylonia, according to the annals of Thutmose III.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564123/rw8pn3541bmukb8d3mio.png"
  },
  {
    "_id": "640c2dd963a319ea671e3756",
    "name": "Rice Vermicelli",
    "desc": "Thin, translucent noodles made from rice flour and water and commonly used in Southeast Asian cuisine, such as in bun or mi xao don.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/ix0wt7nk3d6zxpy6abhv.png"
  },
  {
    "_id": "640c2dd963a319ea671e3843",
    "name": "Red Snapper",
    "desc": "The northern red snapper (Lutjanus campechanus) is a species of snapper native to the western Atlantic Ocean including the Gulf of Mexico, where it inhabits environments associated with reefs. This species is commercially important and is also sought-after as a game fish.\r\n\r\nThe northern red snapper's body is very similar in shape to other snappers, such as the mangrove snapper, mutton snapper, lane snapper, and dog snapper. All feature a sloped profile, medium-to-large scales, a spiny dorsal fin, and a laterally compressed body. Northern red snapper have short, sharp, needle-like teeth, but they lack the prominent upper canine teeth found on the mutton, dog, and mangrove snappers. This snapper reaches maturity at a length of about 39 cm (15 in). The common adult length is 60 cm (24 in), but may reach 100 cm (39 in). The maximum published weight is 38 kg (84 lb), and the oldest reported age is 100+ years. Coloration of the northern red snapper is light red, with more intense pigment on the back. It has 10 dorsal spines, 14 soft dorsal rays, three anal spines and eight to 9 anal soft rays. Juvenile fish (shorter than 30–35 cm) can also have a dark spot on their sides, below the anterior soft dorsal rays, which fades with age.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/lltj0fvttjqqdazrm0ka.png"
  },
  {
    "_id": "640c2dd963a319ea671e37b5",
    "name": "Linguine Pasta",
    "desc": "A long, thin pasta noodle that is similar to spaghetti, but wider. Linguine is often served with seafood or tomato-based sauces.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564913/bbifzv1jfep3utuqv194.png"
  },
  {
    "_id": "640c2dd963a319ea671e3771",
    "name": "Squash",
    "desc": "A type of vegetable that comes in many different varieties, including butternut, acorn, and spaghetti squash. It is high in vitamins and fiber, and can be roasted, grilled, baked, or used in soups and stews.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/rbxk7dyy6608eom3f1sf.png"
  },
  {
    "_id": "640c2dd963a319ea671e36ae",
    "name": "Condensed Milk",
    "desc": "A thick, sweet milk product that is made by removing most of the water from regular milk. It is commonly used in baking and desserts.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564742/glvtuax30wnkhkrarnaz.png"
  },
  {
    "_id": "640c2dd963a319ea671e36cc",
    "name": "English Mustard",
    "desc": "A spicy, yellowish-brown mustard commonly used in British cuisine for sandwiches, dressings, and sauces.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/nm3mhlbjssnwjpxjn6s3.png"
  },
  {
    "_id": "640c2dd963a319ea671e3719",
    "name": "Mackerel",
    "desc": "Mackerel is a type of fish that is typically oily and has a strong, distinctive flavor. It is commonly used in a variety of dishes, including sushi, fish cakes, and smoked fish.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/q7l1k9khsblhpq6zuduo.png"
  },
  {
    "_id": "640c2dd963a319ea671e3737",
    "name": "Parmigiano-reggiano",
    "desc": "See Parmesan.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/r2evjtvipyqwcwylzg3t.png"
  },
  {
    "_id": "640c2dd963a319ea671e381f",
    "name": "Oats",
    "desc": "A type of cereal grain used for making oatmeal, granola, and other baked goods",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/vnfpfdkchtororgrabym.png"
  },
  {
    "_id": "640c2dd963a319ea671e384f",
    "name": "Cooking wine",
    "desc": "Splash into casseroles, sauces and marinades for a rounded vibrant flavour.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/ktxfedtpw0d9lndv6t5r.png"
  },
  {
    "_id": "640c2dd963a319ea671e37dd",
    "name": "Milk Chocolate",
    "desc": "A type of chocolate that is made with milk powder, sugar, and cocoa solids. It has a creamy and sweet taste.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/iuszeclwo8durgjmg6fs.png"
  },
  {
    "_id": "640c2dd963a319ea671e3823",
    "name": "Single Cream",
    "desc": "A light cream with a fat content of around 18%, often used in cooking and baking to add richness and flavor",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/oiroxv3q7wnowc1g6zjj.png"
  },
  {
    "_id": "640c2dd963a319ea671e387f",
    "name": "Quinoa",
    "desc": "Quinoa is a flowering plant in the amaranth family. It is an herbaceous annual plant grown as a crop primarily for its edible seeds; the seeds are rich in protein, dietary fiber, B vitamins, and dietary minerals in amounts greater than in many grains.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e3845",
    "name": "Rice Vinegar",
    "desc": "Rice vinegar is a vinegar made from fermented rice in China, Japan, Korea, and Vietnam.\r\n\r\nChinese rice vinegars are stronger than Japanese ones, and range in colour from clear to various shades of red, brown and black and are therefore known as rice wine vinegar. Chinese and especially Japanese vinegars are less acidic than the distilled Western vinegars which, for that reason, are not appropriate substitutes for rice vinegars. The majority of the Asian rice vinegar types are also more mild and sweet than vinegars typically used in the Western world, with black vinegars as a notable exception. Chinese rice vinegars are made from huangjiu, a type of rice wine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565048/xbiv9u3j17ipxykkmjc9.png"
  },
  {
    "_id": "640c2dd963a319ea671e3861",
    "name": "Almond Extract",
    "desc": "The almond (Prunus dulcis, syn. Prunus amygdalus) is a species of tree native to Mediterranean climate regions of the Middle East, but widely cultivated elsewhere. The almond is also the name of the edible and widely cultivated seed of this tree. Within the genus Prunus, it is classified with the peach in the subgenus Amygdalus, distinguished from the other subgenera by corrugations on the shell (endocarp) surrounding the seed.\r\n\r\nThe fruit of the almond is a drupe, consisting of an outer hull and a hard shell with the seed, which is not a true nut, inside. Shelling almonds refers to removing the shell to reveal the seed. Almonds are sold shelled or unshelled. Blanched almonds are shelled almonds that have been treated with hot water to soften the seedcoat, which is then removed to reveal the white embryo.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565046/xorc6zn6c7rqdqoqho1r.png"
  },
  {
    "_id": "640c2dd963a319ea671e3686",
    "name": "Cashews",
    "desc": "Same as 'Cashew Nuts', a type of nut that is often used in cooking and snacking, with a mild, buttery flavor and a creamy texture when roasted or ground into a paste.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/tosfckzdkpycihjkwarh.png"
  },
  {
    "_id": "640c2dd963a319ea671e3826",
    "name": "Goats Cheese",
    "desc": "A soft, tangy cheese made from the milk of goats, often used in salads, sandwiches, and as a topping for pizzas and pastas",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/j1clflyhdwavkokea2e0.png"
  },
  {
    "_id": "640c2dd963a319ea671e3700",
    "name": "Hotsauce",
    "desc": "Hot sauce is a condiment made from chili peppers, vinegar, and other spices. It is often used to add heat and flavor to dishes like eggs, tacos, and pizza.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/zo7socrg5pxgyn56hat4.png"
  },
  {
    "_id": "640c2dd963a319ea671e3773",
    "name": "Strawberries",
    "desc": "A sweet and juicy fruit that is high in vitamin C and antioxidants. They are commonly eaten fresh or used in desserts like strawberry shortcake, strawberry ice cream, or strawberry jam.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/vxt53h2g72h1glrpvt4p.png"
  },
  {
    "_id": "640c2dd963a319ea671e36e3",
    "name": "Garlic",
    "desc": "A bulbous plant related to onions, chives, and shallots, known for its pungent flavor and aroma. It is used in many cuisines around the world and is a staple ingredient in Mediterranean and Asian cooking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/q4gnbvysfhkjv5husoxx.png"
  },
  {
    "_id": "640c2dd963a319ea671e3709",
    "name": "King Prawns",
    "desc": "A large, meaty type of shrimp that is often used in seafood dishes. King prawns have a sweet, delicate flavor and a firm texture when cooked.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/xylzizogiffli17v5ui6.png"
  },
  {
    "_id": "640c2dd963a319ea671e37ed",
    "name": "Naan Bread",
    "desc": "Naan bread is a type of Indian flatbread that is made from flour, water, and yeast. It is traditionally baked in a tandoor oven and can be served plain or stuffed with a variety of fillings.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564977/ass56bm5uaolyrmojjta.png"
  },
  {
    "_id": "640c2dd963a319ea671e3864",
    "name": "Black Beans",
    "desc": "The black turtle bean is a small, shiny variety of the common bean (Phaseolus vulgaris) especially popular in Latin American cuisine, though it can also be found in the Cajun and Creole cuisines of south Louisiana. Like most common beans, it is native to the Americas, but has been introduced around the world. It is also used in East Indian cooking, Punjabi cuisine, and in Maharashtrian cuisine, it is known as Kala Ghevada. It is used interchangeably with vigna mungo (black gram) in countries such as the United States. The black turtle bean is often simply called the black bean (frijoles negros, zaragoza, judía negra, poroto negro, or caraota o habichuela negra in Spanish; and feijão preto in Portuguese), although this terminology can cause confusion with other black beans.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/wpqmskjne78tkiwqeyqx.png"
  },
  {
    "_id": "640c2dd963a319ea671e3757",
    "name": "Rigatoni",
    "desc": "Short, tube-shaped pasta that is wider than penne and often ridged or lined to hold sauce.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564912/upsq0trxa2w1gulkomqr.png"
  },
  {
    "_id": "640c2dd963a319ea671e37b2",
    "name": "Chicken Stock Cube",
    "desc": "A small cube made from dried and compressed chicken stock, used to add flavor to soups, stews, and sauces. Chicken stock cubes are convenient and easy to use.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/azepaocvibzddyzeerbo.png"
  },
  {
    "_id": "640c2dd963a319ea671e372d",
    "name": "Onion Salt",
    "desc": "A seasoning made from a mixture of dried onion powder and salt.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/iloruzo4rxrpdspmzngf.png"
  },
  {
    "_id": "640c2dd963a319ea671e37c3",
    "name": "Turkey Mince",
    "desc": "Ground meat made from turkey, commonly used as a lower-fat alternative to beef mince in a variety of dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564977/yu5y8h8amweaxk5hau3o.png"
  },
  {
    "_id": "640c2dd963a319ea671e37e8",
    "name": "Tinned Tomatos",
    "desc": "Tinned tomatoes are tomatoes that have been canned or preserved in a liquid. They are commonly used in sauces, soups, stews, and other culinary applications.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/axah8rpn59d6tz6xlkfg.png"
  },
  {
    "_id": "640c2dd963a319ea671e388e",
    "name": "Caraway Seed",
    "desc": "Caraway, also known as meridian fennel and Persian cumin (Carum carvi), is a biennial plant ... For example, it is used in goulash, sauerkraut, and caraway seed cake. The roots may be cooked as a vegetable like parsnips or carrots",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565178/u1iywwjtwz0m2ie9lyrm.png"
  },
  {
    "_id": "640c2dd963a319ea671e3750",
    "name": "Red Pepper Flakes",
    "desc": "Dried and crushed red chili peppers often used as a spice to add heat and flavor to dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564913/odeo8vi7trxnnip3lwfp.png"
  },
  {
    "_id": "640c2dd963a319ea671e382a",
    "name": "Tarragon Leaves",
    "desc": "A popular herb used in French cuisine with a subtle anise flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/tgpsbok0z0lxdfvxyj3c.png"
  },
  {
    "_id": "640c2dd963a319ea671e3677",
    "name": "Brandy",
    "desc": "A type of distilled spirit made from wine or fermented fruit juice, often aged in oak barrels to give it a smooth, mellow flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564673/tzkpo8lz1fciernmp3ar.png"
  },
  {
    "_id": "640c2dd963a319ea671e36ac",
    "name": "Colby Jack Cheese",
    "desc": "A semi-hard cheese made from cow's milk, with a mild flavor and creamy texture. It is a combination of Colby and Monterey Jack cheese.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/eshomi15kqzomtaj4ztq.png"
  },
  {
    "_id": "640c2dd963a319ea671e36d6",
    "name": "Flax Eggs",
    "desc": "A vegan egg substitute made from ground flaxseed and water. Used in baking as a binding agent.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/mdvkfywwhxrhehwwjvjy.png"
  },
  {
    "_id": "640c2dd963a319ea671e37c7",
    "name": "Duck Fat",
    "desc": "Rendered fat from ducks that has a rich, savory flavor and high smoke point, commonly used for cooking and roasting.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564977/eozdgip3x8d4lg40mqq5.png"
  },
  {
    "_id": "640c2dd963a319ea671e36f2",
    "name": "Green Chilli",
    "desc": "A type of chili pepper with a mild to medium heat and a green color commonly used in Mexican and South Asian cuisine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564797/ic8yunbwktxbxif2nq6m.png"
  },
  {
    "_id": "640c2dd963a319ea671e3780",
    "name": "Toor Dal",
    "desc": "Also known as pigeon peas, a type of legume commonly used in Indian and African cuisines, often cooked into stews, soups, and curries.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/qav7myxmmvbtqbcw5zum.png"
  },
  {
    "_id": "640c2dd963a319ea671e37c2",
    "name": "Minced Beef",
    "desc": "Ground beef, commonly used for making burgers, meatballs, and meat sauces.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/fwshtzflq5zka5xxlceb.png"
  },
  {
    "_id": "640c2dd963a319ea671e37d5",
    "name": "Raspberries",
    "desc": "Small, red berries with a sweet-tart flavor and delicate texture, commonly used in desserts like pies, tarts, and cheesecakes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/omoifcbklbgfksi9mpeg.png"
  },
  {
    "_id": "640c2dd963a319ea671e36a5",
    "name": "Cinnamon",
    "desc": "A sweet and aromatic spice commonly used in baking, made from the inner bark of cinnamon trees.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/thuge385voj7aci6cdpw.png"
  },
  {
    "_id": "640c2dd963a319ea671e36d7",
    "name": "Flour",
    "desc": "A fine powder made from grinding grains, nuts, seeds, or roots. Used as a main ingredient in baking, cooking, and thickening sauces and soups.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564797/hwex2zzwxbv7a5gi9iuh.png"
  },
  {
    "_id": "640c2dd963a319ea671e36a4",
    "name": "Cilantro",
    "desc": "Also known as coriander, it is a herb commonly used in Mexican, Indian, and Thai cuisine, with a fresh, citrusy flavor and aroma.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/pilerjag1dqsknusrso9.png"
  },
  {
    "_id": "640c2dd963a319ea671e36f9",
    "name": "Gruyère",
    "desc": "Gruyère is a type of Swiss cheese that is known for its nutty, slightly sweet flavor and smooth, creamy texture. It is often used in cooking and pairs well with foods like potatoes, mushrooms, and bread.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/qwu9b62zrpnfwzqxr7tf.png"
  },
  {
    "_id": "640c2dd963a319ea671e3723",
    "name": "Monterey Jack Cheese",
    "desc": "A semi-hard, American cheese that is mild in flavor and melts easily, making it a popular choice for sandwiches, burgers, and Mexican cuisine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/fbipc3ymifnmatwrrhse.png"
  },
  {
    "_id": "640c2dd963a319ea671e36c6",
    "name": "Egg Plants",
    "desc": "Also known as aubergines, eggplants are a type of vegetable with a deep purple skin and creamy white flesh. They are often used in Mediterranean and Asian cuisine, and can be roasted, grilled, fried, or stewed.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/cpzqqojzqs8txlo0ndrg.png"
  },
  {
    "_id": "640c2dd963a319ea671e36f8",
    "name": "Ground Ginger",
    "desc": "Ground ginger is a spice made from dried ginger root that has been ground into a powder. It is commonly used in baking and Asian cuisine to add a warm, spicy flavor to dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564797/jsdypoxhgifyvvkwosoy.png"
  },
  {
    "_id": "640c2dd963a319ea671e37e2",
    "name": "Gelatine Leafs",
    "desc": "Gelatin leaves are thin, translucent sheets made from gelatin that are used to set liquids in desserts and other culinary applications.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/yxzqvea0jvyyluv4gsls.png"
  },
  {
    "_id": "640c2dd963a319ea671e380a",
    "name": "Redcurrants",
    "desc": "Small, bright red berries with a tart flavor, often used in jams, jellies, and sauces.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/a94lzpkcvzwesgwigb5b.png"
  },
  {
    "_id": "640c2dd963a319ea671e3694",
    "name": "Chicken Breasts",
    "desc": "A cut of chicken meat that comes from the breast of the bird. It is lean and versatile, and can be cooked in a variety of ways, such as grilling, roasting, or pan-frying.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/twwmhdfwwkddutyhjd28.png"
  },
  {
    "_id": "640c2dd963a319ea671e37a7",
    "name": "Monkfish",
    "desc": "A type of fish with a broad, flat head and a long, tapered body, often used in stews or roasted with herbs and vegetables.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564913/etssababa4k1rhv9qdan.png"
  },
  {
    "_id": "640c2dd963a319ea671e3715",
    "name": "Lettuce",
    "desc": "Lettuce is a leafy green vegetable that is commonly used in salads, sandwiches, and as a garnish. There are many different varieties of lettuce, including romaine, iceberg, and butterhead, each with its own unique flavor and texture.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/frmckqhotom6zh2ijl54.png"
  },
  {
    "_id": "640c2dd963a319ea671e3863",
    "name": "Goat Meat",
    "desc": "The domestic goat or simply goat (Capra aegagrus hircus) is a subspecies of C. aegagrus domesticated from the wild goat of Southwest Asia and Eastern Europe. The goat is a member of the animal family Bovidae and the goat—antelope subfamily Caprinae, meaning it is closely related to the sheep. There are over 300 distinct breeds of goat. Goats are one of the oldest domesticated species of animal, and have been used for milk, meat, fur, and skins across much of the world. Milk from goats is often turned into goat cheese.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e3879",
    "name": "Persian Cucumber",
    "desc": "Cucumber (Cucumis sativus) is a widely cultivated plant in the gourd family, Cucurbitaceae. It is a creeping vine that bears cucumiform fruits that are used as vegetables. There are three main varieties of cucumber: slicing, pickling, and seedless. Within these varieties, several cultivars have been created. In North America, the term \"wild cucumber\" refers to plants in the genera Echinocystis and Marah, but these are not closely related. The cucumber is originally from South Asia, but now grows on most continents. Many different types of cucumber are traded on the global market.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e3884",
    "name": "Gherkin Relish",
    "desc": "A relish is a cooked and pickled product made of chopped vegetables, fruits or herbs and is a food item typically used as a condiment to enhance a staple. Examples are chutneys and the North American relish, a pickled cucumber jam eaten with hot dogs or hamburgers.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e3728",
    "name": "Mustard Powder",
    "desc": "A ground spice that is made from mustard seeds, and is often used in cooking and seasoning for its pungent and tangy flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564856/a9hbklnqbcu8okoc9qbv.png"
  },
  {
    "_id": "640c2dd963a319ea671e3797",
    "name": "Wholegrain Bread",
    "desc": "Bread made from flour that contains the whole grain, providing more fiber and nutrients than refined flour bread.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564916/pq9azpjdrgtzem57tgof.png"
  },
  {
    "_id": "640c2dd963a319ea671e384e",
    "name": "Rice wine",
    "desc": "Rice wine is an alcoholic beverage fermented and distilled from rice, traditionally consumed in East Asia, Southeast Asia and South Asia. Rice wine is made from the fermentation of rice starch that has been converted to sugars. Microbes are the source of the enzymes that convert the starches to sugar.[1]\r\n\r\nRice wine typically has an alcohol content of 18–25% ABV. Rice wines are used in Asian gastronomy at formal dinners and banquets and in cooking. They are also used in a religious and ceremonial context.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/ukinm8dyny9kp8lbk28f.png"
  },
  {
    "_id": "640c2dd963a319ea671e366e",
    "name": "Beef Gravy",
    "desc": "Beef is the culinary name for meat from cattle, particularly skeletal muscle. Humans have been eating beef since prehistoric times. Beef is a source of high-quality protein and nutrients.\r\n\r\nMost beef skeletal muscle meat can be used as is by merely cutting into certain parts, such as roasts, short ribs or steak (filet mignon, sirloin steak, rump steak, rib steak, rib eye steak, hanger steak, etc.), while other cuts are processed (corned beef or beef jerky). Trimmings, on the other hand, are usually mixed with meat from older, leaner (therefore tougher) cattle, are ground, minced or used in sausages. The blood is used in some varieties called blood sausage. Other parts that are eaten include other muscles and offal, such as the oxtail, liver, tongue, tripe from the reticulum or rumen, glands (particularly the pancreas and thymus, referred to as sweetbread), the heart, the brain (although forbidden where there is a danger of bovine spongiform encephalopathy, BSE, commonly referred to as mad cow disease), the kidneys, and the tender testicles of the bull (known in the United States as calf fries, prairie oysters, or Rocky Mountain oysters). Some intestines are cooked and eaten as is, but are more often cleaned and used as natural sausage casings. The bones are used for making beef stock.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564217/nkah6uviegei3dcgutce.png"
  },
  {
    "_id": "640c2dd963a319ea671e36fb",
    "name": "Harissa Spice",
    "desc": "Harissa spice is a North African blend of spices that typically includes hot chili peppers, cumin, coriander, garlic, and caraway seeds. It is often used to flavor meat, vegetables, and stews.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/veiw8rgyezdzevtdpujz.png"
  },
  {
    "_id": "640c2dd963a319ea671e3795",
    "name": "Whole Milk",
    "desc": "Milk that has not had its fat content reduced or removed, typically containing around 3.25% fat.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/hhe9evqdxgoecva9nmtc.png"
  },
  {
    "_id": "640c2dd963a319ea671e386d",
    "name": "Mixed Spice",
    "desc": "Mixed spice, also called pudding spice, is a British[1] blend of sweet spices, similar to the pumpkin pie spice used in the United States. Cinnamon is the dominant flavour, with nutmeg and allspice. It is often used in baking, or to complement fruits or other sweet foods.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/umnmh3f81nta8lnynvvf.png"
  },
  {
    "_id": "640c2dd963a319ea671e36a8",
    "name": "Coco Sugar",
    "desc": "A natural sweetener made from the sap of coconut palms, commonly used as a substitute for refined sugar.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/pvr929urpvakkre1ypkq.png"
  },
  {
    "_id": "640c2dd963a319ea671e36f5",
    "name": "Green Salsa",
    "desc": "A salsa made from tomatillos, green chili peppers, onions, and other ingredients resulting in a tangy and slightly spicy flavor commonly used as a dip or condiment.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/n2cdxopqzoeoiko3vsgc.png"
  },
  {
    "_id": "640c2dd963a319ea671e37e1",
    "name": "Peanut Cookies",
    "desc": "Cookies that are made with peanuts or peanut butter. They have a nutty and sweet flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/thnj7z7qffeu0032udll.png"
  },
  {
    "_id": "640c2dd963a319ea671e3699",
    "name": "Chili Powder",
    "desc": "A blend of ground chili peppers, cumin, garlic powder, and other spices. It is often used to add heat and flavor to dishes such as chili, stews, and marinades.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/jdtmiv6lu04sc9hfoq8i.png"
  },
  {
    "_id": "640c2dd963a319ea671e3821",
    "name": "Beef Shin",
    "desc": "A cut of beef from the lower leg, often used in slow-cooked dishes for its rich flavor and collagen content",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/pdbbfcq3ozpye1wb1sge.png"
  },
  {
    "_id": "640c2dd963a319ea671e3898",
    "name": "Buckwheat",
    "desc": "Buckwheat (Fagopyrum esculentum), or common buckwheat, is a plant cultivated for its grain-like seeds and as a cover crop. The name \"buckwheat\" is used for several other species, such as Fagopyrum tataricum, a domesticated food plant raised in Asia. Despite the name, buckwheat is not closely related to wheat, as it is not a grass. Instead, buckwheat is related to sorrel, knotweed, and rhubarb. Buckwheat is referred to as a pseudocereal because its seeds' culinary use is the same as cereals', owing to their composition of complex carbohydrates.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565178/czpazeqltbxygmai5ial.png"
  },
  {
    "_id": "640c2dd963a319ea671e36d3",
    "name": "Feta",
    "desc": "A salty, crumbly cheese typically made from sheep's milk or a blend of sheep's and goat's milk. Often used in Mediterranean cuisine in salads, pastries, and as a topping for grilled meats.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/qofnrlqts79rhj3lcool.png"
  },
  {
    "_id": "640c2dd963a319ea671e3816",
    "name": "Baked Beans",
    "desc": "Haricot beans cooked in a tomato sauce, often served as a side dish or as part of a full English breakfast.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/n5nrjvzawzzgwbnwymtw.png"
  },
  {
    "_id": "640c2dd963a319ea671e3868",
    "name": "Orange Blossom Water",
    "desc": "Orange flower water, or orange blossom water, is the clear, perfumed by-product of the distillation of fresh bitter-orange blossoms for their essential oil.\r\n\r\nUses\r\nMediterranean Relief.jpg\r\nThis essential water has traditionally been used as an aromatizer in many Mediterranean traditional dessert dishes, such as in France for the gibassier and pompe à l'huile or in Spain for the Roscón de Reyes (King cake), or the Samsa in Tunisia or in Moroccan coffee, but has more recently found its way into other cuisines. For example, orange flower water is used in Europe to flavor madeleines, in Mexico to flavor little wedding cakes and Pan de muerto, and in the United States to make orange blossom scones and marshmallows. Orange flower water is also used as an ingredient in some cocktails, such as the Ramos Gin Fizz. In Malta and many North African as well as Middle Eastern countries, orange blossom water is widely used as medicine for stomach ache and given to small children as well as adults.\r\n\r\nOrange flower water has been a traditional ingredient used often in North African as well as in Middle Eastern cooking. In Arab variants of baklava, orange blossom water is often mixed with the sweet syrup for flavor. Orange blossoms are believed to be used in this manner because they are seen as the traditional bridal flower and, therefore, symbolize purity (white, small and delicate). It is also added to plain water in the Middle East to mask high mineral content and other unpleasant flavors (e.g. those arising from storage in a qulla, a type of clay jug that keeps water cool in a manner similar to the zeer); some add the fragrance irrespective of the taste of the plain water.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/f3wecnihn9tjxb7vcrsq.png"
  },
  {
    "_id": "640c2dd963a319ea671e3875",
    "name": "Yukon Gold Potatoes",
    "desc": "Yukon Gold is a large cultivar of potato most distinctly characterized by its thin, smooth, eye-free skin and yellow-tinged flesh. This potato was developed in the 1960s by Garnet Johnston in Guelph, Ontario, Canada, with the help of Geoff Rowberry at the University of Guelph. The official cross was made in 1966 and Yukon Gold was finally released into the market in 1980.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e37f6",
    "name": "Shiitake Mushrooms",
    "desc": "A type of edible mushroom that is commonly used in East Asian cuisine for its savory, meaty flavor, and is often dried and rehydrated before use.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/ithxhqjuklydl9djt0yx.png"
  },
  {
    "_id": "640c2dd963a319ea671e3871",
    "name": "Bun",
    "desc": "A bun is a small, sometimes sweet, bread-based item[1] or roll. Though they come in many shapes and sizes, they are most commonly hand-sized or smaller, with a round top and flat bottom.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e388a",
    "name": "Powdered Sugar",
    "desc": "Powdered sugar, also called confectioners' sugar or icing sugar, is a finely ground sugar produced by milling granulated sugar into a powdered state. It usually contains a small amount of anti-caking agent to prevent clumping and improve flow",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565063/zlxddlpvqs2cu3ium5qm.png"
  },
  {
    "_id": "640c2dd963a319ea671e367e",
    "name": "Butter",
    "desc": "A dairy product made from churning cream or milk, with a high fat content and a creamy, rich flavor that is often used in cooking and baking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/ovea5weymaecrnbwxuq9.png"
  },
  {
    "_id": "640c2dd963a319ea671e366f",
    "name": "Beef Stock",
    "desc": "Beef is the culinary name for meat from cattle, particularly skeletal muscle. Humans have been eating beef since prehistoric times. Beef is a source of high-quality protein and nutrients.\r\n\r\nMost beef skeletal muscle meat can be used as is by merely cutting into certain parts, such as roasts, short ribs or steak (filet mignon, sirloin steak, rump steak, rib steak, rib eye steak, hanger steak, etc.), while other cuts are processed (corned beef or beef jerky). Trimmings, on the other hand, are usually mixed with meat from older, leaner (therefore tougher) cattle, are ground, minced or used in sausages. The blood is used in some varieties called blood sausage. Other parts that are eaten include other muscles and offal, such as the oxtail, liver, tongue, tripe from the reticulum or rumen, glands (particularly the pancreas and thymus, referred to as sweetbread), the heart, the brain (although forbidden where there is a danger of bovine spongiform encephalopathy, BSE, commonly referred to as mad cow disease), the kidneys, and the tender testicles of the bull (known in the United States as calf fries, prairie oysters, or Rocky Mountain oysters). Some intestines are cooked and eaten as is, but are more often cleaned and used as natural sausage casings. The bones are used for making beef stock.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564215/joertssoziny4fr0hx6f.png"
  },
  {
    "_id": "640c2dd963a319ea671e37bc",
    "name": "Stilton Cheese",
    "desc": "Blue cheese made from cow's milk, characterized by its strong flavor and creamy texture.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/ptfp6jc9j4ubvdpmyzhh.png"
  },
  {
    "_id": "640c2dd963a319ea671e37d0",
    "name": "Mozzarella",
    "desc": "A semi-soft, mild cheese with a smooth, creamy texture and mild, slightly tangy flavor, commonly used on pizzas and in Italian dishes like lasagna and caprese salad.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/jtxeh62ronhbrteyrujl.png"
  },
  {
    "_id": "640c2dd963a319ea671e37fd",
    "name": "Ham",
    "desc": "A cut of meat from the hind leg of a pig that is typically cured or smoked, and is commonly used in sandwiches, salads, and as a flavoring for soups and stews.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/hbntweybw6wvy0wzeg14.png"
  },
  {
    "_id": "640c2dd963a319ea671e3849",
    "name": "Fermented Black Beans",
    "desc": "Douchi (Chinese: 豆豉; pinyin: dòuchǐ), or tochi is a type of fermented and salted black soybean. In English, it is known as fermented black soybeans, Chinese fermented black beans (Chinese: 黑豆豆豉; pinyin: hēidòu dòuchǐ), salted black beans, salty black beans, or just black beans. They are a flavoring most popular in the cuisine of China, where they are most widely used for making black bean sauce dishes.[1][page needed]\r\n\r\nDouchi is made by fermenting and salting black soybeans. The black type soybean is most commonly used and the process turns the beans soft, and mostly semi-dry (if the beans are allowed to dry). Regular soybeans (white soybeans) are also used, but this does not produce \"salted black beans\"; instead, these beans become brown. The smell is sharp, pungent, and spicy; the taste is salty, somewhat bitter and sweet.[citation needed] The product made with white soybeans is called mianchi.\r\n\r\nThe process and product are similar to ogiri and iru, both being African fermented bean products[citation needed].\r\n\r\nDouchi, \"Chinese salted black beans\", and \"black soybeans\" should not be confused with the black turtle bean, a variety of common bean that is commonly used in the cuisines of Central America, South America, and the Caribbean.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e3874",
    "name": "Pork Chops",
    "desc": "A pork chop, like other meat chops, is a loin cut taken perpendicular to the spine of the pig and usually containing a rib or part of a vertebra. Pork chops are not processed and are leaner than other cuts of pork. Chops are commonly served as an individual portion.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/nldzjekanwzrryia9v0s.png"
  },
  {
    "_id": "640c2dd963a319ea671e3785",
    "name": "Vanilla",
    "desc": "A flavor derived from the seed pods of the vanilla orchid, commonly used as a sweetener and flavoring agent in baked goods, ice cream, and other desserts.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564909/fxkymyj1fhw2hry2itv1.png"
  },
  {
    "_id": "640c2dd963a319ea671e3869",
    "name": "Candied Peel",
    "desc": "Candied fruit, also known as crystallized fruit or glacé fruit, has existed since the 14th century. Whole fruit, smaller pieces of fruit, or pieces of peel, are placed in heated sugar syrup, which absorbs the moisture from within the fruit and eventually preserves it.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e3660",
    "name": "Apple Cider Vinegar",
    "desc": "Apple cider vinegar, or cider vinegar, is a vinegar made from fermented apple juice, and used in salad dressings, marinades, vinaigrettes, food preservatives, and chutneys. It is made by crushing apples, then squeezing out the juice. Bacteria and yeast are added to the liquid to start the alcoholic fermentation process, which converts the sugars to alcohol. In a second fermentation step, the alcohol is converted into vinegar by acetic acid-forming bacteria (Acetobacter species). Acetic acid and malic acid combine to give vinegar its sour taste. Apple cider vinegar has no medicinal or nutritional value. There is no high-quality clinical evidence that regular consumption of apple cider vinegar helps to maintain or lose body weight, or is effective to manage blood glucose and lipid levels.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564216/buzhzk4ocvtrmqflfvr7.png"
  },
  {
    "_id": "640c2dd963a319ea671e365e",
    "name": "Pork",
    "desc": "Pork is the culinary name for the flesh of a domestic pig (Sus scrofa domesticus). It is the most commonly consumed meat worldwide,[1] with evidence of pig husbandry dating back to 5000 BC.\r\n\r\nPork is eaten both freshly cooked and preserved. Curing extends the shelf life of the pork products. Ham, smoked pork, gammon, bacon and sausage are examples of preserved pork. Charcuterie is the branch of cooking devoted to prepared meat products, many from pork.\r\n\r\nPig is the most popular meat in the Eastern and non-Muslim parts of Southeastern Asia (Indochina, Philippines, Singapore, East Timor) and is also very common in the Western world, especially in Central Europe. It is highly prized in Asian cuisines for its fat content and pleasant texture. Consumption of pork is forbidden by Jewish, Muslim and Rastafarian dietary law, for religious reasons, with several suggested possible causes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564123/lxxzs0c6xjnnwgznkilw.png"
  },
  {
    "_id": "640c2dd963a319ea671e36d5",
    "name": "Flaked Almonds",
    "desc": "Sliced or chopped almonds commonly used in baking and as a topping for salads and desserts.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/ioewvib3w3mmdbbhp8ia.png"
  },
  {
    "_id": "640c2dd963a319ea671e375c",
    "name": "Sake",
    "desc": "Japanese alcoholic beverage made from fermented rice and water, with a mild flavor and a relatively low alcohol content.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564911/z4bwqrzkityogfalbyjd.png"
  },
  {
    "_id": "640c2dd963a319ea671e37e0",
    "name": "Shortcrust Pastry",
    "desc": "A type of pastry that is made with flour, butter, and water. It is often used as a base for pies and tarts.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/ey8aa8zh8xjelkrprt1l.png"
  },
  {
    "_id": "640c2dd963a319ea671e370c",
    "name": "Lamb Loin Chops",
    "desc": "A type of lamb chop that comes from the loin area of the animal. Lamb loin chops are tender and flavorful and can be cooked quickly over high heat.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/sjnil4k7dorcn4m4pbqd.png"
  },
  {
    "_id": "640c2dd963a319ea671e3872",
    "name": "Potatoe Buns",
    "desc": "Potato bread is a form of bread in which potato flour or potato replaces a portion of the regular wheat flour. It is cooked in a variety of ways, including baking it on a hot griddle or pan, or in an oven. It may be leavened or unleavened, and may have a variety of other ingredients baked into it. The ratio of potato to wheat flour varies significantly from recipe to recipe, with some recipes having a majority of potato, and others having a majority of wheat flour. Some recipes call for mashed potatoes, with others calling for dehydrated potato flakes. It is available as a commercial product in many countries, with similar variations in ingredients, cooking method, and other variables.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e3734",
    "name": "Parma Ham",
    "desc": "A type of dry-cured ham that is typically sliced thinly and served uncooked, originating from the Parma region of Italy.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/ah7qryynnm3vkenmrffm.png"
  },
  {
    "_id": "640c2dd963a319ea671e37d4",
    "name": "Banana",
    "desc": "A fruit with a soft, sweet flesh and yellow or green skin that is rich in potassium and often used in baked goods, smoothies, and as a snack.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564977/sm3ri1rgf2xicaleqpha.png"
  },
  {
    "_id": "640c2dd963a319ea671e382b",
    "name": "Chives",
    "desc": "A herb with long, thin green leaves used to add a mild onion-like flavor to dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/zudu79k1kvgojhmmhqqc.png"
  },
  {
    "_id": "640c2dd963a319ea671e387e",
    "name": "Bulgur Wheat",
    "desc": "Bulgur is a cereal food made from the cracked parboiled groats of several different wheat species, most often from durum wheat. It originates in Middle Eastern cuisine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565063/oznfhzladnzn80qmegcn.png"
  },
  {
    "_id": "640c2dd963a319ea671e3689",
    "name": "Celeriac",
    "desc": "A root vegetable that is related to celery, with a knobby, rough exterior and a creamy-white interior that is often used in soups, stews, and purees, with a mild and slightly sweet flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564675/gyg2e9hejbelso9qnx2j.png"
  },
  {
    "_id": "640c2dd963a319ea671e3742",
    "name": "Plain Chocolate",
    "desc": "Plain chocolate, also known as dark chocolate, is made from cocoa solids, sugar, and cocoa butter. It has a higher percentage of cocoa solids than milk chocolate, and has a bittersweet taste. It is often used in baking, or enjoyed on its own as a treat.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/qmuma4viupigb574izg6.png"
  },
  {
    "_id": "640c2dd963a319ea671e3704",
    "name": "Jalapeno",
    "desc": "A type of chili pepper, typically green when unripe, that is commonly used in Mexican and Tex-Mex cuisine. It is moderately spicy and often used in salsas, sauces, and as a topping for nachos.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/ubjejoadhgsun2uemt9t.png"
  },
  {
    "_id": "640c2dd963a319ea671e376f",
    "name": "Spinach",
    "desc": "A leafy green vegetable that is rich in vitamins, minerals, and antioxidants. It is commonly used in salads, sandwiches, and cooked dishes like spinach lasagna or sautéed spinach with garlic.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564913/otjxvzcvuk0j8jnl3saz.png"
  },
  {
    "_id": "640c2dd963a319ea671e3798",
    "name": "Worcestershire Sauce",
    "desc": "A fermented liquid condiment made from a blend of spices, vinegar, and anchovies, commonly used as a seasoning for meats, vegetables, and soups.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/tg9ml6cwphdrlhkz9u7o.png"
  },
  {
    "_id": "640c2dd963a319ea671e37c4",
    "name": "Barbeque Sauce",
    "desc": "A sweet and tangy sauce typically used for grilling or marinating meats, made with ingredients like tomato, vinegar, and spices.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564975/o5vbyjovyqawehzcdlxk.png"
  },
  {
    "_id": "640c2dd963a319ea671e366d",
    "name": "Beef Fillet",
    "desc": "Beef is the culinary name for meat from cattle, particularly skeletal muscle. Humans have been eating beef since prehistoric times. Beef is a source of high-quality protein and nutrients.\r\n\r\nMost beef skeletal muscle meat can be used as is by merely cutting into certain parts, such as roasts, short ribs or steak (filet mignon, sirloin steak, rump steak, rib steak, rib eye steak, hanger steak, etc.), while other cuts are processed (corned beef or beef jerky). Trimmings, on the other hand, are usually mixed with meat from older, leaner (therefore tougher) cattle, are ground, minced or used in sausages. The blood is used in some varieties called blood sausage. Other parts that are eaten include other muscles and offal, such as the oxtail, liver, tongue, tripe from the reticulum or rumen, glands (particularly the pancreas and thymus, referred to as sweetbread), the heart, the brain (although forbidden where there is a danger of bovine spongiform encephalopathy, BSE, commonly referred to as mad cow disease), the kidneys, and the tender testicles of the bull (known in the United States as calf fries, prairie oysters, or Rocky Mountain oysters). Some intestines are cooked and eaten as is, but are more often cleaned and used as natural sausage casings. The bones are used for making beef stock.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564216/zuhii6vl0wgaybsgjexk.png"
  },
  {
    "_id": "640c2dd963a319ea671e3661",
    "name": "Asparagus",
    "desc": "Asparagus, or garden asparagus, folk name sparrow grass, scientific name Asparagus officinalis, is a perennial flowering plant species in the genus Asparagus. Its young shoots are used as a spring vegetable.\r\n\r\nIt was once classified in the lily family, like the related Allium species, onions and garlic. However, genetic research places lilies, Allium, and asparagus in three separate families—the Liliaceae, Amaryllidaceae, and Asparagaceae, respectively—with the Amaryllidaceae and Asparagaceae being grouped together in the order Asparagales. Sources differ as to the native range of Asparagus officinalis, but generally include most of Europe and western temperate Asia. It is widely cultivated as a vegetable crop.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564215/qbfhenmhqflicidxyk1s.png"
  },
  {
    "_id": "640c2dd963a319ea671e36b9",
    "name": "Cumin Seeds",
    "desc": "The dried seeds of the cumin plant, commonly used as a spice in cooking. They have a warm, earthy flavor and are often used in Indian, Middle Eastern, and Mexican cuisine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/rckn4y0eiqreqmzdqkx7.png"
  },
  {
    "_id": "640c2dd963a319ea671e37ec",
    "name": "Paneer",
    "desc": "Paneer is a type of fresh cheese that is popular in Indian cuisine. It is made by curdling milk with lemon juice or vinegar and then draining the whey. Paneer has a mild, creamy flavor and a crumbly texture.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564980/ws8jysxpb2qts0dsymql.png"
  },
  {
    "_id": "640c2dd963a319ea671e368a",
    "name": "Celery",
    "desc": "A long, crunchy stalk vegetable with a green color and a strong, distinct flavor, often used in soups, stews, salads, and as a snack with dips or spreads.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/hxotah2bhhhmxmj9znvu.png"
  },
  {
    "_id": "640c2dd963a319ea671e384c",
    "name": "Wonton Skin",
    "desc": "Won ton skin. Paper-thin squares of dough made from flour, water, eggs and salt used to make won tons, egg rolls and gyoza.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e3667",
    "name": "Basil",
    "desc": "Basil, also called great basil, is a culinary herb of the family Lamiaceae (mints).\r\n\r\nBasil is native to tropical regions from central Africa to Southeast Asia. It is a tender plant, and is used in cuisines worldwide. Depending on the species and cultivar, the leaves may taste somewhat like anise, with a strong, pungent, often sweet smell.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564215/jpmvh7yslyxzie8gihi1.png"
  },
  {
    "_id": "640c2dd963a319ea671e3679",
    "name": "Breadcrumbs",
    "desc": "Small pieces of bread that have been dried and ground into a coarse powder, often used as a coating or filler in recipes such as meatballs, stuffing, and casseroles.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564673/z8wxajen11evzfkuqem2.png"
  },
  {
    "_id": "640c2dd963a319ea671e3739",
    "name": "Peanut Butter",
    "desc": "A spread made from ground peanuts, commonly used as a sandwich filling and in baking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/oix6a15rklttlavs8kzr.png"
  },
  {
    "_id": "640c2dd963a319ea671e36f1",
    "name": "Green Beans",
    "desc": "A long and slender vegetable with a mild, slightly sweet flavor commonly used in salads, stir-fries, and as a side dish.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564797/as01iysymalhylfv0csq.png"
  },
  {
    "_id": "640c2dd963a319ea671e3727",
    "name": "Mustard",
    "desc": "A condiment that is made from ground mustard seeds, vinegar, and other seasonings, and is often used as a spread, sauce, or flavoring in cooking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/ygm0tq8jsbpqsi5ajr0h.png"
  },
  {
    "_id": "640c2dd963a319ea671e3768",
    "name": "Small Potatoes",
    "desc": "Small potatoes are a variety of potatoes that are small in size, typically less than two inches in diameter. They can be used in a variety of dishes and are often roasted, boiled, or mashed.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/n3yzovffnc3lvdirnkbj.png"
  },
  {
    "_id": "640c2dd963a319ea671e373a",
    "name": "Peanut Oil",
    "desc": "An oil made from pressing peanuts, commonly used in Asian and African cooking for its high smoke point and mild flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/bv4liuzqai6vzvzm9j3l.png"
  },
  {
    "_id": "640c2dd963a319ea671e3741",
    "name": "Pitted Black Olives",
    "desc": "Pitted black olives are ripe olives that have had their pits removed. They are a popular ingredient in Mediterranean and Italian cuisine, and are often used as a topping for pizza, in salads, or as a flavoring in dips and spreads.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/hbg0sewqdjkmk1on6skh.png"
  },
  {
    "_id": "640c2dd963a319ea671e3779",
    "name": "Thai Fish Sauce",
    "desc": "A salty, pungent sauce made from fermented fish, used as a seasoning in many Southeast Asian dishes, particularly in Thai cuisine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564910/ymdhu0shjhozx5lrffo0.png"
  },
  {
    "_id": "640c2dd963a319ea671e37b1",
    "name": "Duck Legs",
    "desc": "The legs of a duck, which are prized for their flavorful and tender meat. Duck legs are often slow-cooked or confit, which involves cooking them in their own fat.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564916/pzuw9mz9yiooepubkh4f.png"
  },
  {
    "_id": "640c2dd963a319ea671e3803",
    "name": "Haddock",
    "desc": "A saltwater fish that is commonly found in the North Atlantic and is often used in cooking due to its mild, slightly sweet flavor and firm texture.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564976/ejn06v8h6x6duxnqttsk.png"
  },
  {
    "_id": "640c2dd963a319ea671e36f0",
    "name": "Greek Yogurt",
    "desc": "A thick and creamy yogurt that has been strained to remove excess whey, resulting in a tangy and slightly tart flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/gsylxkyqnzucbsq7jwag.png"
  },
  {
    "_id": "640c2dd963a319ea671e370e",
    "name": "Lasagne Sheets",
    "desc": "Flat, rectangular pieces of pasta that are used to make lasagne, a popular Italian dish that typically consists of layers of pasta, meat, sauce, and cheese.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564853/jmq8r4hem2egq1xy8ma7.png"
  },
  {
    "_id": "640c2dd963a319ea671e3790",
    "name": "White Chocolate Chips",
    "desc": "Small pieces of sweetened, cocoa butter-based chocolate without the addition of cocoa solids, often used in baking and confectionery.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/ez1emrrcc7e7vc9zbfkw.png"
  },
  {
    "_id": "640c2dd963a319ea671e385d",
    "name": "Rice Krispies",
    "desc": "Rice Krispies (also known as Rice Bubbles in Australia and New Zealand) is a breakfast cereal marketed by Kellogg's in 1927 and released to the public in 1928. Rice Krispies are made of crisped rice (rice and sugar paste that is formed into rice shapes or \"berries\", cooked, dried and toasted), and expand forming very thin and hollowed out walls that are crunchy and crisp. When milk is added to the cereal the walls tend to collapse, creating the \"Snap, crackle and pop\" sounds.\r\n\r\nRice Krispies cereal has a long advertising history, with the elf cartoon characters Snap, Crackle and Pop touting the brand. In 1963, The Rolling Stones recorded a short song for a Rice Krispies television advertisement.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/txb0udyee1einsi78qct.png"
  },
  {
    "_id": "640c2dd963a319ea671e37cf",
    "name": "Mascarpone",
    "desc": "A creamy, mild Italian cheese that is similar in texture to cream cheese but with a sweeter, more delicate flavor, often used in desserts like tiramisu and cheesecake.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/wujgccjbpmusr6jerzfd.png"
  },
  {
    "_id": "640c2dd963a319ea671e36de",
    "name": "Fresh Thyme",
    "desc": "An herb with small, fragrant leaves that are used in cooking to add flavor to meats, soups, and stews. It has a slightly minty, lemony flavor and pairs well with other herbs like rosemary and sage.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/em3dosxmpbsrulc59gw3.png"
  },
  {
    "_id": "640c2dd963a319ea671e380c",
    "name": "Hazlenuts",
    "desc": "",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/ar1orskmmok6gvn8nxoy.png"
  },
  {
    "_id": "640c2dd963a319ea671e3854",
    "name": "Wood Ear Mushrooms",
    "desc": "Auricularia auricula-judae, known as the Jew's ear, wood ear, jelly ear or by a number of other common names, is a species of edible Auriculariales fungus found worldwide. The fruiting body is distinguished by its noticeably ear-like shape and brown colouration; it grows upon wood, especially elder. Its specific epithet is derived from the belief that Judas Iscariot hanged himself from an elder tree; the common name \"Judas's ear\" was largely eclipsed by the corruption \"Jew's ear\", while today \"jelly ear\" and other names are sometimes used. The fungus can be found throughout the year in temperate regions worldwide, where it grows upon both dead and living wood.\r\n\r\nIn the West, A. auricula-judae was used in folk medicine as recently as the 19th century for complaints including sore throats, sore eyes and jaundice, and as an astringent. Although it is not widely consumed in the West, it has long been popular in China, to the extent that Australia exported large volumes to China in the early twentieth century. Today, the fungus is a popular ingredient in many Chinese dishes, such as hot and sour soup, and also used in Chinese medicine. It is also used in Ghana, as a blood tonic. Modern research into possible medical applications has variously concluded that A. auricula-judae has antitumour, hypoglycemic, anticoagulant and cholesterol-lowering properties.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e3693",
    "name": "Chicken Breast",
    "desc": "A cut of chicken meat that comes from the breast of the bird. It is lean and versatile, and can be cooked in a variety of ways, such as grilling, roasting, or pan-frying.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/uj8jffcs4p6qn4vazade.png"
  },
  {
    "_id": "640c2dd963a319ea671e36ec",
    "name": "Golden Syrup",
    "desc": "A thick, amber-colored syrup made from sugar commonly used as a sweetener in baking and desserts.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564799/lp3nssdssjvutauwhgaf.png"
  },
  {
    "_id": "640c2dd963a319ea671e371a",
    "name": "Madras Paste",
    "desc": "Madras paste is a blend of spices commonly used in Indian cuisine, particularly in dishes from the Madras region. It typically includes ingredients such as coriander, cumin, turmeric, and chili peppers, and is often used as a marinade or seasoning for meat, fish, or vegetables.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/mons1nqseyituht1zeer.png"
  },
  {
    "_id": "640c2dd963a319ea671e36e0",
    "name": "Fries",
    "desc": "Thin slices of potatoes that are deep-fried until crispy and golden brown. They are often served as a side dish with burgers, sandwiches, or other entrees.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564797/iehriouy0vhl8uoljm24.png"
  },
  {
    "_id": "640c2dd963a319ea671e375b",
    "name": "Sage",
    "desc": "Herb with a pungent, earthy flavor and aroma, commonly used to flavor meats, stuffing, and sauces.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/jhyifutf3fmrvu7wp8b5.png"
  },
  {
    "_id": "640c2dd963a319ea671e37a6",
    "name": "Fideo",
    "desc": "A type of thin, spaghetti-like pasta commonly used in Mexican cuisine, often toasted before being added to soups or stews.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/jieg2o0azouevvlrnzrg.png"
  },
  {
    "_id": "640c2dd963a319ea671e369e",
    "name": "Chocolate Chips",
    "desc": "Small, sweetened chocolate pieces that are commonly used in baking to add texture and flavor to desserts like cookies and cakes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564742/kn4oypekj5p9ktrz0jx1.png"
  },
  {
    "_id": "640c2dd963a319ea671e3711",
    "name": "Lemon",
    "desc": "A citrus fruit that has a sour, acidic flavor and is often used in cooking and baking to add tartness and brightness to dishes. Lemon juice and zest are commonly used in marinades, dressings, and desserts.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/ytqywdf4mz40xhwmbymc.png"
  },
  {
    "_id": "640c2dd963a319ea671e3883",
    "name": "Iceberg Lettuce",
    "desc": "Iceberg is a variety of lettuce with crisp leaves that grow in a spherical head resembling cabbage. It is considered one of the sweeter lettuce varieties like romaine and butterhead. Mature iceberg lettuce grows to about one foot in diameter.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565055/ytj7cd7pmffrxkdikjm3.png"
  },
  {
    "_id": "640c2dd963a319ea671e3724",
    "name": "Mozzarella Balls",
    "desc": "Small, round balls of mozzarella cheese that are soft, smooth, and milky in flavor, and are often used as a topping for pizzas, salads, and pasta dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564856/zbhre2hgosydezexwhky.png"
  },
  {
    "_id": "640c2dd963a319ea671e36d9",
    "name": "Floury Potatoes",
    "desc": "A type of potato with a high starch content and dry, fluffy texture when cooked. Often used for making mashed potatoes, fries, and potato pancakes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564797/zs8n71dpakckkhsw7dnc.png"
  },
  {
    "_id": "640c2dd963a319ea671e3791",
    "name": "White Fish",
    "desc": "Any fish with white flesh, such as cod, haddock, or tilapia, often used in cooking for its mild flavor and versatility.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564912/fo4xfizrjwbyvjexet2m.png"
  },
  {
    "_id": "640c2dd963a319ea671e37cd",
    "name": "Pinto Beans",
    "desc": "Medium-sized beans with a speckled, reddish-brown color and mild, earthy flavor, commonly used in Mexican and Southwestern cuisine in dishes like chili and refried beans.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/dmu69ozbf3j4urq8qwqn.png"
  },
  {
    "_id": "640c2dd963a319ea671e3662",
    "name": "Aubergine",
    "desc": "Eggplant (US, Australia), aubergine (UK), or brinjal (South Asia and South Africa) is a plant species in the nightshade family Solanaceae. Solanum melongena is grown worldwide for its edible fruit.\r\n\r\nMost commonly purple, the spongy, absorbent fruit is used in various cuisines. Although often considered a vegetable, it is a berry by botanical definition. As a member of the genus Solanum, it is related to tomato and potato. Like the tomato, its skin and seeds can be eaten, but, like the potato, it is usually eaten cooked. Eggplant is nutritionally low in macronutrient and micronutrient content, but the capability of the fruit to absorb oils and flavors into its flesh through cooking expands its use in the culinary arts.\r\n\r\nIt was originally domesticated from the wild nightshade species thorn or bitter apple, S. incanum, probably with two independent domestications: one in South Asia, and one in East Asia.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564217/i3xglxi9jl0iynjjjmko.png"
  },
  {
    "_id": "640c2dd963a319ea671e3663",
    "name": "Baby Plum Tomatoes",
    "desc": "The tomato is the edible, often red, berry of the plant Solanum lycopersicum, commonly known as a tomato plant. The species originated in western South America and Central America. The Nahuatl (Aztec language) word tomatl gave rise to the Spanish word tomate, from which the English word tomato derived.[3][4] Its domestication and use as a cultivated food may have originated with the indigenous peoples of Mexico. The Aztecs used tomatoes in their cooking at the time of the Spanish conquest of the Aztec Empire, and after the Spanish encountered the tomato for the first time after their contact with the Aztecs, they brought the plant to Europe. From there, the tomato was introduced to other parts of the European-colonized world during the 16th century.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564221/hh3a8lt3xeopaaumybd0.png"
  },
  {
    "_id": "640c2dd963a319ea671e36d0",
    "name": "Fennel Bulb",
    "desc": "A bulbous vegetable with a licorice-like flavor commonly used in Mediterranean cuisine. The bulb, stems, and fronds can all be eaten raw or cooked.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/wm3ucgjiqmmn4wc7vsyo.png"
  },
  {
    "_id": "640c2dd963a319ea671e377a",
    "name": "Thai Green Curry Paste",
    "desc": "A spicy blend of herbs and spices, including green chilies, lemongrass, and galangal, used as a base for Thai green curry.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/b5vbzmzctrfwf9ms3mch.png"
  },
  {
    "_id": "640c2dd963a319ea671e3855",
    "name": "Dark Rum",
    "desc": "Rum is a distilled alcoholic drink made from sugarcane byproducts, such as molasses, or directly from sugarcane juice, by a process of fermentation and distillation. The distillate, a clear liquid, is then usually aged in oak barrels.\r\n\r\nThe majority of the world's rum production occurs in the Caribbean and Latin America. Rum is also produced in Australia, Portugal, Austria, Canada, Fiji, India, Japan, Mauritius, Nepal, New Zealand, the Philippines, Reunion Island, South Africa, Spain, Sweden, Taiwan, Thailand, the United Kingdom and the United States.\r\n\r\nRums are produced in various grades. Light rums are commonly used in cocktails, whereas \"golden\" and \"dark\" rums were typically consumed straight or neat, on the rocks, or used for cooking, but are now commonly consumed with mixers. Premium rums are also available, made to be consumed either straight or iced.\r\n\r\nRum plays a part in the culture of most islands of the West Indies as well as in The Maritimes and Newfoundland. This drink has famous associations with the Royal Navy (where it was mixed with water or beer to make grog) and piracy (where it was consumed as bumbo). Rum has also served as a popular medium of economic exchange, used to help fund enterprises such as slavery (see Triangular trade), organized crime, and military insurgencies (e.g., the American Revolution and Australia's Rum Rebellion).",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565033/wnvqsf7uc1teuzcldcko.png"
  },
  {
    "_id": "640c2dd963a319ea671e3820",
    "name": "Egg",
    "desc": "A reproductive cell laid by female animals, often used in baking and cooking as a binding agent or to add texture and flavor",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564976/d5mnfktueqb7fo7mvhee.png"
  },
  {
    "_id": "640c2dd963a319ea671e37ba",
    "name": "Passata",
    "desc": "Tomato puree made from strained and cooked tomatoes, commonly used as a base for pasta sauces.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/auyjzjg2lww1sttrfxb5.png"
  },
  {
    "_id": "640c2dd963a319ea671e36e4",
    "name": "Garlic Clove",
    "desc": "A small, bulbous vegetable consisting of several smaller cloves with a pungent flavor commonly used in cooking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/q7joqmqmoxxnnalupvmq.png"
  },
  {
    "_id": "640c2dd963a319ea671e36fa",
    "name": "Hard Taco Shells",
    "desc": "Hard taco shells are a type of crispy corn tortilla that is shaped like a taco shell. They are often filled with meat, cheese, lettuce, and other toppings to create a classic Mexican-style taco.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564799/j965uob0pkgid3qzkxy5.png"
  },
  {
    "_id": "640c2dd963a319ea671e37db",
    "name": "Dark Brown Soft Sugar",
    "desc": "Similar to light brown sugar, but with a stronger molasses flavor and darker color, often used in recipes for gingerbread, baked beans, and barbecue sauce.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/v6ttc43kj2gwhsmrhnfe.png"
  },
  {
    "_id": "640c2dd963a319ea671e36b0",
    "name": "Coriander Leaves",
    "desc": "Also known as cilantro, these are the leaves of the coriander plant. They are commonly used as a garnish or ingredient in many cuisines.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/jl8y8xyifg7jycwdojcg.png"
  },
  {
    "_id": "640c2dd963a319ea671e3732",
    "name": "Oyster Sauce",
    "desc": "A thick, brown sauce made from oysters, soy sauce, sugar, and spices, commonly used in Chinese and Southeast Asian cooking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/uea18igsegidzur21hvo.png"
  },
  {
    "_id": "640c2dd963a319ea671e379d",
    "name": "Icing Sugar",
    "desc": "A finely ground sugar that is used to make frosting or icing for cakes, cookies, and other baked goods. Often mixed with butter or cream cheese to create a smooth, creamy consistency.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/xpw7165bai8ncmudswjn.png"
  },
  {
    "_id": "640c2dd963a319ea671e3836",
    "name": "Dijon Mustard",
    "desc": "A type of mustard made from ground mustard seeds, vinegar, and white wine, originating from the city of Dijon in France.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e3796",
    "name": "Whole Wheat",
    "desc": "A type of wheat that contains the bran, germ, and endosperm, used to make whole wheat flour and products such as bread and pasta.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564912/jbakcl7vwgwdahyfqkya.png"
  },
  {
    "_id": "640c2dd963a319ea671e37b0",
    "name": "Duck",
    "desc": "A domesticated bird that is commonly used for meat. Duck meat is known for its rich, gamey flavor and is often roasted or grilled.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564916/mk93ee1bsi2ucoqcvost.png"
  },
  {
    "_id": "640c2dd963a319ea671e37c1",
    "name": "Couscous",
    "desc": "Small granules of semolina wheat, commonly used as a side dish or as a base for salads.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564977/osvx0qxc5t7dxa9cdue4.png"
  },
  {
    "_id": "640c2dd963a319ea671e3853",
    "name": "Noodles",
    "desc": "Noodles are a staple food in many cultures. They are made from unleavened dough which is stretched, extruded, or rolled flat and cut into one of a variety of shapes. While long, thin strips may be the most common, many varieties of noodles are cut into waves, helices, tubes, strings, or shells, or folded over, or cut into other shapes. Noodles are usually cooked in boiling water, sometimes with cooking oil or salt added. They are often pan-fried or deep-fried. Noodles are often served with an accompanying sauce or in a soup. Noodles can be refrigerated for short-term storage or dried and stored for future use. The material composition or geocultural origin must be specified when discussing noodles. The word derives from the German word Nudel.[1]",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e36b5",
    "name": "Creme Fraiche",
    "desc": "A cultured dairy product that is similar to sour cream but has a milder flavor and is less tangy. It is commonly used as a topping for desserts and savory dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/oaehsxv6ff326f2ah379.png"
  },
  {
    "_id": "640c2dd963a319ea671e3775",
    "name": "Sultanas",
    "desc": "A type of dried grape that is commonly used in baking and cooking. They are sweet and tangy, and are often used in cakes, cookies, and savory dishes like couscous or tagines.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/gsotdhyxc2ruxc0gtoow.png"
  },
  {
    "_id": "640c2dd963a319ea671e37bd",
    "name": "Lamb Leg",
    "desc": "Meat from the leg of a young sheep, commonly used for roasting and grilling.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564977/nkvcqwr1ls4zu5yzj42o.png"
  },
  {
    "_id": "640c2dd963a319ea671e384d",
    "name": "Starch",
    "desc": "Starch or amylum is a polymeric carbohydrate consisting of a large number of glucose units joined by glycosidic bonds. This polysaccharide is produced by most green plants as energy storage. It is the most common carbohydrate in human diets and is contained in large amounts in staple foods like potatoes, wheat, maize (corn), rice, and cassava.\r\n\r\nPure starch is a white, tasteless and odorless powder that is insoluble in cold water or alcohol. It consists of two types of molecules: the linear and helical amylose and the branched amylopectin. Depending on the plant, starch generally contains 20 to 25% amylose and 75 to 80% amylopectin by weight.[4] Glycogen, the glucose store of animals, is a more highly branched version of amylopectin.\r\n\r\nIn industry, starch is converted into sugars, for example by malting, and fermented to produce ethanol in the manufacture of beer, whisky and biofuel. It is processed to produce many of the sugars used in processed foods. Mixing most starches in warm water produces a paste, such as wheatpaste, which can be used as a thickening, stiffening or gluing agent. The biggest industrial non-food use of starch is as an adhesive in the papermaking process. Starch can be applied to parts of some garments before ironing, to stiffen them.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e36bb",
    "name": "Dark Brown Sugar",
    "desc": "A type of brown sugar with a higher molasses content and darker color than light brown sugar. It has a rich, caramel flavor and is often used in baking and cooking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/cvoezfaq9imjqhgzij4r.png"
  },
  {
    "_id": "640c2dd963a319ea671e379f",
    "name": "Caramel",
    "desc": "A type of candy made by heating sugar and other ingredients until they turn a golden brown color and develop a rich, sweet flavor. Can be used as a topping for desserts, as a flavoring for coffee or cocktails, or eaten on its own as a candy.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/rardmqzuwtnthapgzk4x.png"
  },
  {
    "_id": "640c2dd963a319ea671e3876",
    "name": "Yellow Onion",
    "desc": "The brown onion or yellow onion is a variety of dry onion with a strong flavour. They have a greenish-white, light yellow, or white inside; its layers of papery skin have a yellow-brown or pale golden colour",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e378e",
    "name": "Vinegar",
    "desc": "A sour liquid made from fermented alcohol, used as a condiment and preservative.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/gtvvqm1qzftt4vg7omz2.png"
  },
  {
    "_id": "640c2dd963a319ea671e366b",
    "name": "Bay Leaves",
    "desc": "The bay leaf is an aromatic leaf commonly used in cooking. It can be used whole, or as dried and ground.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564216/oucufhpi7o8xtvliebgs.png"
  },
  {
    "_id": "640c2dd963a319ea671e3748",
    "name": "Puff Pastry",
    "desc": "A light, flaky pastry that is made by layering butter and dough and then repeatedly folding and rolling the dough to create many layers.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564913/niitander08n22vb2kls.png"
  },
  {
    "_id": "640c2dd963a319ea671e3772",
    "name": "Stir-fry Vegetables",
    "desc": "A mix of vegetables that are commonly used in Asian cuisine, including broccoli, carrots, snow peas, bell peppers, and mushrooms. They are typically stir-fried in a wok or pan with oil and seasoning, and can be served as a side dish or main course.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564916/r1c6qo0urtt7inalcf5u.png"
  },
  {
    "_id": "640c2dd963a319ea671e388d",
    "name": "Sauerkraut",
    "desc": "Sauerkraut is finely cut raw cabbage that has been fermented by various lactic acid bacteria. It has a long shelf life and a distinctive sour flavor, both of which result from the lactic acid formed when the bacteria ferment the sugars in the cabbage leaves.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565178/kced6z0m5hnhxk4n3o6s.png"
  },
  {
    "_id": "640c2dd963a319ea671e365f",
    "name": "Avocado",
    "desc": "The avocado, a tree with probable origin in South Central Mexico, is classified as a member of the flowering plant family Lauraceae. The fruit of the plant, also called an avocado (or avocado pear or alligator pear), is botanically a large berry containing a single large seed.\r\n\r\nAvocados are commercially valuable and are cultivated in tropical and Mediterranean climates throughout the world. They have a green-skinned, fleshy body that may be pear-shaped, egg-shaped, or spherical. Commercially, they ripen after harvesting. Avocado trees are partially self-pollinating, and are often propagated through grafting to maintain predictable fruit quality and quantity. In 2017, Mexico produced 34% of the world supply of avocados.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564125/fqwniel9xt9zhtkyp5za.png"
  },
  {
    "_id": "640c2dd963a319ea671e3681",
    "name": "Canned Tomatoes",
    "desc": "Tomatoes that have been preserved in a can or jar, typically with added salt and sometimes other seasonings, and used in a variety of recipes such as soups, stews, sauces, and chili.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564675/fmctvplqyjfnsocsk7sq.png"
  },
  {
    "_id": "640c2dd963a319ea671e3819",
    "name": "Fruit Mix",
    "desc": "A blend of dried fruits such as raisins, currants, and candied peel used in baking and cooking",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/m2murn7giyh5baqi5jhk.png"
  },
  {
    "_id": "640c2dd963a319ea671e3867",
    "name": "Filo Pastry",
    "desc": "Filo or phyllo (Greek: φύλλο \"leaf\") is a very thin unleavened dough used for making pastries such as baklava and börek in Middle Eastern and Balkan cuisines. Filo-based pastries are made by layering many sheets of filo brushed with oil or butter; the pastry is then baked.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565046/rzbd4vehlocc0mftbw0g.png"
  },
  {
    "_id": "640c2dd963a319ea671e3891",
    "name": "Mulukhiyah",
    "desc": "Mulukhiyah , molokheyya ,molokhia or mulukhiyyah (Arabic:  mulūkhiyyah) Greek : molokha is the leaves of Corchorus olitorius, commonly known in English as jute, nalta jute, tossa jute , jute mallow or Jew's mallow. It is used as a vegetable. It is popular in Middle East, East African and North African countries and is called “Saluyot” in the Philippines. Mulukhiyah is rather bitter, and when boiled, the resulting liquid is a thick, highly mucilaginous broth; it is often described as \"slimy\", rather like cooked okra. Mulukhiyah is generally eaten cooked, not raw, and is most frequently turned into a kind of soup or stew, typically bearing the same name as the vegetable in the local language. Traditionally mulukhiyah is cooked with chicken or at least chicken stock for flavor and is served with white rice, accompanied with lemon or lime.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565178/jdqaggwnpriht6zrxh2t.png"
  },
  {
    "_id": "640c2dd963a319ea671e3782",
    "name": "Turmeric",
    "desc": "A bright yellow spice commonly used in Indian and Southeast Asian cuisines, known for its earthy flavor and health benefits.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/y6sfzxg44kthntemuun0.png"
  },
  {
    "_id": "640c2dd963a319ea671e3713",
    "name": "Lemon Zest",
    "desc": "Lemon zest is the outermost layer of the lemon peel, which is rich in essential oils and has a strong, citrusy aroma and flavor. It is commonly used as a flavoring agent in cooking, baking, and cocktails.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564853/atoi1bqnsq6hplmzldgv.png"
  },
  {
    "_id": "640c2dd963a319ea671e379e",
    "name": "Toffee Popcorn",
    "desc": "A type of popcorn that is coated in a sweet, sticky toffee sauce, often mixed with nuts or other flavorings. A popular snack food for movie theaters and other entertainment venues.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/tgi4wm9rj2bk2eeluo9v.png"
  },
  {
    "_id": "640c2dd963a319ea671e3878",
    "name": "Chicken Stock Concentrate",
    "desc": "Stock, sometimes called bone broth, is a savory cooking liquid that forms the basis of many dishes, particularly soups, stews and sauces. Making stock involves simmering animal bones or meat, seafood, or vegetables in water or wine, often for an extended period of time. Mirepoix or other aromatics may be added for more flavor.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e3749",
    "name": "Raspberry Jam",
    "desc": "A sweet spread made from raspberries and sugar that is often used as a topping for bread, scones, and pastries.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564910/ysy18xxcwkm1247viiog.png"
  },
  {
    "_id": "640c2dd963a319ea671e3781",
    "name": "Tuna",
    "desc": "A saltwater fish with firm, meaty flesh, commonly used in a variety of cuisines, including sushi, salads, and sandwiches.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/eny2eswuvz2owcjskgyr.png"
  },
  {
    "_id": "640c2dd963a319ea671e37f2",
    "name": "Tahini",
    "desc": "A paste made from toasted sesame seeds that is commonly used in Middle Eastern cuisine, particularly as a dip or sauce for dishes like falafel and shawarma.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564980/exsqndpdha9bqq3mg8pi.png"
  },
  {
    "_id": "640c2dd963a319ea671e381e",
    "name": "Oatmeal",
    "desc": "A type of coarse flour made from ground oats, often used in baking and cooking",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/cwvfnnrnlojfcwacffgv.png"
  },
  {
    "_id": "640c2dd963a319ea671e369a",
    "name": "Chilled Butter",
    "desc": "Butter that has been chilled or kept in the refrigerator. It is often used in pastry doughs or other baked goods to create a flaky texture.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/dhxvdtm1buftudnb6ple.png"
  },
  {
    "_id": "640c2dd963a319ea671e3691",
    "name": "Cherry Tomatoes",
    "desc": "Small, bite-sized tomatoes that are typically sweeter and more flavorful than larger varieties. They are often used in salads or as a snack.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564673/nxuuo1bmhrnuqbnm9skh.png"
  },
  {
    "_id": "640c2dd963a319ea671e37fb",
    "name": "Suet",
    "desc": "A type of animal fat that is commonly used in British cuisine for making pastry and puddings, and is particularly associated with dishes like Christmas pudding and steak and kidney pie.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/clpeo5kgdl4sjsrk4vr2.png"
  },
  {
    "_id": "640c2dd963a319ea671e3669",
    "name": "Basmati Rice",
    "desc": "Basmati is a variety of long, slender-grained aromatic rice which is traditionally from the Indian subcontinent. As of 2018-19, India exported to over 90% of the overseas basmati rice market, while Pakistan accounted for the remainder, according to the Indian state-run Agricultural and Processed Food Products Export Development Authority  and the Pakistan government-run Economic Survey of Pakistan. Many countries use domestically grown basmati rice crops; however, basmati is geographically exclusive to select districts of India, Pakistan, Nepal and Bangladesh.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564218/mlam2som4r46vlggwxhg.png"
  },
  {
    "_id": "640c2dd963a319ea671e368e",
    "name": "Cheddar Cheese",
    "desc": "A hard, yellow cheese that is typically sharp and tangy in flavor. It is often used in sandwiches, on crackers, or as a topping for baked dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/mwiry42e111yedrdy78q.png"
  },
  {
    "_id": "640c2dd963a319ea671e3830",
    "name": "Custard Powder",
    "desc": "A powdered mixture used to make custard by adding milk and sugar and heating until thickened.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e374d",
    "name": "Red Chilli Powder",
    "desc": "A spice made from dried and ground red chili peppers that is often used to add heat and flavor to dishes such as curries, soups, and stews.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/uw7kxyq5ghoqno3f3dh5.png"
  },
  {
    "_id": "640c2dd963a319ea671e382d",
    "name": "White Chocolate",
    "desc": "A type of chocolate made with cocoa butter, sugar, milk solids, and vanilla, without cocoa solids.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/pwips46xoozahptualax.png"
  },
  {
    "_id": "640c2dd963a319ea671e37ab",
    "name": "Fish Stock",
    "desc": "A flavorful broth made by simmering fish bones, vegetables, and aromatics in water, often used as a base for soups, stews, and sauces.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/nh78vd3rmmjqfpl8fowo.png"
  },
  {
    "_id": "640c2dd963a319ea671e37e5",
    "name": "Yellow Pepper",
    "desc": "Yellow peppers are a type of bell pepper with a sweet, mild flavor. They are commonly used in salads, stir-fries, and other culinary applications.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/fyi5lre9cfsg0dv2w1az.png"
  },
  {
    "_id": "640c2dd963a319ea671e37e9",
    "name": "Chestnuts",
    "desc": "Chestnuts are a type of nut that grow inside a prickly outer shell. They have a sweet, nutty flavor and can be eaten roasted, boiled, or used in desserts and other culinary applications.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/eziybzbeepyuywrwfsqm.png"
  },
  {
    "_id": "640c2dd963a319ea671e3696",
    "name": "Chicken Stock",
    "desc": "A flavorful liquid made by simmering chicken bones, vegetables, and herbs in water. It is often used as a base for soups, stews, and sauces.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564673/vsmy1y1dtawqanvrkbah.png"
  },
  {
    "_id": "640c2dd963a319ea671e36e8",
    "name": "Ginger",
    "desc": "A root vegetable with a pungent and spicy flavor commonly used in cooking and herbal medicine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/xewijwh6p1aye9b79mkn.png"
  },
  {
    "_id": "640c2dd963a319ea671e36ce",
    "name": "Fajita Seasoning",
    "desc": "A blend of spices typically used to season chicken, beef, or vegetable fajitas. The seasoning usually includes chili powder, cumin, garlic powder, and paprika.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/mw4fpydsjgigtarnbjnp.png"
  },
  {
    "_id": "640c2dd963a319ea671e37c8",
    "name": "Fennel",
    "desc": "A herb with a sweet, anise-like flavor commonly used in Mediterranean and Middle Eastern cuisine to add flavor to dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/rwsyfsla2qufmrcgfdam.png"
  },
  {
    "_id": "640c2dd963a319ea671e37e6",
    "name": "Green Pepper",
    "desc": "Green peppers are a type of bell pepper with a slightly bitter flavor. They are commonly used in salads, stir-fries, and other culinary applications.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564977/rvy6dj8cfkkhldjqen4d.png"
  },
  {
    "_id": "640c2dd963a319ea671e386b",
    "name": "Sherry",
    "desc": "Sherry is a fortified wine made from white grapes that are grown near the city of Jerez de la Frontera in Andalusia, Spain.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/lu2fktrhwyplxb51om1w.png"
  },
  {
    "_id": "640c2dd963a319ea671e36e2",
    "name": "Garam Masala",
    "desc": "A blend of ground spices commonly used in Indian cuisine, typically including cinnamon, cardamom, cloves, cumin, coriander, and black pepper. It has a warm, complex flavor and is often used to season meat, vegetables, and rice dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/rt5eb8oxjqtqzcwaacgg.png"
  },
  {
    "_id": "640c2dd963a319ea671e37f4",
    "name": "Udon Noodles",
    "desc": "A type of thick, wheat-based noodle that is commonly used in Japanese cuisine, particularly in soups and stir-fry dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/xycyoun9spdllkddxd2r.png"
  },
  {
    "_id": "640c2dd963a319ea671e3850",
    "name": "Duck Sauce",
    "desc": "Duck sauce (or orange sauce) is a condiment with a sweet and sour flavor and a translucent orange appearance similar to a thin jelly. Offered at Chinese-American restaurants, it is used as a dip for deep-fried dishes such as wonton strips, spring rolls, egg rolls, duck, chicken, fish, or with rice or noodles. It is often provided in single-serving packets along with soy sauce, mustard, hot sauce or red chili powder. It may be used as a glaze on foods, such as poultry. Despite its name the sauce is not prepared using duck meat.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565033/n18afqzetlxqxfepr5s2.png"
  },
  {
    "_id": "640c2dd963a319ea671e3834",
    "name": "Creamed Corn",
    "desc": "A dish made from corn kernels that have been cooked in milk and butter, and then pureed to create a creamy texture.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565033/ydvex4hhckp59lfyrcbc.png"
  },
  {
    "_id": "640c2dd963a319ea671e3730",
    "name": "Orange Zest",
    "desc": "The outermost layer of the orange peel, used in cooking for its fragrant and flavorful oils.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/ggtx823qqensttjlmc3d.png"
  },
  {
    "_id": "640c2dd963a319ea671e3880",
    "name": "Dill Pickles",
    "desc": "A pickled cucumber is a cucumber that has been pickled in a brine, vinegar, or other solution and left to ferment for a period of time, by either immersing the cucumbers in an acidic solution or through souring by lacto-fermentation. Pickled cucumbers are often part of mixed pickles.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/zlxuryb0juvq5wjnpkkr.png"
  },
  {
    "_id": "640c2dd963a319ea671e36a7",
    "name": "Cloves",
    "desc": "A pungent spice commonly used in baking and cooking, made from the dried flower buds of the clove tree.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/b59w3cg5kmq3nl58ebyx.png"
  },
  {
    "_id": "640c2dd963a319ea671e3765",
    "name": "Shallots",
    "desc": "Shallots are a type of onion that have a milder flavor than regular onions. They are typically smaller and have a brownish-red skin, and are often used in French cooking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564912/vce9zygk3rvqvzoynvxh.png"
  },
  {
    "_id": "640c2dd963a319ea671e37cb",
    "name": "Rosemary",
    "desc": "An herb with a pine-like fragrance and strong, earthy flavor, commonly used in Mediterranean and Italian cuisine to add flavor to dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/fzovyjme8miis1b8opuc.png"
  },
  {
    "_id": "640c2dd963a319ea671e36b7",
    "name": "Cucumber",
    "desc": "A green vegetable that is often used in salads and sandwiches. It has a crunchy texture and a mild, refreshing flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/qzflrgjdyqtpdeoa9kp5.png"
  },
  {
    "_id": "640c2dd963a319ea671e3722",
    "name": "Mint",
    "desc": "A fragrant herb that is often used as a flavoring in cooking and beverages, and is known for its refreshing and cooling properties.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/w10z2zouxnaw8g6rp7ly.png"
  },
  {
    "_id": "640c2dd963a319ea671e3811",
    "name": "Yellow Food Colouring",
    "desc": "A type of food coloring used to add a bright yellow color to foods and drinks.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/yk7nki1nz3txojkglyya.png"
  },
  {
    "_id": "640c2dd963a319ea671e383b",
    "name": "Ackee",
    "desc": "A fruit that is native to West Africa, but is also grown in the Caribbean, and is often used in traditional Jamaican dishes such as ackee and saltfish.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565048/tfkc3illmf7rtyahysrq.png"
  },
  {
    "_id": "640c2dd963a319ea671e3848",
    "name": "Doubanjiang",
    "desc": "Doubanjiang (IPA: [tôupântɕjâŋ]), or simply Douban, or Toban-djan, Chili bean sauce, is a spicy, salty paste made from fermented broad beans, soybeans, salt, rice, and various spices. Doubanjiang exists in plain and spicy versions, with the latter containing red chili peppers and called la doubanjiang (辣豆瓣酱; pinyin: là dòubànjiàng; là meaning \"hot\" or \"spicy\").\r\n\r\nIt is used particularly in Sichuan cuisine, and in fact, the people of the province commonly refer to it as \"the soul of Sichuan cuisine\". A particularly well-known variety is called Pixian Douban (simplified Chinese: 郫县豆瓣; traditional Chinese: 郫縣豆瓣; pinyin: Píxiàn dòubàn), named after the district of Pixian, Sichuan.[1]\r\n\r\nThis sauce is sometimes stir-fried with oil and eaten with rice or noodles as a quick meal, and is also commonly used as a primary flavoring for fried tofu dishes and cold tofu salads. It is also frequently mixed with instant noodles.\r\n\r\nIn many Chinese communities and food factories, doubanjiang is produced with only soybeans and salt, and does not contain the broad beans or chili peppers typical of Sichuan-style doubanjiang.\r\n\r\nIn Korean cuisine, a similar form of bean paste is called doenjang.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e36a3",
    "name": "Christmas Pudding",
    "desc": "A traditional British dessert that is typically served during the Christmas season, made with dried fruit, spices, and suet, and often served with brandy butter or custard.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/xyrunjhboabya4lgwrlw.png"
  },
  {
    "_id": "640c2dd963a319ea671e36b3",
    "name": "Cornstarch",
    "desc": "A fine, powdery starch made from corn kernels that is commonly used as a thickening agent in sauces, soups, and gravies.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/piwiporo0wl72xskqqvw.png"
  },
  {
    "_id": "640c2dd963a319ea671e37ca",
    "name": "Haricot Beans",
    "desc": "Also known as navy beans, small white beans with a mild flavor and creamy texture, often used in soups, stews, and casseroles.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/vmql8ylagejiimzzgya5.png"
  },
  {
    "_id": "640c2dd963a319ea671e383e",
    "name": "Baby Aubergine",
    "desc": "Eggplant (Solanum melongena) or aubergine is a species of nightshade grown for its edible fruit. Eggplant is the common name in North America, Australia and New Zealand; in British English, it is aubergine, and in South Asia and South Africa, brinjal.\r\n\r\nThe fruit is widely used in cooking. As a member of the genus Solanum, it is related to the tomato and the potato. It was originally domesticated from the wild nightshade species, the thorn or bitter apple, S. incanum, probably with two independent domestications, one in South Asia and one in East Asia.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e3858",
    "name": "English Muffins",
    "desc": "English muffins are a small, round, flat yeast-leavened bread which is commonly sliced horizontally, toasted, and buttered.[2] Toasted English muffins, which are often used in the United States as a breakfast food, may be served with sweet toppings (e.g., fruit jam, or honey) or savoury toppings (e.g., eggs, sausage rounds, bacon, or cheese). English muffins are also used as the bread in a variety of breakfast sandwiches, and are an essential ingredient in Eggs Benedict and most of its variations.\r\n\r\nIn the United States and U.S.-influenced territories, they are called English muffins to distinguish them from U.S. muffins, which are larger and sweeter miniature baked quick breads. They are very similar to bolo do caco in Portuguese cuisine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565048/g9hrmgqa6kseacomqae3.png"
  },
  {
    "_id": "640c2dd963a319ea671e368c",
    "name": "Challots",
    "desc": "A type of onion that has a mild, sweet flavor and a distinctive bulb shape, often used in French cuisine to add flavor to sauces, dressings, and other dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/ovlvnvcuzttiplnzewm3.png"
  },
  {
    "_id": "640c2dd963a319ea671e3882",
    "name": "Buns",
    "desc": "A bun is a small, sometimes sweet, bread-based item or roll. Though they come in many shapes and sizes, they are most commonly hand-sized or smaller, with a round top and flat bottom. Buns are usually made from flour, sugar, milk, yeast and butter.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/kadnulkdxzzr22fpsc5f.png"
  },
  {
    "_id": "640c2dd963a319ea671e36ad",
    "name": "Cold Water",
    "desc": "Water that is at or below room temperature and has not been heated or warmed.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/cq6bb6hxuc7p2tlol9jg.png"
  },
  {
    "_id": "640c2dd963a319ea671e376d",
    "name": "Soya Milk",
    "desc": "A plant-based milk made from soybeans that is a popular alternative to dairy milk. It is high in protein, vitamins, and minerals, and is commonly used as a milk substitute in cooking and baking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/zhqiselxnhwvs6gu0jon.png"
  },
  {
    "_id": "640c2dd963a319ea671e36c1",
    "name": "Dill",
    "desc": "An aromatic herb that is commonly used in European and Mediterranean cuisines. It has a fresh, tangy flavor that pairs well with fish, vegetables, and dips.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/j9diim3cuaevpjlqt0ug.png"
  },
  {
    "_id": "640c2dd963a319ea671e36dd",
    "name": "Fresh Basil",
    "desc": "An aromatic herb with green leaves that are used in many cuisines around the world, particularly in Italian cuisine. It has a sweet, slightly peppery flavor and a strong, pleasant aroma.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/kc3bngtbfjx85mhk6p0i.png"
  },
  {
    "_id": "640c2dd963a319ea671e3889",
    "name": "Pickle Juice",
    "desc": "Pickling is the process of preserving or extending the shelf life of food by either anaerobic fermentation in brine or immersion in vinegar. In East Asia, vinaigrette is also used as a pickling medium. The pickling procedure typically affects the food's texture, taste and flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/wr6grvu81mzjoyndykyg.png"
  },
  {
    "_id": "640c2dd963a319ea671e36b8",
    "name": "Cumin",
    "desc": "A spice that is commonly used in cooking and has a warm, earthy flavor. It is often used in Indian, Middle Eastern, and Mexican cuisine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/hvjzishm1uyqnfk1fcdc.png"
  },
  {
    "_id": "640c2dd963a319ea671e36d8",
    "name": "Flour Tortilla",
    "desc": "A type of soft, thin, unleavened flatbread made from wheat flour commonly used in Mexican cuisine for making burritos, tacos, and quesadillas.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/kfvwbqkgyrot67y559lz.png"
  },
  {
    "_id": "640c2dd963a319ea671e36ff",
    "name": "Hot Beef Stock",
    "desc": "Hot beef stock is a flavorful liquid made by simmering beef bones and vegetables in water. It is commonly used as a base for soups, stews, and sauces to add richness and depth of flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/vc9iccdi2arqdpopici5.png"
  },
  {
    "_id": "640c2dd963a319ea671e3885",
    "name": "Cheese Slices",
    "desc": "Processed cheese is a food product made from cheese and other unfermented dairy ingredients mixed with emulsifiers. Additional ingredients, such as vegetable oils, salt, food coloring, or sugar may be included. As a result, many flavors, colors, and textures of processed cheese exist.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e37f3",
    "name": "Tortillas",
    "desc": "Thin, flatbreads made from corn or wheat flour that are commonly used in Mexican cuisine for dishes like tacos, burritos, and quesadillas.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/zhg3d0rlc8fmvbmzd7od.png"
  },
  {
    "_id": "640c2dd963a319ea671e368d",
    "name": "Charlotte Potatoes",
    "desc": "Small, waxy potatoes with a creamy texture and delicate skin. They are ideal for boiling, roasting, and salads.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/xrj1pbv3aazsiz5dnlw8.png"
  },
  {
    "_id": "640c2dd963a319ea671e36ba",
    "name": "Curry Powder",
    "desc": "A blend of spices commonly used in Indian cuisine. It typically includes turmeric, cumin, coriander, ginger, and other spices, and can vary in spiciness and flavor depending on the blend.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/mkvl5ajnzgpv0twvph9c.png"
  },
  {
    "_id": "640c2dd963a319ea671e381a",
    "name": "Dried Fruit",
    "desc": "Fruit that has been dried to remove most of its water content, often used in baking, cooking, and snacking",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/nwdcung7uapmzanomd99.png"
  },
  {
    "_id": "640c2dd963a319ea671e384b",
    "name": "Sichuan Pepper",
    "desc": "Sichuan pepper, Sichuan peppercorn, or Szechuan pepper, is a commonly used spice in Chinese cuisine. It is derived from at least two species of the global genus Zanthoxylum, including Z. simulans and Z. bungeanum. The genus Zanthoxylum belongs in the rue or citrus family, and, despite its name, is not closely related to either black pepper nor the chili pepper.\r\n\r\nThe husk or hull (pericarp) around the seeds may be used whole, especially in Sichuan cuisine, and the finely ground powder is one of the ingredients for five-spice powder. It is also used in traditional Chinese medicine. The pericarp is most often used, but the leaves of various species are also used in some regions of China.\r\n\r\nAnother species of Zanthoxylum native to China, Z. schinifolium, called xiāng jiāo zi (香椒子, \"aromatic peppercorn\") or qīng huā jiāo (青花椒, \"green flower pepper\"), is used as a spice in Hebei.\r\n\r\nWhile the exact flavour and composition of different species from the genus Zanthoxylum vary, most share the same essential characteristics. So while the terms \"Sichuan pepper\" and sanshō may refer specifically to Z. simulans and Z. piperitum, respectively, the two are commonly used interchangeably.\r\n\r\nRelated species are used in the cuisines of Tibet, Bhutan, Nepal, Thailand, and India (the Konkani and Uttarakhandi people) and Toba Batak peoples. In Bhutan, this pepper is known as thingye and is used liberally in preparation of soups, gruels, and phaag sha paa (pork slices).[citation needed] In Nepal, timur is used in the popular foods momo, thukpa, chow mein, chicken chilli, and other meat dishes. It is also widely used in homemade pickles. People take timur as a medicine for stomach or digestion problems, in a preparation with cloves of garlic and mountain salt with warm water.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565033/k8abbxza5fxrqd0ajksy.png"
  },
  {
    "_id": "640c2dd963a319ea671e37fa",
    "name": "Vine Tomatoes",
    "desc": "Tomatoes that are grown on a vine and are typically smaller and more flavorful than regular tomatoes, and are commonly used in salads and as a topping for pizzas and bruschetta.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/zl9ndinpolmqpejt1oei.png"
  },
  {
    "_id": "640c2dd963a319ea671e3839",
    "name": "Cod",
    "desc": "A type of fish that is commonly used in cooking due to its mild flavor and versatility, and is often used in dishes such as fish and chips.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e37f8",
    "name": "Sesame Seed Oil",
    "desc": "An oil made from toasted sesame seeds that is commonly used in East Asian cuisine for its nutty flavor and aroma, and is often used as a finishing oil or for stir-frying.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564976/w7fcxc7duie4vhzrftoz.png"
  },
  {
    "_id": "640c2dd963a319ea671e37d9",
    "name": "Maple Syrup",
    "desc": "A sweet and flavorful syrup made from the sap of maple trees, often used as a topping for pancakes, waffles, or oatmeal.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564977/nv3kwhvmatnqwfti5qpb.png"
  },
  {
    "_id": "640c2dd963a319ea671e36d1",
    "name": "Fennel Seeds",
    "desc": "Small, aromatic seeds from the fennel plant with a sweet, licorice-like flavor. Often used in Indian and Middle Eastern cuisine as a spice and digestive aid.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564797/fkfa5buebebnyfemy1vt.png"
  },
  {
    "_id": "640c2dd963a319ea671e37d3",
    "name": "Capers",
    "desc": "Small, pickled flower buds with a tangy, slightly salty flavor, commonly used in Mediterranean and Italian cuisine to add flavor to dishes like pasta sauces, salads, and fish dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/nde06x0crsgoqvtpswnt.png"
  },
  {
    "_id": "640c2dd963a319ea671e373d",
    "name": "Pecorino",
    "desc": "A hard, salty cheese made from sheep's milk, commonly used in Italian cooking for its sharp, tangy flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/op4rqfnwoahaopd4hw1w.png"
  },
  {
    "_id": "640c2dd963a319ea671e3753",
    "name": "Rice",
    "desc": "Edible starchy grain that is cultivated in many parts of the world and is a staple food for a large part of the world's population.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564913/iz516nbnquplcym3bwqw.png"
  },
  {
    "_id": "640c2dd963a319ea671e3809",
    "name": "Mixed Peel",
    "desc": "A mixture of chopped candied citrus peel, often used in baking and cooking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/rybwew3k63c8ih1sd3zs.png"
  },
  {
    "_id": "640c2dd963a319ea671e3896",
    "name": "Sardines",
    "desc": "\"Sardine\" and \"pilchard\" are common names that refer to various small, oily forage fish in the herring family Clupeidae. The term \"sardine\" was first used in English during the early 15th century and may come from the Mediterranean island of Sardinia, around which sardines were once abundant.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565178/gefoqmunmmwev0ikmvva.png"
  },
  {
    "_id": "640c2dd963a319ea671e3664",
    "name": "Bacon",
    "desc": "Bacon is a type of salt-cured pork. Bacon is prepared from several different cuts of meat, typically from the pork belly or from back cuts, which have less fat than the belly. It is eaten on its own, as a side dish (particularly in breakfasts), or used as a minor ingredient to flavour dishes (e.g., the club sandwich). Bacon is also used for barding and larding roasts, especially game, including venison and pheasant. The word is derived from the Old High German bacho, meaning \"buttock\", \"ham\" or \"side of bacon\", and is cognate with the Old French bacon.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564216/nspbbbsb9hrvohliwgwp.png"
  },
  {
    "_id": "640c2dd963a319ea671e367d",
    "name": "Brown Sugar",
    "desc": "A type of sugar that has a distinctive brown color and a rich, molasses-like flavor, often used in baking and cooking to add sweetness and depth of flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/mpgb0qup83zc2n5d5nxy.png"
  },
  {
    "_id": "640c2dd963a319ea671e3888",
    "name": "Boiling Water",
    "desc": "Water is an inorganic, transparent, tasteless, odorless, and nearly colorless chemical substance, which is the main constituent of Earth's hydrosphere and the fluids of most living organisms. It is vital for all known forms of life, even though it provides no calories or organic nutrients. Its chemical formula is H2O, meaning that each of its molecules contains one oxygen and two hydrogen atoms, connected by covalent bonds. Water is the name of the liquid state of H2O at standard ambient temperature and pressure. It forms precipitation in the form of rain and aerosols in the form of fog. Clouds are formed from suspended droplets of water and ice, its solid state. When finely divided, crystalline ice may precipitate in the form of snow. The gaseous state of water is steam or water vapor. Water moves continually through the water cycle of evaporation, transpiration (evapotranspiration), condensation, precipitation, and runoff, usually reaching the sea.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/gnxhae8kuhj7ljviz3nr.png"
  },
  {
    "_id": "640c2dd963a319ea671e3680",
    "name": "Cajun",
    "desc": "A style of cooking that originated in Louisiana and combines French, African, and Native American culinary traditions, featuring bold and spicy flavors and often incorporating seafood, rice, and vegetables.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564673/ztvcglvh4ombxplvikxh.png"
  },
  {
    "_id": "640c2dd963a319ea671e3670",
    "name": "Bicarbonate Of Soda",
    "desc": "Sodium bicarbonate, commonly known as baking soda, is a chemical compound with the formula NaHCO3. It is a salt composed of a sodium cation (Na+) and a bicarbonate anion (HCO3−). Sodium bicarbonate is a white solid that is crystalline, but often appears as a fine powder. It has a slightly salty, alkaline taste resembling that of washing soda (sodium carbonate). The natural mineral form is nahcolite. It is a component of the mineral natron and is found dissolved in many mineral springs.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564217/fdivqhqlqpniekzqx7yd.png"
  },
  {
    "_id": "640c2dd963a319ea671e3725",
    "name": "Muscovado Sugar",
    "desc": "A type of unrefined brown sugar that has a strong, molasses-like flavor and a moist texture, and is often used in baking and cooking for its rich taste and color.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564856/a9owtjykxlkqttwvgzd1.png"
  },
  {
    "_id": "640c2dd963a319ea671e377c",
    "name": "Thyme",
    "desc": "A fragrant herb with small, delicate leaves and a pungent flavor, commonly used in Mediterranean and French cuisines as a seasoning for meat, fish, and vegetables.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564911/fyavzbalgqahy8exwrjs.png"
  },
  {
    "_id": "640c2dd963a319ea671e379c",
    "name": "Cream Cheese",
    "desc": "A soft, spreadable cheese made from a blend of milk and cream, with a mild flavor and creamy texture. Often used as a topping for bagels, as a base for dips and spreads, or as an ingredient in baking recipes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564916/cihecrpcw48gyjdyid5h.png"
  },
  {
    "_id": "640c2dd963a319ea671e3844",
    "name": "Malt Vinegar",
    "desc": "Vinegar is a liquid consisting of about 5–20% acetic acid (CH3COOH), water, and other trace chemicals, which may include flavorings. The acetic acid is produced by the fermentation of ethanol by acetic acid bacteria. Vinegar is now mainly used as a cooking ingredient, or in pickling. As the most easily manufactured mild acid, it has historically had a great variety of industrial, medical, and domestic uses, some of which (such as its use as a general household cleaner) are still commonly practiced today.\r\n\r\nCommercial vinegar is produced either by a fast or a slow fermentation process. In general, slow methods are used in traditional vinegars where fermentation proceeds slowly over the course of a few months or up to a year. The longer fermentation period allows for the accumulation of a non-toxic slime composed of acetic acid bacteria. Fast methods add mother of vinegar (bacterial culture) to the source liquid before adding air to oxygenate and promote the fastest fermentation. In fast production processes, vinegar may be produced between 20 hours to three days.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565033/puo9irknzncej6bcksrh.png"
  },
  {
    "_id": "640c2dd963a319ea671e3735",
    "name": "Parmesan",
    "desc": "A hard, granular cheese made from cow's milk, commonly used in Italian cooking for its sharp, nutty flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/h2gvlqxzvvinbfv3ssbq.png"
  },
  {
    "_id": "640c2dd963a319ea671e374c",
    "name": "Red Chilli",
    "desc": "A fresh, spicy pepper that is often used in cooking to add heat and flavor to dishes such as curries, stir-fries, and marinades.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564911/wmecrzzxjms9cltjyvmu.png"
  },
  {
    "_id": "640c2dd963a319ea671e382e",
    "name": "Star Anise",
    "desc": "A star-shaped spice with a licorice-like flavor used in Chinese and Vietnamese cuisine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565033/g6t21u5zv3a7nwiq7xdw.png"
  },
  {
    "_id": "640c2dd963a319ea671e3729",
    "name": "Mustard Seeds",
    "desc": "Small, round seeds that are derived from the mustard plant, and are often used as a spice in cooking and seasoning for their pungent and tangy flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/uqmyi4ps9pbzghoicyc5.png"
  },
  {
    "_id": "640c2dd963a319ea671e3726",
    "name": "Mushrooms",
    "desc": "Fungi that are used in cooking and have a wide variety of shapes, sizes, and flavors, ranging from delicate and earthy to meaty and umami.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/ydwyzkmct8oaykrfjrbv.png"
  },
  {
    "_id": "640c2dd963a319ea671e3784",
    "name": "Turnips",
    "desc": "A root vegetable with a slightly sweet and bitter flavor, commonly used in European and Asian cuisines, often boiled, roasted, or mashed.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/jla42lyklodwvhpflstd.png"
  },
  {
    "_id": "640c2dd963a319ea671e37b8",
    "name": "Fromage Frais",
    "desc": "A type of fresh, soft cheese that originated in France. Fromage frais has a tangy, creamy flavor and is often used in desserts or as a spread.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564916/nqjd3zoyhqpwj4ns9wp4.png"
  },
  {
    "_id": "640c2dd963a319ea671e37de",
    "name": "Dark Chocolate",
    "desc": "A type of chocolate that is made with higher cocoa solids and little to no milk. It has a rich and bitter taste.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564976/h7bpuj7801qbjdgxggj5.png"
  },
  {
    "_id": "640c2dd963a319ea671e3676",
    "name": "Bramley Apples",
    "desc": "A type of apple that is popular in the UK and Ireland, known for its tart flavor and firm texture, which makes it ideal for cooking and baking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564216/cmakgrcdewhz0utfsw6r.png"
  },
  {
    "_id": "640c2dd963a319ea671e374b",
    "name": "Red Chile Flakes",
    "desc": "Dried and crushed chili peppers that are often used to add heat and flavor to dishes such as chili, soups, and stews.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564912/ofaqysvlkq1sxpuisbyp.png"
  },
  {
    "_id": "640c2dd963a319ea671e3778",
    "name": "Tamarind Paste",
    "desc": "A thick, dark brown paste made from the pulp of the tamarind fruit, used as a souring agent in cooking, especially in Indian, Thai, and Mexican cuisines.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564911/btyipmdiyxhejfuvusu6.png"
  },
  {
    "_id": "640c2dd963a319ea671e36cd",
    "name": "Extra Virgin Olive Oil",
    "desc": "A high-quality oil made from the first pressing of the olives, with a fruity flavor and low acidity. Often used in dressings and for finishing dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564796/wornokeoy7lwi7soyymw.png"
  },
  {
    "_id": "640c2dd963a319ea671e370d",
    "name": "Lamb Mince",
    "desc": "Also known as ground lamb, lamb mince is made by grinding lamb meat and can be used in a variety of dishes, including meatballs, burgers, and shepherd's pie.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/gfegbclkt45fauwrvfih.png"
  },
  {
    "_id": "640c2dd963a319ea671e3824",
    "name": "Red Wine Jelly",
    "desc": "A sweet, tangy jelly made from red wine, often served with cheese and crackers or as a glaze for meats",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/e8wdpzauoneokxbmdchm.png"
  },
  {
    "_id": "640c2dd963a319ea671e36fc",
    "name": "Heavy Cream",
    "desc": "Heavy cream, also known as whipping cream, is a type of dairy product that has a high fat content. It is commonly used in baking, cooking, and as a topping for desserts like fruit and ice cream.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/lixhuj1wsoj7mm7j6hxv.png"
  },
  {
    "_id": "640c2dd963a319ea671e370f",
    "name": "Lean Minced Beef",
    "desc": "Also known as ground beef, lean minced beef is made by grinding beef meat and has a lower fat content than regular ground beef. It can be used in a variety of dishes, including meatballs, burgers, and chili.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564856/dperv2hqr1c3uxwzludl.png"
  },
  {
    "_id": "640c2dd963a319ea671e3714",
    "name": "Lemons",
    "desc": "Lemons are a citrus fruit that are typically bright yellow in color and have a sour, acidic flavor. They are commonly used as a flavoring agent in cooking, baking, and beverages, and are also a source of vitamin C.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/sovs4biit4mdsqbwebjh.png"
  },
  {
    "_id": "640c2dd963a319ea671e378b",
    "name": "Vegetable Stock Cube",
    "desc": "A dehydrated and compressed form of vegetable stock used to add flavor to dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/ja2npbbtzyt5jpmxgcwe.png"
  },
  {
    "_id": "640c2dd963a319ea671e37a4",
    "name": "Corn Flour",
    "desc": "A fine, powdery flour made by grinding dried corn kernels, commonly used as a thickener in soups, stews, and sauces.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/qx25tqsa3ucslvdxzgdk.png"
  },
  {
    "_id": "640c2dd963a319ea671e373f",
    "name": "Pepper",
    "desc": "A spice made from ground dried peppercorns, commonly used in cooking and as a table seasoning for its pungent and spicy flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/qdnacuigdp7bquzjclub.png"
  },
  {
    "_id": "640c2dd963a319ea671e37ff",
    "name": "Stout",
    "desc": "A dark, rich beer that is made using roasted malts, often with a creamy and smooth texture.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564977/jz5yfafhm8lwqmwrgrfg.png"
  },
  {
    "_id": "640c2dd963a319ea671e37a2",
    "name": "Fettuccine",
    "desc": "A type of pasta that is long and flat, wider than linguine but narrower than tagliatelle.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/nocmoagfeai1tqcblgq9.png"
  },
  {
    "_id": "640c2dd963a319ea671e3810",
    "name": "Blue Food Colouring",
    "desc": "A type of food coloring used to add a bright blue color to foods and drinks.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564976/wjs4kmaxbxhsl5wfjb7i.png"
  },
  {
    "_id": "640c2dd963a319ea671e384a",
    "name": "Scallions",
    "desc": "Scallions (green onion, spring onion and salad onion) are vegetables of various Allium onion species. Scallions have a milder taste than most onions. Their close relatives include the garlic, shallot, leek, chive, and Chinese onion.\r\n\r\nAlthough the bulbs of many Allium species are used as food, the defining characteristic of scallion species is that they lack a fully developed bulb. In common with all Allium species, scallions have hollow, tubular green leaves, growing directly from the bulb. These leaves are used as a vegetable; they are eaten either raw or cooked. The leaves are often chopped into other dishes, in the manner of onions or garlic. Also known as scallions or green onions, spring onions are in fact very young onions, harvested before the bulb has had a chance to swell.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/hdypzcxodz33uetounwj.png"
  },
  {
    "_id": "640c2dd963a319ea671e3835",
    "name": "Sun-Dried Tomatoes",
    "desc": "Tomatoes that have been sliced and then left to dry in the sun or a dehydrator until most of their moisture has evaporated, resulting in a concentrated and intensely flavored product.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/qvrrvcyxm8mktin2u0b7.png"
  },
  {
    "_id": "640c2dd963a319ea671e3731",
    "name": "Oregano",
    "desc": "A herb with a pungent and slightly bitter taste, commonly used in Mediterranean and Mexican cooking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/t2ar8ldklkbavopxjwci.png"
  },
  {
    "_id": "640c2dd963a319ea671e374e",
    "name": "Red Onions",
    "desc": "A type of onion that has a deep purple skin and a mild, sweet flavor. They are often used in salads, sandwiches, and as a topping for pizza.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564913/wxs4jaenediclggoz9nv.png"
  },
  {
    "_id": "640c2dd963a319ea671e369b",
    "name": "Chilli",
    "desc": "A spicy pepper used to add heat and flavor to dishes, commonly used in Mexican, Indian, and Thai cuisine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/j7vofx2o5ywbs1ux0ens.png"
  },
  {
    "_id": "640c2dd963a319ea671e386e",
    "name": "Mincemeat",
    "desc": "Mincemeat is a mixture of chopped dried fruit, distilled spirits and spices, and sometimes beef suet, beef, or venison. Originally, mincemeat always contained meat. Many modern recipes contain beef suet, though vegetable shortening is sometimes used in its place.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/mssifyljamogc5ppe5bp.png"
  },
  {
    "_id": "640c2dd963a319ea671e3690",
    "name": "Cheese Curds",
    "desc": "Fresh cheese that has not yet been aged. It has a mild, slightly salty flavor and a springy, squeaky texture. It is often used in dishes such as poutine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/ay20ltxpru8gbal30qbz.png"
  },
  {
    "_id": "640c2dd963a319ea671e386a",
    "name": "Grand Marnier",
    "desc": "Grand Marnier is a French brand of liqueurs. The brand's best-known product is Grand Marnier Cordon Rouge, an orange-flavored liqueur created in 1880 by Alexandre Marnier-Lapostolle. It is made from a blend of Cognac brandy, distilled essence of bitter orange, and sugar. Grand Marnier Cordon Rouge is 40% alcohol.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/v5izxvgxn9xoicj9lfs6.png"
  },
  {
    "_id": "640c2dd963a319ea671e36b6",
    "name": "Cubed Feta Cheese",
    "desc": "A salty, tangy cheese that is made from sheep or goat's milk. It is commonly used in Greek cuisine and is often crumbled over salads or used in dips and spreads.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/w11vgd74r1gak5ejtkzk.png"
  },
  {
    "_id": "640c2dd963a319ea671e37ea",
    "name": "Wild Mushrooms",
    "desc": "Wild mushrooms are edible fungi that grow in the wild. They come in many different varieties and can be used in a variety of culinary applications, including soups, stews, sauces, and risottos.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/hzawejtinatw6iiizvg8.png"
  },
  {
    "_id": "640c2dd963a319ea671e369d",
    "name": "Chinese Broccoli",
    "desc": "Also known as Gai Lan, it is a leafy green vegetable commonly used in Chinese cuisine, similar to broccoli but with a slightly bitter taste and thicker stems.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/ytibu35xw6dpq9sw97xr.png"
  },
  {
    "_id": "640c2dd963a319ea671e3666",
    "name": "Balsamic Vinegar",
    "desc": "Balsamic vinegar (Italian: aceto balsamico), occasionally shortened to balsamic, is a very dark, concentrated, and intensely flavoured vinegar originating in Italy, made wholly or partially from grape must. Grape must is freshly crushed grape juice with all the skins, seeds and stems.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564215/p4mrdmt4dvwltvvjincl.png"
  },
  {
    "_id": "640c2dd963a319ea671e3672",
    "name": "Black Pepper",
    "desc": "Black pepper (Piper nigrum) is a flowering vine in the family Piperaceae, cultivated for its fruit, known as a peppercorn, which is usually dried and used as a spice and seasoning. When fresh and fully mature, it is about 5 mm (0.20 in) in diameter and dark red, and contains a single seed, like all drupes. Peppercorns and the ground pepper derived from them may be described simply as pepper, or more precisely as black pepper (cooked and dried unripe fruit), green pepper (dried unripe fruit), or white pepper (ripe fruit seeds).\r\n\r\nBlack pepper is native to present-day Kerala in Southwestern India, and is extensively cultivated there and elsewhere in tropical regions. Vietnam is the world's largest producer and exporter of pepper, producing 34% of the world's crop, as of 2013.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564215/mj1ottbkds56ug62ptkz.png"
  },
  {
    "_id": "640c2dd963a319ea671e365c",
    "name": "Salmon",
    "desc": "Salmon is the common name for several species of ray-finned fish in the family Salmonidae. Other fish in the same family include trout, char, grayling and whitefish. Salmon are native to tributaries of the North Atlantic (genus Salmo) and Pacific Ocean (genus Oncorhynchus). Many species of salmon have been introduced into non-native environments such as the Great Lakes of North America and Patagonia in South America. Salmon are intensively farmed in many parts of the world.\r\n\r\nTypically, salmon are anadromous: they hatch in fresh water, migrate to the ocean, then return to fresh water to reproduce. However, populations of several species are restricted to fresh water through their lives. Folklore has it that the fish return to the exact spot where they hatched to spawn. Tracking studies have shown this to be mostly true. A portion of a returning salmon run may stray and spawn in different freshwater systems; the percent of straying depends on the species of salmon. Homing behavior has been shown to depend on olfactory memory. Salmon date back to the Neogene.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564123/bwzvxyjxozyankmd6ky8.png"
  },
  {
    "_id": "640c2dd963a319ea671e36e7",
    "name": "Ghee",
    "desc": "A type of clarified butter commonly used in South Asian cuisine with a rich, nutty flavor and high smoke point.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/xypea78o5fhd6kg5qgfp.png"
  },
  {
    "_id": "640c2dd963a319ea671e3794",
    "name": "White Wine",
    "desc": "A type of wine made from white grapes, often used in cooking for its acidity and fruity flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/kzfewsf0r62nmtwbczr5.png"
  },
  {
    "_id": "640c2dd963a319ea671e3801",
    "name": "Lamb Kidney",
    "desc": "An organ meat that is commonly used in traditional British dishes such as steak and kidney pie, and is known for its distinct flavor and texture.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/uujry7zg66sq6ehkvkao.png"
  },
  {
    "_id": "640c2dd963a319ea671e3718",
    "name": "Macaroni",
    "desc": "Macaroni is a type of pasta that is typically tubular in shape and has a smooth, cylindrical surface. It is commonly used in pasta dishes such as macaroni and cheese, and can also be used in salads and soups.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564856/xsxflicgmcvekam8roky.png"
  },
  {
    "_id": "640c2dd963a319ea671e37a8",
    "name": "Vermicelli Pasta",
    "desc": "A type of thin, spaghetti-like pasta that is slightly thinner than spaghetti and often used in soups, stir-fries, or salads.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/kmytj4sjlljtorkyjaia.png"
  },
  {
    "_id": "640c2dd963a319ea671e37c5",
    "name": "Sweetcorn",
    "desc": "A type of corn with a higher sugar content, typically eaten as a vegetable and used in a variety of dishes such as salads, soups, and casseroles.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/hzpmbxwgtmfg3v2qerkp.png"
  },
  {
    "_id": "640c2dd963a319ea671e3866",
    "name": "Ras el hanout",
    "desc": "Ras el hanout or rass el hanout (Arabic: راس  raʾs al-ḥānūt, pronounced [rɑʔs ælħɑːnuːt] (About this soundlisten)) is a spice mix found in varying forms in Tunisia, Algeria, and Morocco.[1] It plays a similar role in North African cuisine as garam masala does in Indian cuisine. The name in Arabic means \"head of the shop\" and implies a mixture of the best spices the seller has to offer. Ras el hanout is used in many savory dishes, sometimes rubbed on meat or fish, or stirred into couscous or rice.\r\n\r\nThere is no definitive composition of spices that makes up ras el hanout. Each shop, company, or family may have their own blend. The mixture usually consists of over a dozen spices, in different proportions. Commonly used ingredients include cardamom, cumin, clove, cinnamon, nutmeg, mace, allspice, dry ginger, chili peppers, coriander seed, peppercorn, sweet and hot paprika, fenugreek, and dry turmeric. Some spices may be particular to the region, such as ash berries, chufa, grains of paradise, orris root, monk's pepper, cubebs, dried rosebud, fennel seed or aniseed, galangal, long pepper. Ingredients may be toasted before being ground or pounded in a mortar and mixed together. Some preparations include salt or sugar, but that is generally not the accepted practice. Garlic, saffron, nuts or dry herbs are generally not included, as they are usually added to dishes individually, but some commercial preparations, particularly in Europe and North America, may contain them.\r\n\r\nThe composition of ras el hanout differs somewhat from the Baharat spice mix, but they differ more by the types of dishes they are associated with and by region rather than the ingredients in them. Although used by Berber people, it should not be confused with \"berbere\" spice mix from Ethiopia.\r\n\r\nCertain supposed aphrodisiacs, including the notoriously dangerous \"green metallic beetles\", cantharides, have appeared in many Moroccan prescriptions, but these seem to be irrelevant for flavouring purposes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/jqpk6jcobdalnrg7vo6d.png"
  },
  {
    "_id": "640c2dd963a319ea671e36a0",
    "name": "Chopped Parsley",
    "desc": "Fresh parsley that has been chopped finely, commonly used as a garnish or flavoring in salads, soups, and other dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/upfbs5boacrp0mjmkylp.png"
  },
  {
    "_id": "640c2dd963a319ea671e36d2",
    "name": "Fenugreek",
    "desc": "An herb commonly used in Indian cuisine for its nutty, maple-like flavor. The leaves and seeds can be used in dishes like curries, stews, and chutneys.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/nlbvdscmqb1lhhiz4a1h.png"
  },
  {
    "_id": "640c2dd963a319ea671e3774",
    "name": "Sugar",
    "desc": "A sweet, crystalline substance that is commonly used as a sweetener and preservative in food and drinks. It is made from sugar cane or sugar beets and comes in many different forms, including granulated sugar, brown sugar, and powdered sugar.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564916/kc7zoj5wavmyf6hsc7wj.png"
  },
  {
    "_id": "640c2dd963a319ea671e36e1",
    "name": "Full Fat Yogurt",
    "desc": "A thick, creamy yogurt made from whole milk that has not been skimmed or reduced in fat content. It is higher in calories and fat than low-fat or non-fat yogurt, but has a richer, creamier texture and a more indulgent flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564797/gb0vi9vojc7dxmcmavns.png"
  },
  {
    "_id": "640c2dd963a319ea671e378f",
    "name": "Water",
    "desc": "A transparent, odorless, tasteless liquid that is essential for most forms of life.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/kqcs3gsoxmcu5sn26ief.png"
  },
  {
    "_id": "640c2dd963a319ea671e3799",
    "name": "Yogurt",
    "desc": "A dairy product made by fermenting milk with live bacteria cultures, resulting in a thick, creamy texture and tangy flavor. Often consumed as a snack or used as an ingredient in cooking and baking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/fsasyjxyywrsnuchdsap.png"
  },
  {
    "_id": "640c2dd963a319ea671e379a",
    "name": "Zucchini",
    "desc": "A type of summer squash with a green or yellowish skin and a mild, slightly sweet flavor. Commonly used in salads, soups, and stir-fries, and can also be grilled or roasted as a side dish.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/dhszonf305sulwi2h8dm.png"
  },
  {
    "_id": "640c2dd963a319ea671e3870",
    "name": "Bread Rolls",
    "desc": "A roll is a small, usually round or oblong individual loaf of bread served as a meal accompaniment (eaten plain or with butter) A roll can be served and eaten whole or cut transversely and dressed with filling between the two halves. Rolls are also commonly used to make sandwiches similar to those produced using slices of bread. They are found in most cuisines all over the world. In the Deipnosophistae, the author Athenaeus (c. 170 – c. 230) describes some of the bread, cakes, and pastries available in the Classical world. Among the breads mentioned are griddle cakes, honey-and-oil bread, mushroom-shaped loaves covered in poppy seeds, and the military specialty of rolls baked on a spit.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e3807",
    "name": "Currants",
    "desc": "Small, dark red or black berries with a tart flavor, commonly used in baking, jams and sauces.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/xmel25p74ymtlrprj0ns.png"
  },
  {
    "_id": "640c2dd963a319ea671e3740",
    "name": "Pine Nuts",
    "desc": "Pine nuts are edible seeds that come from certain species of pine trees. They have a sweet and nutty flavor, and are commonly used in Mediterranean and Middle Eastern cuisine as a topping or ingredient in dishes like salads, pasta, and pesto.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/qglzfeeze4niarlchvpy.png"
  },
  {
    "_id": "640c2dd963a319ea671e36a9",
    "name": "Cocoa",
    "desc": "A powder made from roasted and ground cocoa beans, commonly used in baking to add chocolate flavor to desserts.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/kkswaov9adifmmvah1jm.png"
  },
  {
    "_id": "640c2dd963a319ea671e3789",
    "name": "Vegetable Oil",
    "desc": "A type of oil derived from plant sources, such as soybeans, corn, or sunflower seeds, that is commonly used in cooking and baking due to its neutral flavor and high smoke point.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/celpa0q85il98vuy60ud.png"
  },
  {
    "_id": "640c2dd963a319ea671e387b",
    "name": "Sriracha",
    "desc": "Sriracha is a type of hot sauce or chili sauce made from a paste of chili peppers, distilled vinegar, garlic, sugar, and salt.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e3758",
    "name": "Rocket",
    "desc": "Also known as arugula or rucola, it is a leafy green vegetable with a distinctive peppery flavor commonly used in salads and sandwiches.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564913/yhxup98lecajzjz2nlhh.png"
  },
  {
    "_id": "640c2dd963a319ea671e367a",
    "name": "Broccoli",
    "desc": "A nutritious vegetable that is a member of the cabbage family, with small, tight florets and a thick stem, often steamed or boiled and used in salads, stir-fries, and other dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/y0wvn0zwpcahaqk9rgpr.png"
  },
  {
    "_id": "640c2dd963a319ea671e3701",
    "name": "Ice Cream",
    "desc": "A frozen dessert typically made with cream, sugar, and flavorings.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/zcnlowpxznh9nt1bv3a0.png"
  },
  {
    "_id": "640c2dd963a319ea671e3708",
    "name": "Khus Khus",
    "desc": "Also known as poppy seeds, khus khus are tiny seeds that have a nutty flavor and a crunchy texture. They are commonly used as a topping for breads and pastries or in Indian cuisine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564856/w51fcdxcvxwftrgqpfzz.png"
  },
  {
    "_id": "640c2dd963a319ea671e3738",
    "name": "Parsley",
    "desc": "A herb with a mild, slightly bitter flavor, commonly used in Mediterranean and Middle Eastern cooking as a garnish or seasoning.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/z91sebymmjai39blnnpq.png"
  },
  {
    "_id": "640c2dd963a319ea671e37da",
    "name": "Light Brown Soft Sugar",
    "desc": "A soft, moist sugar with a subtle molasses flavor, often used in baking recipes for cakes, cookies, and muffins.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/uru7ml7ibbcy5qwtxkul.png"
  },
  {
    "_id": "640c2dd963a319ea671e3805",
    "name": "Brussels Sprouts",
    "desc": "A vegetable closely related to cabbage and broccoli, characterized by small green leafy buds tightly packed into a round shape.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/offfwmpwa0kq9ekjxmwz.png"
  },
  {
    "_id": "640c2dd963a319ea671e383d",
    "name": "Ground Beef",
    "desc": "Beef that has been ground or minced into small pieces, commonly used in dishes such as hamburgers, meatballs, and tacos.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565033/hxrrb6ndgqxj4yqkeiby.png"
  },
  {
    "_id": "640c2dd963a319ea671e388f",
    "name": "Herring",
    "desc": "Herring are forage fish, mostly belonging to the family Clupeidae. Herring often move in large schools around fishing banks and near the coast, found particularly in shallow, temperate waters of the North Pacific and North Atlantic Oceans, including the Baltic Sea, as well as off the west coast of South America.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565178/hyh2nfev806qm0em9hxj.png"
  },
  {
    "_id": "640c2dd963a319ea671e3702",
    "name": "Italian Fennel Sausages",
    "desc": "Pork sausages flavored with fennel seeds and other herbs and spices, commonly used in Italian cuisine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564856/sb3bxuleqqe2wci821mn.png"
  },
  {
    "_id": "640c2dd963a319ea671e37e7",
    "name": "Courgettes",
    "desc": "Courgettes, also known as zucchini, are a type of summer squash with a mild, slightly sweet flavor. They are commonly used in salads, soups, and other culinary applications.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/zih4cwsgvlder6bvwf5f.png"
  },
  {
    "_id": "640c2dd963a319ea671e383f",
    "name": "Paella Rice",
    "desc": "Paella[a] is a Valencian rice dish that has ancient roots but its modern form originated in the mid-19th century in the area around Albufera lagoon on the east coast of Spain, adjacent to the city of Valencia. Many non-Spaniards view paella as Spain's national dish, but most Spaniards consider it to be a regional Valencian dish. Valencians, in turn, regard paella as one of their identifying symbols.\r\n\r\nTypes of paella include Valencian paella, vegetable paella (Spanish: paella de verduras), seafood paella (Spanish: paella de mariscos), and mixed paella (Spanish: paella mixta), among many others. Valencian paella is believed to be the original recipe and consists of white rice, green beans (bajoqueta and tavella), meat (chicken, duck and rabbit), white beans (garrofón), snails, and seasoning such as saffron and rosemary. Another very common but seasonal ingredient is artichokes. Seafood paella replaces meat with seafood and omits beans and green vegetables. Mixed paella is a free-style combination of meat from land animals, seafood, vegetables, and sometimes beans. Most paella chefs use bomba rice due to it being less likely to overcook, but Valencians tend to use a slightly stickier (and thus more susceptible to overcooking) variety known as Senia. All types of paellas use olive oil.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565048/nqifnokjg6ntqzqqlohm.png"
  },
  {
    "_id": "640c2dd963a319ea671e3851",
    "name": "Gochujang",
    "desc": "Gochujang or red chili paste is a savory, sweet, and spicy fermented condiment made from chili powder, glutinous rice, meju powder, yeotgireum, and salt.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565033/ts7kiv8ybnze5f5boqjo.png"
  },
  {
    "_id": "640c2dd963a319ea671e3892",
    "name": "Sushi Rice",
    "desc": "As the dietary staple of Japan, knowing how to cook Japanese rice is an important first step to becoming a Japanese cooking master. Perfectly prepared Japanese rice should be light, fluffy, and slightly sticky when cooked",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565178/w7pbnvvjkgd4g7hdqnd2.png"
  },
  {
    "_id": "640c2dd963a319ea671e36c7",
    "name": "Egg Rolls",
    "desc": "",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/bbetby3lxkaaxxvqkp7g.png"
  },
  {
    "_id": "640c2dd963a319ea671e37f1",
    "name": "Mixed Grain",
    "desc": "A blend of two or more types of grains such as wheat, barley, oats, and rice that is often used in salads, soups, and stews.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/thgvunqxhiplgoxrj1jc.png"
  },
  {
    "_id": "640c2dd963a319ea671e383a",
    "name": "Salt Cod",
    "desc": "Cod that has been preserved by salting and drying, commonly used in Mediterranean and Latin American cuisine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565048/hzkmxfahnpm3m2vc3orb.png"
  },
  {
    "_id": "640c2dd963a319ea671e3692",
    "name": "Chestnut Mushroom",
    "desc": "A variety of mushroom that has a nutty, earthy flavor and a slightly chewy texture. It is often used in stews, soups, and risottos.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/sjkwrlvkzsufuzm7qbun.png"
  },
  {
    "_id": "640c2dd963a319ea671e374f",
    "name": "Red Pepper",
    "desc": "A sweet and crunchy vegetable that is often used in cooking and is a good source of vitamins A and C. It is also known as a bell pepper or capsicum.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564916/shxhx8z19qqsm3xb52kv.png"
  },
  {
    "_id": "640c2dd963a319ea671e374a",
    "name": "Raw King Prawns",
    "desc": "Large, uncooked prawns that are typically used in dishes such as stir-fries, curries, and soups. They have a firm texture and a slightly sweet flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/ivst1nhcfppsmtkkeqpy.png"
  },
  {
    "_id": "640c2dd963a319ea671e37df",
    "name": "Pumpkin",
    "desc": "A round, orange vegetable with a thick shell and seeds inside. It is often used in cooking and baking for its sweet and earthy flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/jusodg1bstkkzcuo1t3o.png"
  },
  {
    "_id": "640c2dd963a319ea671e3814",
    "name": "Almonds",
    "desc": "A type of nut with a sweet and nutty flavor, commonly used in baking and as a snack.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564980/nqpfaqxbbtgejlliefnm.png"
  },
  {
    "_id": "640c2dd963a319ea671e366a",
    "name": "Bay Leaf",
    "desc": "The bay leaf is an aromatic leaf commonly used in cooking. It can be used whole, or as dried and ground.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564217/lspnygrkvnwbdjhfz0pl.png"
  },
  {
    "_id": "640c2dd963a319ea671e3776",
    "name": "Sunflower Oil",
    "desc": "An oil that is made from sunflower seeds and is commonly used in cooking and baking. It is low in saturated fat and high in vitamin E, and is often used in salad dressings, marinades, and frying.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/wyhetdy5bu3bcblqtfia.png"
  },
  {
    "_id": "640c2dd963a319ea671e37b9",
    "name": "Clams",
    "desc": "Edible bivalve mollusks with two shells, commonly used in seafood dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/qo2je2sqzvvrdv2qvifi.png"
  },
  {
    "_id": "640c2dd963a319ea671e3683",
    "name": "Cardamom",
    "desc": "A spice made from the dried seeds of plants in the ginger family, with a strong, sweet, and pungent flavor that is often used in Indian and Middle Eastern cuisine to add warmth and depth of flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564673/nb4ilvculje9qfye7qtd.png"
  },
  {
    "_id": "640c2dd963a319ea671e368f",
    "name": "Cheese",
    "desc": "A dairy product made from milk that is curdled and then processed into a solid form. It can come in a wide range of flavors and textures depending on the type and aging process.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564673/t67bg1wjr9znushi5bkt.png"
  },
  {
    "_id": "640c2dd963a319ea671e37d2",
    "name": "Dried Apricots",
    "desc": "Apricots that have been dried to preserve them, with a chewy texture and sweet, tangy flavor, commonly used in baked goods, trail mixes, and savory dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/htuouahhwtdav3f6q2ap.png"
  },
  {
    "_id": "640c2dd963a319ea671e37f0",
    "name": "Kidney Beans",
    "desc": "Red or dark red beans that are kidney-shaped and commonly used in various cuisines around the world, especially in Latin American and Caribbean dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/i3vyv7hgfdkur22qitcj.png"
  },
  {
    "_id": "640c2dd963a319ea671e3813",
    "name": "Marzipan",
    "desc": "A sweet paste made from ground almonds and sugar, often used in cakes and pastries for decoration.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/mu5dox4a9auwjv83aeg2.png"
  },
  {
    "_id": "640c2dd963a319ea671e369f",
    "name": "Chopped Onion",
    "desc": "Pieces of onion that have been diced or chopped, commonly used as a flavor base for soups, stews, and other dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564742/vbloj8qjqlezkviowjez.png"
  },
  {
    "_id": "640c2dd963a319ea671e37b6",
    "name": "Sugar Snap Peas",
    "desc": "A type of pea that has edible pods. Sugar snap peas are sweet and crunchy and can be eaten raw or cooked.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564916/cevi0bebwdpqskds9qi8.png"
  },
  {
    "_id": "640c2dd963a319ea671e37ce",
    "name": "Tomato Sauce",
    "desc": "A sauce made from cooked, pureed tomatoes that is used as a base for many Italian and Mediterranean dishes like pasta sauces, pizzas, and stews.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/jjfjubodozhsatpoj7vk.png"
  },
  {
    "_id": "640c2dd963a319ea671e3706",
    "name": "Jerusalem Artichokes",
    "desc": "Also known as sunchokes, Jerusalem artichokes are a type of root vegetable that have a slightly sweet, nutty flavor and a crisp texture when raw.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564856/ppyhvetrcdcexkwcgaj3.png"
  },
  {
    "_id": "640c2dd963a319ea671e36c5",
    "name": "Dry White Wine",
    "desc": "A type of white wine that is not sweet, with most of the grape sugar having been fermented into alcohol. It is often used in cooking to deglaze pans, add flavor to sauces, and to tenderize meats.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564742/zmijjflmuog8vtuuv4a7.png"
  },
  {
    "_id": "640c2dd963a319ea671e388c",
    "name": "Polish Sausage",
    "desc": "Kielbasa is any type of meat sausage from Poland, and a staple of Polish cuisine. In American English the word typically refers to a coarse, U-shaped smoked sausage of any kind of meat, which closely resembles the Wiejska sausage in British English.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565178/bm1sl8582coawkg6y57l.png"
  },
  {
    "_id": "640c2dd963a319ea671e3697",
    "name": "Chicken Thighs",
    "desc": "A cut of chicken meat that comes from the thigh of the bird. It is dark and flavorful, and can be cooked in a variety of ways, such as baking, frying, or grilling.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564673/ohuiefilyqxokyjpbyv0.png"
  },
  {
    "_id": "640c2dd963a319ea671e36cb",
    "name": "Enchilada Sauce",
    "desc": "A spicy tomato-based sauce commonly used in Mexican cuisine for making enchiladas.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/qa5t51d4qsxarqb2bkxx.png"
  },
  {
    "_id": "640c2dd963a319ea671e37ef",
    "name": "Roasted Vegetables",
    "desc": "Assortment of vegetables such as bell peppers, onions, carrots, and zucchini that have been seasoned and roasted in the oven until tender and caramelized.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/pczl2h2vujjyabiwaizp.png"
  },
  {
    "_id": "640c2dd963a319ea671e3808",
    "name": "Custard",
    "desc": "A sweet dessert made with milk, sugar, eggs, and vanilla, thickened with cornstarch or flour.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/cunoluowrmkwrwo5xwfj.png"
  },
  {
    "_id": "640c2dd963a319ea671e36a6",
    "name": "Cinnamon Stick",
    "desc": "A stick made from the inner bark of cinnamon trees, commonly used as a spice in cooking and baking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/sclangxcvopyvhxjaam1.png"
  },
  {
    "_id": "640c2dd963a319ea671e3743",
    "name": "Plain Flour",
    "desc": "A finely ground flour made from wheat that is often used as a basic ingredient in many recipes, including cakes, breads, and pastries.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/rgbrzmkgwzap28petbza.png"
  },
  {
    "_id": "640c2dd963a319ea671e3767",
    "name": "Shredded Monterey Jack Cheese",
    "desc": "Shredded Monterey Jack cheese is a type of cheese that is commonly used in Mexican cuisine. It has a mild flavor and a creamy texture, and melts easily, making it ideal for dishes like nachos, quesadillas, and tacos.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/qtoa2jm6gu4wxposspmr.png"
  },
  {
    "_id": "640c2dd963a319ea671e37c9",
    "name": "Red Wine Vinegar",
    "desc": "A vinegar made from red wine that has a tart and tangy flavor, often used in salad dressings, marinades, and sauces.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564977/dsqszbhatwhazfoi3cw8.png"
  },
  {
    "_id": "640c2dd963a319ea671e378d",
    "name": "Vine Leaves",
    "desc": "The leaves of the grapevine, often used in Mediterranean cuisine as a wrapping for various fillings.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564912/bjbot3urikmddndavqzi.png"
  },
  {
    "_id": "640c2dd963a319ea671e375a",
    "name": "Saffron",
    "desc": "Spice derived from the stigma of the saffron crocus flower, with a pungent flavor and bright yellow-orange color, often used in rice dishes, paella, and bouillabaisse.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564910/vmh7ijvs7nm2r74hxgi7.png"
  },
  {
    "_id": "640c2dd963a319ea671e378a",
    "name": "Vegetable Stock",
    "desc": "A liquid made by simmering vegetables in water with herbs and spices, used as a base for soups, stews, and sauces.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564911/unhwboxyma2hyepvjigq.png"
  },
  {
    "_id": "640c2dd963a319ea671e385b",
    "name": "Smoked Salmon",
    "desc": "Smoked salmon is a preparation of salmon, typically a fillet that has been cured and hot or cold smoked. Due to its moderately high price, smoked salmon is considered a delicacy. Although the term lox is sometimes applied to smoked salmon, they are different products.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565046/ykpfx3diebozi3f2j7nv.png"
  },
  {
    "_id": "640c2dd963a319ea671e373b",
    "name": "Peanuts",
    "desc": "A legume with a thin, papery skin and a high oil content, commonly eaten roasted or boiled as a snack, or used in cooking and baking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564856/ltc7yw8nvydf1bryb262.png"
  },
  {
    "_id": "640c2dd963a319ea671e3832",
    "name": "Frozen Peas",
    "desc": "Peas that have been blanched and frozen to preserve their flavor and texture.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e366c",
    "name": "Beef Brisket",
    "desc": "Beef is the culinary name for meat from cattle, particularly skeletal muscle. Humans have been eating beef since prehistoric times. Beef is a source of high-quality protein and nutrients.\r\n\r\nMost beef skeletal muscle meat can be used as is by merely cutting into certain parts, such as roasts, short ribs or steak (filet mignon, sirloin steak, rump steak, rib steak, rib eye steak, hanger steak, etc.), while other cuts are processed (corned beef or beef jerky). Trimmings, on the other hand, are usually mixed with meat from older, leaner (therefore tougher) cattle, are ground, minced or used in sausages. The blood is used in some varieties called blood sausage. Other parts that are eaten include other muscles and offal, such as the oxtail, liver, tongue, tripe from the reticulum or rumen, glands (particularly the pancreas and thymus, referred to as sweetbread), the heart, the brain (although forbidden where there is a danger of bovine spongiform encephalopathy, BSE, commonly referred to as mad cow disease), the kidneys, and the tender testicles of the bull (known in the United States as calf fries, prairie oysters, or Rocky Mountain oysters). Some intestines are cooked and eaten as is, but are more often cleaned and used as natural sausage casings. The bones are used for making beef stock.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564216/piozjulqxuluu25jrlws.png"
  },
  {
    "_id": "640c2dd963a319ea671e36f4",
    "name": "Green Red Lentils",
    "desc": "A type of lentil with a mild, nutty flavor and a greenish-brown color often used in soups, stews, and curries.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564799/fspumrzs331iyjricvcm.png"
  },
  {
    "_id": "640c2dd963a319ea671e3760",
    "name": "Sausages",
    "desc": "Sausages are a type of seasoned meat that are typically encased in a casing made of animal intestine or synthetic materials. They can be made from various types of meat such as pork, beef, or chicken, and can be flavored with herbs and spices.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564911/zk6lp0rprdsfopkxfejx.png"
  },
  {
    "_id": "640c2dd963a319ea671e381d",
    "name": "Treacle",
    "desc": "A sweet, sticky syrup made from refined sugar, often used as a sweetener in baking and cooking",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564980/hpmlqu0jw3xd2ltpp4im.png"
  },
  {
    "_id": "640c2dd963a319ea671e36eb",
    "name": "Ginger Paste",
    "desc": "A concentrated paste made from ginger often used as a flavoring in cooking and baking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/quxdj11y7kdhnwpo5xyr.png"
  },
  {
    "_id": "640c2dd963a319ea671e372f",
    "name": "Orange",
    "desc": "A citrus fruit with a tough, bright orange rind and juicy, pulpy flesh that can be eaten raw or used in cooking and baking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564856/pe7f650op8xe8dq8kzkf.png"
  },
  {
    "_id": "640c2dd963a319ea671e3852",
    "name": "Bean Sprouts",
    "desc": "Bean sprouts are a common ingredient across the world. They are particularly common in Eastern Asian cuisine.\r\n\r\nThere are two types of common bean sprouts:\r\n\r\nMung bean sprout is made from the greenish-capped mung beans\r\nSoybean sprout is made from yellow, larger-grained soybean\r\nIt typically takes one week for them to become fully grown. The sprouted beans are more nutritious than the original beans and they require much less cooking time.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e36c0",
    "name": "Digestive Biscuits",
    "desc": "A type of biscuit that originated in the United Kingdom. They are made with wholemeal flour and are lightly sweetened, making them a popular choice for use in pie crusts and as a base for cheesecakes and other desserts.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/bo5tts3n5ebbtxlnrxft.png"
  },
  {
    "_id": "640c2dd963a319ea671e3705",
    "name": "Jasmine Rice",
    "desc": "A type of long-grain rice that has a subtle floral aroma and a slightly sticky texture when cooked.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/pokekw5nwoefgotvfvv8.png"
  },
  {
    "_id": "640c2dd963a319ea671e36ea",
    "name": "Ginger Garlic Paste",
    "desc": "A mixture of minced garlic and ginger commonly used as a flavoring in Indian and Southeast Asian cuisine.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564797/jnljoigqebtntywm9gry.png"
  },
  {
    "_id": "640c2dd963a319ea671e36f7",
    "name": "Ground Cumin",
    "desc": "Ground cumin is a spice made from the dried seeds of the cumin plant. It is commonly used in Indian, Middle Eastern, and Mexican cuisine to add a warm, earthy flavor to dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/kqdfezavyuruln45fubm.png"
  },
  {
    "_id": "640c2dd963a319ea671e3818",
    "name": "Yeast",
    "desc": "A type of fungus used as a leavening agent in baking to make dough rise",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/mozxlk4tnriznagzfww2.png"
  },
  {
    "_id": "640c2dd963a319ea671e3828",
    "name": "Unsalted Butter",
    "desc": "Butter made from cream that has been separated from milk and churned, without any added salt",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/n6um1o4paeognjd0sors.png"
  },
  {
    "_id": "640c2dd963a319ea671e371d",
    "name": "Medjool Dates",
    "desc": "A type of large, sweet, and chewy date fruit with a caramel-like flavor, commonly used as a natural sweetener in desserts or as a snack.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/gep5gfvmjzcvnllzfsgu.png"
  },
  {
    "_id": "640c2dd963a319ea671e3695",
    "name": "Chicken Legs",
    "desc": "A cut of chicken meat that comes from the leg of the bird. It is dark and flavorful, and can be cooked in a variety of ways, such as baking, frying, or grilling.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564673/opzwx7yvnk6myntyfzmm.png"
  },
  {
    "_id": "640c2dd963a319ea671e37c6",
    "name": "Goose Fat",
    "desc": "Fat obtained from the rendered meat of a goose, commonly used for frying or roasting potatoes, vegetables, and meats to add flavor and texture.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/pxzp8fykcypernd56ucx.png"
  },
  {
    "_id": "640c2dd963a319ea671e3895",
    "name": "Beetroot",
    "desc": "The beetroot is the taproot portion of a beet plant, usually known in Canada and the USA as beets while the vegetable is referred to as beetroot in British English, and also known as the table beet, garden beet, red beet, dinner beet or golden beet.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565178/xnjeqypnaoqwx5ik4p1k.png"
  },
  {
    "_id": "640c2dd963a319ea671e36b4",
    "name": "Cream",
    "desc": "A dairy product that is made by separating the cream from milk. It is commonly used in cooking and baking to add richness and flavor to dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/rjdu7lmmhyehjjn2qiqd.png"
  },
  {
    "_id": "640c2dd963a319ea671e3744",
    "name": "Plum Tomatoes",
    "desc": "A type of tomato that is oval or cylindrical in shape and has a sweet flavor. They are often used in Italian cuisine, particularly for making sauces.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/uq2yy2uahckbu0oxs5tq.png"
  },
  {
    "_id": "640c2dd963a319ea671e375e",
    "name": "Salt",
    "desc": "Crystalline mineral made of sodium chloride, commonly used as a seasoning and preservative in cooking and food preparation.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564910/a1sigxrvvbfhsrozsshz.png"
  },
  {
    "_id": "640c2dd963a319ea671e36c9",
    "name": "Egg Yolks",
    "desc": "",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/c8w5x3yru2jvywprcy9d.png"
  },
  {
    "_id": "640c2dd963a319ea671e36ed",
    "name": "Gouda Cheese",
    "desc": "A semi-hard cheese originating from the Netherlands with a nutty, buttery flavor and smooth texture.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564798/tkiicijiqqubiy4qt0yf.png"
  },
  {
    "_id": "640c2dd963a319ea671e3766",
    "name": "Shredded Mexican Cheese",
    "desc": "Shredded Mexican cheese is a blend of cheeses that is commonly used in Mexican cuisine. It typically contains a mixture of Cheddar, Monterey Jack, and other cheeses, and is often used in dishes like tacos, burritos, and enchiladas.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564911/v1nzmmrpaoxeouajyjwr.png"
  },
  {
    "_id": "640c2dd963a319ea671e3841",
    "name": "Oxtail",
    "desc": "Oxtail (occasionally spelled ox tail or ox-tail) is the culinary name for the tail of cattle. Formerly, it referred only to the tail of an ox or steer, a bullock (a castrated male).[citation needed] An oxtail typically weighs 2 to 4 lbs. (1–1.8 kg) and is skinned and cut into short lengths for sale.\r\n\r\nOxtail is a bony, gelatin-rich meat, which is usually slow-cooked as a stew[1] or braised. It is a traditional stock base for a soup. Traditional preparations involve slow cooking, so some modern recipes take a shortcut using a pressure cooker. Oxtail is the main ingredient of the Italian dish coda alla vaccinara (a classic of Roman cuisine). It is a popular flavour for powder, instant and premade canned soups in the United Kingdom and Ireland. Oxtails are also one of the popular bases for Russian aspic appetizer dishes (холодец or студень), along with pig trotters or ears or cow \"knees\", but are the preferred ingredients among Russian Jews because they can be Kosher.\r\n\r\nVersions of oxtail soup are popular traditional dishes in South America, West Africa, China, Spain [2] and Indonesia. In Chinese cuisine, it's usually made into a soup called 牛尾汤 (niúwěi tāng, \"oxtail soup\"). In Korean cuisine, a soup made with oxtail is called kkori gomtang (see gomguk). It is a thick soup seasoned with salt and eaten with a bowl of rice. It can be used as a stock for making tteokguk (rice cake soup). Stewed oxtail with butter bean or as main dish (with rice) is popular in Jamaica, Trinidad, and other West Indian cultures. Oxtail is also very popular in South Africa where it is often cooked in a traditional skillet called a potjie, which is a three-legged cast iron pot placed over an open fire. Oxtail is also eaten in other southern parts of Africa like Zimbabwe and served with sadza and greens. In the United States, oxtail is a mainstay in African American and West Indian households. In Cuban cuisine, a stew can be made from oxtail called rabo encendido. In the Philippines, it is prepared in a peanut based stew called Kare-kare. In Iran, Oxtail is slow-cooked and served as a substitute for shank in a main dish called Baghla-Poli-Mahicheh which is prepared with rice, shank (or oxtail) and a mixture of herbs including dill, coriander, parsley and garlic.\r\n\r\nIn the United States, oxtail has the meat-cutting classification NAMP 1791.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e3746",
    "name": "Potatoes",
    "desc": "A starchy root vegetable that is commonly used in cooking and is a good source of carbohydrates, fiber, and vitamins.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/dxeipz28barkkn55fj7y.png"
  },
  {
    "_id": "640c2dd963a319ea671e376c",
    "name": "Soy Sauce",
    "desc": "A sauce made from soybeans, roasted grain, water, and salt. It is commonly used as a condiment and flavoring in Asian cuisine, and is often used to season stir-fries, marinades, and dipping sauces.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564912/cdl2qoodjptifqk9mvwo.png"
  },
  {
    "_id": "640c2dd963a319ea671e3712",
    "name": "Lemon Juice",
    "desc": "Lemon juice is the acidic liquid obtained from squeezing or pressing fresh lemons. It is commonly used as a flavoring agent in cooking, baking, and beverages.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/jg7uomxhmxkhh1pcsdsq.png"
  },
  {
    "_id": "640c2dd963a319ea671e3812",
    "name": "Apricot Jam",
    "desc": "A sweet spread made from apricots, often used on toast, pastries, and in baking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564980/mwhta2tkh7twxpqh3eaz.png"
  },
  {
    "_id": "640c2dd963a319ea671e385c",
    "name": "Mars Bar",
    "desc": "Mars is a variety of chocolate bar produced by Mars, Incorporated. It was first manufactured in 1932 in Slough, England by Forrest Mars, Sr. The bar was sold in two different formulations. In its original British version the bar consists of milk chocolate surrounding caramel and nougat, developed to resemble the American candy bar known as the Milky Way, which had been introduced a decade earlier. An American version of the Mars Bar was produced which had nougat and toasted almonds covered in milk chocolate; later, caramel was added to the recipe as well. The American version was discontinued in 2002, though it has been revived for short runs since then.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565046/dedwv2uvysgd7tyalha1.png"
  },
  {
    "_id": "640c2dd963a319ea671e3802",
    "name": "Beef Kidney",
    "desc": "An organ meat that is commonly used in traditional dishes, particularly in stews and pies, and is known for its rich flavor and texture.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/ofnwoxyampbawcjiqgqs.png"
  },
  {
    "_id": "640c2dd963a319ea671e383c",
    "name": "Jerk",
    "desc": "A style of cooking that originated in Jamaica, and involves marinating meat in a mixture of spices and then grilling or smoking it over a fire.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e36c8",
    "name": "Egg White",
    "desc": "",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/czf0qn5sybjnzs6m922a.png"
  },
  {
    "_id": "640c2dd963a319ea671e3815",
    "name": "Black Pudding",
    "desc": "A type of sausage made from pork blood, suet, and oatmeal, often served as part of a traditional English breakfast.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564977/dxszrii523wh0c68j2rn.png"
  },
  {
    "_id": "640c2dd963a319ea671e37ad",
    "name": "Black Olives",
    "desc": "Ripe olives that have turned black, with a meaty texture and a rich, salty flavor, often used in Mediterranean cuisine or as a topping for pizza or salads.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564916/ccduv3nfi073gxlocfqk.png"
  },
  {
    "_id": "640c2dd963a319ea671e36a1",
    "name": "Chopped Tomatoes",
    "desc": "Tomatoes that have been chopped into small pieces, commonly used as a base for sauces, soups, and stews.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564744/ejcjvvuumqa5pbusitc9.png"
  },
  {
    "_id": "640c2dd963a319ea671e3710",
    "name": "Leek",
    "desc": "A type of allium vegetable that is related to onions and garlic. Leeks have a mild, sweet flavor and can be eaten raw or cooked in a variety of dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564855/yremuumuwyvmelrjaban.png"
  },
  {
    "_id": "640c2dd963a319ea671e375f",
    "name": "Salted Butter",
    "desc": "Butter that has been mixed with salt, commonly used in cooking and baking to add flavor and richness to dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/uvnfagodu6ic44es0tjn.png"
  },
  {
    "_id": "640c2dd963a319ea671e37d1",
    "name": "Ricotta",
    "desc": "A soft, creamy Italian cheese with a mild, slightly sweet flavor and grainy texture, often used in Italian dishes like lasagna, ravioli, and cannoli.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/ln9xswcxp46n2ckibxkr.png"
  },
  {
    "_id": "640c2dd963a319ea671e3837",
    "name": "Tabasco Sauce",
    "desc": "A spicy hot sauce made from tabasco peppers, vinegar, and salt, commonly used as a condiment or ingredient in various dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565048/dpxcywakk1hcym255ayb.png"
  },
  {
    "_id": "640c2dd963a319ea671e3684",
    "name": "Carrots",
    "desc": "A root vegetable that is commonly used in cooking and baking, with a sweet and earthy flavor, and high in vitamin A and other nutrients.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564673/aoyitr2lgxl65uxtt3dn.png"
  },
  {
    "_id": "640c2dd963a319ea671e3764",
    "name": "Sesame Seed",
    "desc": "Sesame seeds are small, flat seeds that come from the sesame plant. They are commonly used in cooking and baking, and are known for their nutty flavor and crunchy texture.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/mlha7h546kk06bonenzr.png"
  },
  {
    "_id": "640c2dd963a319ea671e367c",
    "name": "Brown Rice",
    "desc": "A type of rice that has been minimally processed to remove the outermost layer of the grain, resulting in a nutty flavor and a chewy texture that is often used in pilafs, salads, and other dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/nq8x08gxr3f82y2htjcu.png"
  },
  {
    "_id": "640c2dd963a319ea671e3881",
    "name": "Sesame Seed Burger Buns",
    "desc": "A bun is a small, sometimes sweet, bread-based item or roll. Though they come in many shapes and sizes, they are most commonly hand-sized or smaller, with a round top and flat bottom. Buns are usually made from flour, sugar, milk, yeast and butter.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565055/hofbiujl5fjwtvi5mbzf.png"
  },
  {
    "_id": "640c2dd963a319ea671e3893",
    "name": "Figs",
    "desc": "Ficus carica is an Asian species of flowering plant in the mulberry family, known as the common fig. It is the source of the fruit also called the fig and as such is an important crop in those areas where it is grown commercially.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565178/yepjoexbqnbgk6lduvug.png"
  },
  {
    "_id": "640c2dd963a319ea671e3685",
    "name": "Cashew Nuts",
    "desc": "A type of nut that is often used in cooking and snacking, with a mild, buttery flavor and a creamy texture when roasted or ground into a paste.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564673/ydjcibhzolxc4v44uxbu.png"
  },
  {
    "_id": "640c2dd963a319ea671e37cc",
    "name": "Butter Beans",
    "desc": "Large, creamy white beans with a buttery texture and mild, nutty flavor, often used in soups, stews, and salads.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/o7ikjqwvug3nvnsxhqkw.png"
  },
  {
    "_id": "640c2dd963a319ea671e37f7",
    "name": "Mirin",
    "desc": "A type of sweet rice wine that is commonly used in Japanese cuisine for its mild sweetness and ability to balance flavors in dishes like teriyaki sauce.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564977/oc9tjbgyz6jin5vadvqh.png"
  },
  {
    "_id": "640c2dd963a319ea671e387c",
    "name": "Rhubarb",
    "desc": "Rhubarb is a general term used for the cultivated plants in the genus Rheum in the family Polygonaceae. It is a herbaceous perennial growing from short, thick rhizomes. Historically, different plants have been called \"rhubarb\" in English.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/ibihqjyb5jxjzcyzjkal.png"
  },
  {
    "_id": "640c2dd963a319ea671e371c",
    "name": "Massaman Curry Paste",
    "desc": "Massaman curry paste is a blend of spices commonly used in Thai cuisine, particularly in dishes from the southern region of Thailand. It typically includes ingredients such as cinnamon, cardamom, cloves, and chili peppers, and is often used as a marinade or seasoning for meat, fish, or vegetables.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564856/kakcxcowmcbxfvp31zhu.png"
  },
  {
    "_id": "640c2dd963a319ea671e3751",
    "name": "Red Wine",
    "desc": "Alcoholic beverage made from fermented grapes or other fruits with a red color derived from the skins of dark-colored grapes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/s45rfvnb0mldkys35piw.png"
  },
  {
    "_id": "640c2dd963a319ea671e3792",
    "name": "White Fish Fillets",
    "desc": "The boneless and skinless cuts of white fish used in cooking for their mild flavor and versatility.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564913/yhr3ej51zby0lvddil5r.png"
  },
  {
    "_id": "640c2dd963a319ea671e37fc",
    "name": "Swede",
    "desc": "A root vegetable that is also known as rutabaga or yellow turnip, and is often used in stews and soups, as well as mashed as a side dish.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/wkxklgifzevtezecrfk5.png"
  },
  {
    "_id": "640c2dd963a319ea671e3759",
    "name": "Rolled Oats",
    "desc": "Whole oat groats that have been steamed and flattened with large rollers to create flakes that are often used in oatmeal, granola, and baked goods.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/sswzhvcukashhzlwp06u.png"
  },
  {
    "_id": "640c2dd963a319ea671e37b7",
    "name": "Crusty Bread",
    "desc": "Bread that has a hard crust and a soft, chewy interior. Crusty bread is often used for sandwiches or served with soups and stews.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/rvfg6z19k54pyjcwzwek.png"
  },
  {
    "_id": "640c2dd963a319ea671e3800",
    "name": "Lard",
    "desc": "Rendered pork fat that is often used in cooking and baking for added flavor and texture.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564979/sh1r8gqucfuuyfpnsaof.png"
  },
  {
    "_id": "640c2dd963a319ea671e381c",
    "name": "Glace Cherry",
    "desc": "A candied cherry that has been preserved in sugar syrup and used in baking and decorating desserts",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564978/jqb7irkdfti1nmba002h.png"
  },
  {
    "_id": "640c2dd963a319ea671e36af",
    "name": "Coriander",
    "desc": "A herb commonly used in cooking that has a citrusy, slightly sweet flavor. It is also known as cilantro in some countries.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/ybqo2oyi4c8ph6moh50o.png"
  },
  {
    "_id": "640c2dd963a319ea671e371e",
    "name": "Meringue Nests",
    "desc": "Small, delicate, and crispy shells made of egg whites and sugar, commonly used as a base for fruit or cream toppings in desserts.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/biry6epeaztjzmfpn2ip.png"
  },
  {
    "_id": "640c2dd963a319ea671e3859",
    "name": "Muffins",
    "desc": "A muffin is an individual-sized, baked product. It can refer to two distinct items, a part-raised flatbread and a cupcake-like quickbread. The flatbread is of British or European derivation, and dates from at least the early 18th century, while the quickbread originated in North America during the 19th century. Both are common worldwide today.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/yokokdxdmljeatin7g0z.png"
  },
  {
    "_id": "640c2dd963a319ea671e3675",
    "name": "Bowtie Pasta",
    "desc": "A type of pasta with a distinctive bowtie or butterfly shape that is often used in pasta salads and other cold dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564217/sv5vhl5fpnitfl5kpgpj.png"
  },
  {
    "_id": "640c2dd963a319ea671e37ae",
    "name": "Onion",
    "desc": "A bulb-shaped vegetable with multiple layers of papery skin and a pungent, sweet flavor, often used as a base for soups, stews, and sauces or caramelized as a topping for pizza or sandwiches.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/zh0gaow8d90isucakkau.png"
  },
  {
    "_id": "640c2dd963a319ea671e385f",
    "name": "Almond Milk",
    "desc": "A plant-based milk alternative made from ground almonds and water, often used as a dairy-free substitute for milk in cooking and baking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565046/rvivd5rwnq4gmby4r4ii.png"
  },
  {
    "_id": "640c2dd963a319ea671e3862",
    "name": "Tripe",
    "desc": "Tripe is a type of edible lining from the stomachs of various farm animals. Most tripe is from cattle and sheep.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565046/uu3coeqsxrpyomg8fqfp.png"
  },
  {
    "_id": "640c2dd963a319ea671e36b2",
    "name": "Corn Tortillas",
    "desc": "A type of flatbread made from cornmeal that is commonly used in Mexican cuisine. They are gluten-free and can be used to make tacos, enchiladas, and other dishes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/mojwazuinyg3fonpkchb.png"
  },
  {
    "_id": "640c2dd963a319ea671e3887",
    "name": "Warm Water",
    "desc": "Water is an inorganic, transparent, tasteless, odorless, and nearly colorless chemical substance, which is the main constituent of Earth's hydrosphere and the fluids of most living organisms. It is vital for all known forms of life, even though it provides no calories or organic nutrients. Its chemical formula is H2O, meaning that each of its molecules contains one oxygen and two hydrogen atoms, connected by covalent bonds. Water is the name of the liquid state of H2O at standard ambient temperature and pressure. It forms precipitation in the form of rain and aerosols in the form of fog. Clouds are formed from suspended droplets of water and ice, its solid state. When finely divided, crystalline ice may precipitate in the form of snow. The gaseous state of water is steam or water vapor. Water moves continually through the water cycle of evaporation, transpiration (evapotranspiration), condensation, precipitation, and runoff, usually reaching the sea.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/tayrbkumlu3iyyryi1vb.png"
  },
  {
    "_id": "640c2dd963a319ea671e36ca",
    "name": "Eggs",
    "desc": "A reproductive cell laid by female animals, often used in baking and cooking as a binding agent or to add texture and flavor",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564742/iaphxkd4vqyfn7xixnqw.png"
  },
  {
    "_id": "640c2dd963a319ea671e376b",
    "name": "Sour Cream",
    "desc": "A dairy product that is made by fermenting regular cream with certain kinds of lactic acid bacteria. It has a tangy, creamy flavor and is commonly used as a topping for dishes like baked potatoes, tacos, and chili.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564911/zb1sbj7ksgwzxgigrmsw.png"
  },
  {
    "_id": "640c2dd963a319ea671e36be",
    "name": "Demerara Sugar",
    "desc": "A type of raw cane sugar that is minimally processed and has large, golden crystals. It has a subtle molasses flavor and is often used as a sweetener in coffee and tea, as well as in baking and cooking.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/jsu3pfs7qvyztaqiv1y5.png"
  },
  {
    "_id": "640c2dd963a319ea671e372e",
    "name": "Onions",
    "desc": "A bulb vegetable with layers of flesh covered by a paper-like skin, used in cooking for its flavor and texture.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/v68e3x3qklciznrsbjij.png"
  },
  {
    "_id": "640c2dd963a319ea671e3886",
    "name": "Shortening",
    "desc": "Shortening is any fat that is a solid at room temperature and used to make crumbly pastry and other food products. Although butter is solid at room temperature and is frequently used in making pastry, the term \"shortening\" seldom refers to butter, but is more closely related to margarine.",
    "img": ""
  },
  {
    "_id": "640c2dd963a319ea671e368b",
    "name": "Celery Salt",
    "desc": "A seasoning made from ground celery seeds and salt, often used as a flavoring for snacks, seasonings, and condiments, such as Bloody Mary cocktails, pickles, and potato chips.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/bcgredpmdd787z5k7tpy.png"
  },
  {
    "_id": "640c2dd963a319ea671e3698",
    "name": "Chickpeas",
    "desc": "Small, round legumes with a nutty flavor and creamy texture. They are often used in Mediterranean and Middle Eastern dishes, such as hummus and falafel.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564674/ko2hkbmudyrmehzqfvgu.png"
  },
  {
    "_id": "640c2dd963a319ea671e37a1",
    "name": "Tagliatelle",
    "desc": "A type of pasta that is long and ribbon-shaped, similar to fettuccine but narrower in width.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/rogy4sinbaemykddad3i.png"
  },
  {
    "_id": "640c2dd963a319ea671e36bc",
    "name": "Dark Soft Brown Sugar",
    "desc": "Similar to dark brown sugar, but with a higher moisture content and softer texture. It is also rich in molasses and has a deep, complex flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564743/bonybfriap3cqkrpzwa5.png"
  },
  {
    "_id": "640c2dd963a319ea671e3716",
    "name": "Lime",
    "desc": "Limes are a citrus fruit that are typically green in color and have a tart, acidic flavor. They are commonly used as a flavoring agent in cooking, baking, and beverages, and are also a source of vitamin C.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564856/cixn8wpauoznb6cpnqv7.png"
  },
  {
    "_id": "640c2dd963a319ea671e376a",
    "name": "Smoky Paprika",
    "desc": "Smoky paprika is another name for smoked paprika, which is a type of paprika that has been smoked over wood to give it a smoky flavor. It is commonly used in Spanish and Mexican cuisine, and can be used to add flavor to meats, stews, and soups.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564910/ewmiepbvu3g2rmultrdx.png"
  },
  {
    "_id": "640c2dd963a319ea671e3777",
    "name": "Tamarind Ball",
    "desc": "A sweet and sour fruit that comes in a compressed ball shape, commonly used in South Asian and Southeast Asian cuisines for its tangy flavor.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564915/qxpqkxoutwjlputvjcl5.png"
  },
  {
    "_id": "640c2dd963a319ea671e386c",
    "name": "Rose water",
    "desc": "Rose water is a flavoured water made by steeping rose petals in water. Additionally, it is the hydrosol portion of the distillate of rose petals, a by-product of the production of rose oil for use in perfume. It is used to flavour food, as a component in some cosmetic and medical preparations, and for religious purposes throughout Europe and Asia.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678565047/norjbmlgofrt5ufmd94t.png"
  },
  {
    "_id": "640c2dd963a319ea671e3721",
    "name": "Miniature Marshmallows",
    "desc": "Small, soft, and pillowy confectionery items that are typically made from sugar, water, and gelatin, and are often used as a topping for hot chocolate, desserts, and cakes.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564854/bzpjjqdaqwrg2txk6vlx.png"
  },
  {
    "_id": "640c2dd963a319ea671e37a5",
    "name": "Mussels",
    "desc": "A type of shellfish with a black, shiny shell and soft, orange flesh, often steamed or boiled and served with garlic butter or white wine sauce.",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564914/tr8tpaotkk418tidiqt5.png"
  },
  {
    "_id": "640c2dd963a319ea671e381b",
    "name": "Cherry",
    "desc": "A small, red fruit with a stone in the center, commonly used in baking and cooking",
    "img": "https://res.cloudinary.com/ddbvbv5sp/image/upload/v1678564977/c2ynyvbkfkn4mj6bklul.png"
  }
]
