{
  "page": 1,
  "perPage": 6,
  "totalPages": 48,
  "results": [
    {
      "_id": "6462a8f74c3d0ddd28897fc1",
      "title": "Chocolate Gateau",
      "category": "Dessert",
      "area": "French",
      "instructions": "Preheat the oven to 180°C/350°F/Gas Mark 4. Grease and line the base of an 8 in round spring form cake tin with baking parchment\r\nBreak the chocolate into a heatproof bowl and place over a saucepan of gently simmering water and stir until it melts. (or melt in the microwave for 2-3 mins stirring occasionally)\r\nPlace the butter and sugar in a mixing bowl and cream together with a wooden spoon until light and fluffy. Gradually beat in the eggs, adding a little flour if the mixture begins to curdle. Fold in the remaining flour with the cooled, melted chocolate and milk. Mix until smooth.\r\nSpread the mixture into the cake tin and bake for 50-55 mins or until firm in the centre and a skewer comes out cleanly. Cool for 10 minutes, then turn out and cool completely.",
      "description": "A French dessert consisting of layers of chocolate sponge cake and chocolate ganache, typically topped with chocolate glaze and chocolate decorations.",
      "thumb": "https://www.themealdb.com/images/media/meals/tqtywx1468317395.jpg",
      "preview": "https://www.themealdb.com/images/media/meals/tqtywx1468317395.jpg",
      "time": "75",
      "youtube": "https://www.youtube.com/watch?v=dsJtgmAhFF4",
      "tags": ["Cake", "Chocolate", "Desert", "Pudding"],
      "ingredients": [
        { "id": "640c2dd963a319ea671e3742", "measure": "250g" },
        { "id": "640c2dd963a319ea671e367e", "measure": "175g" },
        { "id": "640c2dd963a319ea671e371f", "measure": "2 tablespoons" },
        { "id": "640c2dd963a319ea671e36ca", "measure": "5" },
        { "id": "640c2dd963a319ea671e36ee", "measure": "175g" },
        { "id": "640c2dd963a319ea671e36d7", "measure": "125g" }
      ],
      "rating": 4.93
    },
    {
      "_id": "6462a8f74c3d0ddd28897fbc",
      "title": "Irish stew",
      "category": "Beef",
      "area": "Irish",
      "instructions": "Heat the oven to 180C/350F/gas mark 4. Drain and rinse the soaked wheat, put it in a medium pan with lots of water, bring to a boil and simmer for an hour, until cooked. Drain and set aside.\r\n\r\nSeason the lamb with a teaspoon of salt and some black pepper. Put one tablespoon of oil in a large, deep sauté pan for which you have a lid; place on a medium-high heat. Add some of the lamb – don't overcrowd the pan – and sear for four minutes on all sides. Transfer to a bowl, and repeat with the remaining lamb, adding oil as needed.\r\n\r\nLower the heat to medium and add a tablespoon of oil to the pan. Add the shallots and fry for four minutes, until caramelised. Tip these into the lamb bowl, and repeat with the remaining vegetables until they are all nice and brown, adding more oil as you need it.\r\n\r\nOnce all the vegetables are seared and removed from the pan, add the wine along with the sugar, herbs, a teaspoon of salt and a good grind of black pepper. Boil on a high heat for about three minutes.\r\n\r\nTip the lamb, vegetables and whole wheat back into the pot, and add the stock. Cover and boil for five minutes, then transfer to the oven for an hour and a half.\r\n\r\nRemove the stew from the oven and check the liquid; if there is a lot, remove the lid and boil for a few minutes.",
      "description": "A traditional Irish dish made with lamb, potatoes, carrots, onions, and herbs, cooked in a broth or gravy.",
      "thumb": "https://www.themealdb.com/images/media/meals/sxxpst1468569714.jpg",
      "preview": "https://www.themealdb.com/images/media/meals/sxxpst1468569714.jpg",
      "time": "160",
      "youtube": "https://www.youtube.com/watch?v=kYH2qJXnSMo",
      "tags": ["Stew", "Meat"],
      "ingredients": [
        { "id": "640c2dd963a319ea671e3796", "measure": "300g soaked overnight in water" },
        { "id": "640c2dd963a319ea671e370c", "measure": "2kg cut into 3cm cubes" },
        { "id": "640c2dd963a319ea671e372c", "measure": "120ml" },
        { "id": "640c2dd963a319ea671e3765", "measure": "24 Skinned" },
        { "id": "640c2dd963a319ea671e3684", "measure": "4 large" },
        { "id": "640c2dd963a319ea671e3784", "measure": "2" },
        { "id": "640c2dd963a319ea671e3689", "measure": "1" },
        { "id": "640c2dd963a319ea671e368d", "measure": "350g" },
        { "id": "640c2dd963a319ea671e3794", "measure": "150ml" },
        { "id": "640c2dd963a319ea671e3687", "measure": "1 tsp" },
        { "id": "640c2dd963a319ea671e36de", "measure": "4 sprigs" },
        { "id": "640c2dd963a319ea671e3731", "measure": "4 sprigs" },
        { "id": "640c2dd963a319ea671e3696", "measure": "450ml" }
      ],
      "rating": 4.71
    },
    {
      "_id": "6462a8f74c3d0ddd28897fb9",
      "title": "Lamb tomato and sweet spices",
      "category": "Lamb",
      "area": "Moroccan",
      "instructions": "Use pickled vine leaves here, preserved in brine. Small delicate leaves are better than the large bristly ones but, if only large leaves are to hand, then trim them to roughly 12 by 12 cms so that you don't get too many layers of leaves around the filling. And remove any stalks. Drain the preserved leaves, immerse them in boiling water for 10 minutes and then leave to dry on a tea towel before use. \r\nBasmati rice with butter and pine nuts is an ideal accompaniment. Couscous is great, too. Serves four.\r\nFirst make the filling. Put all the ingredients, apart from the tomatoes, in a bowl. Cut the tomatoes in half, coarsely grate into the bowl and discard the skins. Add half a teaspoon of salt and some black pepper, and stir. Leave on the side, or in the fridge, for up to a day. Before using, gently squeeze with your hands and drain away any juices that come out.\r\nTo make the sauce, heat the oil in a medium pan. Add the ginger and garlic, cook for a minute or two, taking care not to burn them, then add the tomato, lemon juice and sugar. Season, and simmer for 20 minutes.\r\nWhile the sauce is bubbling away, prepare the vine leaves. Use any torn or broken leaves to line the base of a wide, heavy saucepan. Trim any leaves from the fennel, cut it vertically into 0.5cm-thick slices and spread over the base of the pan to cover completely.\r\nLay a prepared vine leaf (see intro) on a work surface, veiny side up. Put two teaspoons of filling at the base of the leaf in a 2cm-long by 1cm-wide strip. Fold the sides of the leaf over the filling, then roll it tightly from bottom to top, in a cigar shape. Place in the pan, seam down, and repeat with the remaining leaves, placing them tightly next to each other in lines or circles (in two layers if necessary).\r\nPour the sauce over the leaves (and, if needed, add water just to cover). Place a plate on top, to weigh the leaves down, then cover with a lid. Bring to a boil, reduce the heat and cook on a bare simmer for 70 minutes. Most of the liquid should evaporate. Remove from the heat, and leave to cool a little - they are best served warm. When serving, bring to the table in the pan - it looks great. Serve a few vine leaves and fennel slices with warm rice. Spoon the braising juices on top and garnish with coriander.",
      "description": "A Moroccan-inspired dish made with lamb, tomatoes, onions, and spices (such as cinnamon, ginger, and cumin), typically served with couscous or bread.",
      "thumb": "https://www.themealdb.com/images/media/meals/qtwtss1468572261.jpg",
      "preview": "https://www.themealdb.com/images/media/meals/qtwtss1468572261.jpg",
      "time": "90",
      "youtube": "https://www.youtube.com/watch?v=vaZb1MnFBgA",
      "tags": [""],
      "ingredients": [
        { "id": "640c2dd963a319ea671e372c", "measure": "2 tbsp" },
        { "id": "640c2dd963a319ea671e36e8", "measure": "4cm piece finely chopped" },
        { "id": "640c2dd963a319ea671e36e3", "measure": "2 cloves peeled and chopped" },
        { "id": "640c2dd963a319ea671e377f", "measure": "800g peeled and chopped " },
        { "id": "640c2dd963a319ea671e3712", "measure": "2 tbsp" },
        { "id": "640c2dd963a319ea671e3687", "measure": "1 tsp" },
        { "id": "640c2dd963a319ea671e378d", "measure": "50" },
        { "id": "640c2dd963a319ea671e36d0", "measure": "1 large" },
        { "id": "640c2dd963a319ea671e370d", "measure": "400g" },
        { "id": "640c2dd963a319ea671e37ae", "measure": "1 medium" },
        { "id": "640c2dd963a319ea671e3669", "measure": "2 tbsp" },
        { "id": "640c2dd963a319ea671e36a0", "measure": "2 tbsp" },
        { "id": "640c2dd963a319ea671e36af", "measure": "2 tbsp chopped" },
        { "id": "640c2dd963a319ea671e36a5", "measure": "½ tsp ground " }
      ],
      "rating": 3.98
    },
    {
      "_id": "6462a8f74c3d0ddd28897fdf",
      "title": "Lamb Rogan josh",
      "category": "Lamb",
      "area": "Indian",
      "instructions": "\r\nPut the onions in a food processor and whizz until very finely chopped. Heat the oil in a large heavy-based pan, then fry the onion with the lid on, stirring every now and then, until it is really golden and soft. Add the garlic and ginger, then fry for 5 mins more.\r\nTip the curry paste, all the spices and the bay leaves into the pan, with the tomato purée. Stir well over the heat for about 30 secs, then add the meat and 300ml water. Stir to mix, turn down the heat, then add the yogurt.\r\nCover the pan, then gently simmer for 40-60 mins until the meat is tender and the sauce nice and thick. Serve scattered with coriander, with plain basmati or pilau rice.",
      "description": "A spicy lamb dish from Kashmiri cuisine, flavored with a blend of aromatic spices and yogurt.",
      "thumb": "https://www.themealdb.com/images/media/meals/vvstvq1487342592.jpg",
      "preview": "https://www.themealdb.com/images/media/meals/vvstvq1487342592.jpg",
      "time": "90",
      "youtube": "https://www.youtube.com/watch?v=NZVo32n7iS8",
      "tags": ["Curry", "Spicy", "Alcoholic"],
      "ingredients": [
        { "id": "640c2dd963a319ea671e37ae", "measure": "2 quartered" },
        { "id": "640c2dd963a319ea671e3776", "measure": "4 tbsp" },
        { "id": "640c2dd963a319ea671e36e3", "measure": "4 cloves" },
        { "id": "640c2dd963a319ea671e36e8", "measure": "Thumb sized peeled and very finely grated" },
        { "id": "640c2dd963a319ea671e371a", "measure": "2 tbsp" },
        { "id": "640c2dd963a319ea671e3733", "measure": "2 tsp" },
        { "id": "640c2dd963a319ea671e36a6", "measure": "1" },
        { "id": "640c2dd963a319ea671e3683", "measure": "6 bashed to break shells" },
        { "id": "640c2dd963a319ea671e366a", "measure": "2" },
        { "id": "640c2dd963a319ea671e370b", "measure": "1kg cubed" },
        { "id": "640c2dd963a319ea671e36f0", "measure": "150ml" },
        { "id": "640c2dd963a319ea671e36af", "measure": "Garnish chopped " }
      ],
      "rating": 4
    },
    {
      "_id": "6462a8f74c3d0ddd28897fc2",
      "title": "Fish pie",
      "category": "Seafood",
      "area": "British",
      "instructions": "01.Put the potatoes in a large pan of cold salted water and bring to the boil. Lower the heat, cover, then simmer gently for 15 minutes until tender. Drain, then return to the pan over a low heat for 30 seconds to drive off any excess water. Mash with 1 tbsp olive oil, then season.\r\n02.Meanwhile put the milk in a large sauté pan, add the fish and bring to the boil. Remove from the heat, cover and stand for 3 minutes. Remove the fish (reserving the milk) and pat dry with kitchen paper, then gently flake into an ovenproof dish, discarding the skin and any bones.\r\n03.Heat the remaining oil in a pan, stir in the flour and cook for 30 seconds. Gradually stir in 200-250ml of the reserved milk (discard the rest). Grate in nutmeg, season, then bubble until thick. Stir in the cream.\r\n04.Preheat the oven to 190°C/fan170°C/gas 5. Grate the artichokes and add to the dish with the leek, prawns and herbs. Stir the lemon zest and juice into the sauce, then pour over. Mix gently with a wooden spoon.\r\n05.Spoon the mash onto the fish mixture, then use a fork to make peaks, which will crisp and brown as it cooks. Sprinkle over the cheese, then bake for 35-40 minutes until golden and bubbling. Serve with wilted greens.",
      "description": "A traditional British dish made with flaky fish, creamy sauce, and mashed potatoes.",
      "thumb": "https://www.themealdb.com/images/media/meals/ysxwuq1487323065.jpg",
      "preview": "https://www.themealdb.com/images/media/meals/ysxwuq1487323065.jpg",
      "time": "75",
      "youtube": "https://www.youtube.com/watch?v=2sX4fCgg-UI",
      "tags": ["Fish", "Pie", "Breakfast", "Baking"],
      "ingredients": [
        { "id": "640c2dd963a319ea671e36d9", "measure": "900g" },
        { "id": "640c2dd963a319ea671e372c", "measure": "2 tbsp" },
        { "id": "640c2dd963a319ea671e3763", "measure": "600ml" },
        { "id": "640c2dd963a319ea671e3792", "measure": "800g" },
        { "id": "640c2dd963a319ea671e3743", "measure": "1 tbsp" },
        { "id": "640c2dd963a319ea671e372a", "measure": "Grating" },
        { "id": "640c2dd963a319ea671e36c3", "measure": "3 tbsp" },
        { "id": "640c2dd963a319ea671e3706", "measure": "200g" },
        { "id": "640c2dd963a319ea671e3710", "measure": "1 finely sliced" },
        { "id": "640c2dd963a319ea671e3747", "measure": "200g peeled raw" },
        { "id": "640c2dd963a319ea671e3738", "measure": "Large handful" },
        { "id": "640c2dd963a319ea671e36c1", "measure": "Handful" },
        { "id": "640c2dd963a319ea671e3711", "measure": "Grated zest of 1" },
        { "id": "640c2dd963a319ea671e36f9", "measure": "25g grated" }
      ],
      "rating": 4.9
    },
    {
      "_id": "6462a8f74c3d0ddd28897fbf",
      "title": "Teriyaki Chicken Casserole",
      "category": "Chicken",
      "area": "Japanese",
      "instructions": "Preheat oven to 350° F. Spray a 9x13-inch baking pan with non-stick spray.\r\nCombine soy sauce, ½ cup water, brown sugar, ginger and garlic in a small saucepan and cover. Bring to a boil over medium heat. Remove lid and cook for one minute once boiling.\r\nMeanwhile, stir together the corn starch and 2 tablespoons of water in a separate dish until smooth. Once sauce is boiling, add mixture to the saucepan and stir to combine. Cook until the sauce starts to thicken then remove from heat.\r\nPlace the chicken breasts in the prepared pan. Pour one cup of the sauce over top of chicken. Place chicken in oven and bake 35 minutes or until cooked through. Remove from oven and shred chicken in the dish using two forks.\r\n*Meanwhile, steam or cook the vegetables according to package directions.\r\nAdd the cooked vegetables and rice to the casserole dish with the chicken. Add most of the remaining sauce, reserving a bit to drizzle over the top when serving. Gently toss everything together in the casserole dish until combined. Return to oven and cook 15 minutes. Remove from oven and let stand 5 minutes before serving. Drizzle each serving with remaining sauce. Enjoy!",
      "description": "A Japanese-inspired casserole made with chicken, teriyaki sauce, rice, and vegetables.",
      "thumb": "https://www.themealdb.com/images/media/meals/wvpsxx1468256321.jpg",
      "preview": "https://www.themealdb.com/images/media/meals/wvpsxx1468256321.jpg",
      "time": "75",
      "youtube": "https://www.youtube.com/watch?v=4aZr5hZXP_s",
      "tags": ["Meat", "Casserole"],
      "ingredients": [
        { "id": "640c2dd963a319ea671e376c", "measure": "3/4 cup" },
        { "id": "640c2dd963a319ea671e378f", "measure": "1/2 cup" },
        { "id": "640c2dd963a319ea671e367d", "measure": "1/4 cup" },
        { "id": "640c2dd963a319ea671e36f8", "measure": "1/2 teaspoon" },
        { "id": "640c2dd963a319ea671e3720", "measure": "1/2 teaspoon" },
        { "id": "640c2dd963a319ea671e36b3", "measure": "4 Tablespoons" },
        { "id": "640c2dd963a319ea671e3694", "measure": "2" },
        { "id": "640c2dd963a319ea671e3772", "measure": "1 (12 oz.)" },
        { "id": "640c2dd963a319ea671e367c", "measure": "3 cups" }
      ],
      "rating": 3.93
    }
  ]
}
